<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Personalizaci&oacute;n del men&uacute; Plantillas</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="plantillas; templates; modificar plantillas; archivos de plantillas; men&uacute; jer&aacute;rquico; subcarpeta">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Cuando se ejecuta TeXShop por primera vez, crea la carpeta</P>
		<dl>
			<dd>~/Library/TeXShop/Templates
		</dl>
		<p>(&lsquo;template&rsquo; = plantilla) y coloca en ella los archivos Graphics.tex y LatexTemplate.tex (y una carpeta llamada &laquo;More&raquo; con archivos adicionales). Los nombres de estos archivos aparecen en el men&uacute; desplegable Plantillas, que est&aacute; en la parte de arriba de la ventana destinada a escribir c&oacute;digo. Al elegir uno de estos &iacute;tem en el men&uacute;, el contenido del correspondiente archivo se inserta en el lugar en el que se encuentra el cursor.
Renientemente, Will Robertson ha revisado las plantillas Graphics y LaTeX para que sigan costumbres de TeX modernas; adem&aacute;s, Robertson ha proporcionado las plantillas del subdirectorio &laquo;More&raquo;.</p>
		<p>Los archivos con plantillas son archivos TeX est&aacute;ndar que se pueden abrir y editar con TeXShop. Se pueden a&ntilde;adir otros archivos TeX a la carpeta Templates; tambi&eacute;n aparecer&aacute;n en el men&uacute; desplegable Plantillas, siempre que su nombre acabe con la extensi&oacute;n &laquo;.tex&raquo;. Por otra parte, los archivos con plantillas originales se pueden borrar si se desea.</p>
		<p>Para crear una estructura jer&aacute;rquica en el men&uacute; Plantillas, basta colocar los archivos con plantillas en subcarpetas de ~/Library/TeXShop/Templates.</p>
		<p>Para restaurar los archivos con plantillas originales despu&eacute;s de haberlos editado, basta borrar la carpeta Templates y ejecutar TeXShop de nuevo. Esto volver&aacute; a crear la carpeta, y con sus contenidos originales.</p>
		<p>T&eacute;ngase en cuenta que si el usuario est&aacute; actualizando TeXShop, la carpeta con las plantillas no se actualiza autom&aacute;ticamente, pues algunos usuarios pueden haberla adaptado a su gusto. Si una actualizaci&oacute;n cambia las plantillas incluidas por defecto, es una buena idea mover la carpeta ~/Library/TeXShop/Templates al escritorio,
dejar que TeXShop la cree de nuevo con las plantillas incluidas por defecto,
y luego a&ntilde;adir las que tuvi&eacute;ramos nosotros en la antigua carpeta Templates.</p>
		<p>Las distribuciones recientes de la plantilla para LaTeX contienen los comandos \usepackage{amssymb} y \usepackage{graphicx}, pero no estaban incluidos por defecto en las que ven&iacute;an con versiones antiguas de TeXShop.</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda b&aacute;sica</div><div id="header_title">Personalizaci&oacute;n del men&uacute; Plantillas</div>
		<div id="menu_border">
		<ul>
			<LI><a href="basic_preliminaries.htm">Preliminares</a>
			<LI><a href="basic_installtetex.htm">C&oacute;mo obtener e instalar teTeX</a>
			<LI><a href="basic_installtexshop.htm">C&oacute;mo obtener e instalar TeXShop</a>
			<li><a href="basic_typesetting.htm">Componer (&lsquo;typeset&rsquo;) documentos</a>
			<li><a href="basic_alternatetypeset.htm">M&eacute;todos alternativos de composici&oacute;n</a>
			<li><a href="basic_spelling.htm">Correcci&oacute;n ortogr&aacute;fica</a>
			<li><a href="basic_latexpanel.htm">Panel LaTeX</a>
			<li><a href="basic_matrixpanel.htm">Panel matrices</a>
			<li><a href="basic_macros.htm">Macros</a>
			<li><a href="basic_toolbar.htm">Barra de herramientas y AppleScript</a>
			<li><a href="basic_graphics.htm">Inclusi&oacute;n de gr&aacute;ficos</a>
			<li><a href="basic_printing.htm">Imprimir</a>
			<li><a href="basic_preferences.htm">Establecer preferencias</a>
			<li><a href="basic_templates.htm">Personalizaci&oacute;n del men&uacute; Plantillas</a>
			<li><a href="basic_edittricks.htm">Trucos de edici&oacute;n</a>
			<li><a href="basic_autocompletion.htm">Autocompleci&oacute;n</a>
			<li><a href="basic_commandcompletion.htm">Compleci&oacute;n de comandos</a>
			<li><a href="basic_bugs.htm">Notificaci&oacute;n de errores (&lsquo;bugs&rsquo;)</a>
			<li><a href="basic_websites.htm">Sitios web &uacute;tiles</a>
			<li><a href="basic_license.htm">Licencia</a>
			<li><a href="basic_thistranslation.htm">Sobre la traducci&oacute;n a espa&ntilde;ol</a>
		</UL>
	</div>
	</BODY>

</HTML>
