<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Preliminares</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="preliminares; instalar por primera vez; preferencias ocultas; localizar; traducir">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Por favor, lee s&oacute;lo las primeras dos secciones (justo debajo) si eres un usuario nuevo que est&aacute; instalando TeXShop por primera vez. Si est&aacute;s actualizando desde versiones anteriores, lee esas dos secciones y las cuatro siguientes. Si est&aacute;s familiarizado con TeXShop y quieres personalizarlo, lee las restantes secciones.</P>
		<p>La primera vez que se ejecuta TeXShop, &eacute;ste coloca sus preferencias, macros, plantillas y motores de composici&oacute;n predeterminados en la carpeta Library del usuario. Si, m&aacute;s tarde, actualizas TeXShop, estas preferencias, macros, etc. no se modifican autom&aacute;ticamente, puesto que el usuario puede haberlas editado. En algunos casos (pocos), se han hecho cambios importantes en las opciones predeterminadas; aqu&iacute; detallamos estos cambios para que los usuarios de versiones previas puedan modificar las preferencias y las plantillas de manera adecuada.</p>
		<p>TeXShop tiene algunas preferencias ocultas, que pueden resultar &uacute;tiles a usuarios avanzados. Tales usuarios tambi&eacute;n pueden modificar el comportamiento del programa a&ntilde;adiendo varios archivos plist. Se dan detalles m&aacute;s adelante.</p>
		<p>Las nuevas versiones de TeXShop a veces requieren &iacute;tem de men&uacute;s adicionales y otros componentes en la interfaz. Estos nuevos &iacute;tem aparecen en ingl&eacute;s, aunque el resto del interfaz haya sido localizado a otra lengua. Si los usuarios me env&iacute;an las traducciones que se necesiten, incorporar&eacute; inmediatamente los cambios en la copia de TeXhop de mi p&aacute;gina web. Escribidme a <a href="mailto:koch@uoregon.edu">koch@uoregon.edu</a>. </p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">&iquest;C&oacute;mo configuro TeXShop?</div><div id="header_title">Preliminares</div>
		<div id="menu_border">
		<UL>
			<LI><a href="configure_preliminaries.htm">Preliminares</a>
			<LI><a href="configure_correctinstall.htm">&iquest;Has instalado TeXShop correctamente?</a>
			<LI><a href="configure_prefchanges.htm">Recomendaciones de cambios en las preferencias</a>
			<LI><a href="configure_convertgraphics.htm">Conversi&oacute;n autom&aacute;tica de formatos gr&aacute;ficos</a>
			<LI><a href="configure_defaults.htm">Preferencias predeterminadas</a>
			<LI><a href="configure_latextemplate.htm">Plantilla LaTeX predeterminada</a>
			<li><a href="configure_hidden.htm">Preferencias ocultas</a>
			<li><a href="configure_plist.htm">Archivos .plist</a>
			<li><a href="configure_panel.htm">Modificaci&oacute;n del panel LaTeX</a>
			<li><a href="configure_autocompletion.htm">Modificaci&oacute;n de la autocompleci&oacute;n</a>
			<li><a href="configure_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
			<li><a href="configure_macros.htm">Modificaci&oacute;n del men&uacute; Macros</a>
		</UL>
	</div>
	</BODY>

</HTML>
