<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Unicode</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="unicode; c&oacute;digo de caracteres; utf-8">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Unicode es un formato que puede manejar simult&aacute;neamente caracteres de todo tipo de lenguas: &aacute;rabe, chino, griego, hebreo, japon&eacute;s, lenguas latinas, ruso, y muchas otras. Cocoa maneja Unicode, luego tambi&eacute;n TeXShop puede hacerlo. Para experimentar, abre la preferencia Internacional en las Preferencias del Sistema, elige la solapa Men&uacute; Teclado y a&ntilde;ade tipos de entrada adicionales (teclados) a los ya seleccionados. Es instructivo seleccionar griego (pues es familiar), hebreo (porque se escribe de derecha a izquierda), &aacute;rabe (que se escribe de derecha a izquierda y hace un uso extensivo de ligaduras, adem&aacute;s de que sus caracteres tienen aspecto diferente seg&uacute;n est&eacute;n en el interior o en el final de una palabra), y chino. Aparece un nuevo men&uacute; con una bandera que indica el tipo de entrada activo.</P>
		<p>Teclea algunos caracteres, cambia de lengua, y teclea algunos m&aacute;s.</p>
		<p>Existen diversos formatos para archivos Unicode. Por medio de las Preferencas, el usuario puede seleccionar el que desee. El Unicode OSX est&aacute;ndar es el c&oacute;digo usual que emplea Mac OSX, pero desconozco si es habitual en el mundo de TeX. El Unicode UTF-8 es un formato popular, ya que los caracteres ASCII ordinarios aparecen como siempre. Si guardamos un archivo con formato UTF-8, TeX lo procesar&aacute;, pero convertir&aacute; los caracteres Unicode en caracteres extra&ntilde;os.</p>
		<p>Existe un paquete TeX que acepta archivos codificados con Unicode UTF-8; v&eacute;ase</p>
		<dl>
			<dd><tt>http://www.ctan.org/tex-archive/macros/latex/contrib/supported/unicode/</tt>
		</dl>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">Unicode</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
