<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="pdfsync, sincronizar, sincronizaci&oacute;n">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>La sincronizaci&oacute;n es una importante utilidad incorporada en Textures, una implementaci&oacute;n comercial de TeX para Macintosh Classic desarrollada por Blue Sky TeX Systems. Al usar la sincronizaci&oacute;n, un autor puede hacer clic en la ventana del dvi previsto e, inmediatamente, el cursor aparece en el correspondiente lugar de la ventana de c&oacute;digo. Blue Sky ha prometido una versi&oacute;n nativa para MacOS X de Textures, pero todav&iacute;a no la ha lanzado. La implementaci&oacute;n de la sincronizaci&oacute;n en Textures es admirada por su habilidad para localizar el correspondiente punto en el c&oacute;digo.</P> 

<P>Desde esa implementaci&oacute;n, varios sistemas TeX han incorporado, aproximadamente, la misma utilidad. Para ello han usado estilos adicionales que tambi&eacute;n hac&iacute;an que TeX escribiera informaci&oacute;n extra en el archivo dvi. Ninguna de estas aproximaciones (incluyendo los m&eacute;todos incorporados en TeXShop, y que describimos m&aacute;s adelante) es tan precisa como el m&eacute;todo de Textures.</P>

<P>TeXShop proporciona sincronizaci&oacute;n entre el c&oacute;digo y el pdf de dos maneras. El m&eacute;todo predeterminado usa una habilidad introducida en Mac OS X 10.4, y que permite buscar cadenas de texto en archivos pdf. Con este m&eacute;todo, no es necesaro cargar ning&uacute;n archivo de estilo. Haz click sobre una frase de la ventana con c&oacute;digo mientras pulsas la tecla comando de Apple; el pdf se desplaza, en su correspondiente ventana, hasta el lugar oportuno, y la frase aparece destacada, rodeada por un c&iacute;rculo rojo. De manera similar, si haces comando-click en la ventana con el pdf, la ventana con el c&oacute;digo se abre (si es necesario), el texto se desplaza hasta el lugar apropiado, y la frase aparece resaltada en amarillo.</P>

<P>Este m&eacute;todo es independiente del motor de composici&oacute;n usado, as&iacute; que funciona con pdftex y pdflatex, con TeX + Ghostscript y LaTeX + Ghostscript, con XeTeX, y con cualquier otro motor.</P>

<P>Para sacar provecho de esta habilidad, es &uacute;til conocer el mecanismo interno. Sup&oacute;n que haces click en un punto del c&oacute;digo fuente. TeXShop obtiene una cadena de 20 caracteres centrada en el click, y lo busca en el correspondiente archivo pdf. Si la encuentra exactamente una vez, nos la muestra, rodeada de un c&iacute;rculo rojo. Pero, a menudo, las cadenas de c&oacute;digo contienen comandos, que no aparecen como texto en el pdf; en particular, esto siempre ocurre al componer f&oacute;rmulas matem&aacute;ticas. As&iacute; que, si la b&uacute;squeda falla, TeXShop retrocede 5 caracteres, obtiene una nueva cadena de 20 caracteres, y lo intenta de nuevo. Si es necesario, repite esta operaci&oacute;n hasta 20 veces. Si en ninguno de estos intentos tiene &eacute;xito, lo intenta de nuevo 20 veces m&aacute;s, esta vez con cadenas por delante de la cadena original, en lugar de por detr&aacute;s. Si ninguna de estas operaciones de b&uacute;squeda tiene &eacute;xito, TeXShop renuncia.</P>

<P>Como consecuencia, es obvio que es mejor hacer click en frases que en f&oacute;rmulas. Los p&aacute;rrafos que contienen muchos comandos de composici&oacute;n tampoco se sincronizan bien. Sin embargo, la experiencia muestra que estas b&uacute;squedas generalmente tienen &eacute;xito, y que no hace falta preocuparse demasiado de elegir un punto adecuado sobre el que hacer click.</P>

<P>La sincronizaci&oacute;n desde la ventana con el df a la ventana con el c&oacute;digo funciona de la misma manera, pero tiene una complicaci&oacute;n adicional. Los proyectos pueden contener muchos archivos de c&oacute;digo, insertados por medio de comandos \include o \input. TeXshop maneja esta complicaci&oacute;n asumiendo que todos los \include e \input aparecen en el archivo ra&iacute;z, por medio de comandos \include{este archivo}, \input{este archivo} o \import{este archivo}. En la  implementaci&oacute;n inicial (en la versi&oacute;n 2.0) TeXShop hac&iacute;a una lista de los primeros 20 archivos y buscaba en todos ellos; consideraba que la b&uacute;squeda hab&iacute;a tenido &eacute;xito si la cadena de texto aparec&iacute;a exactamente en uno de estos archivos. Si la cadena est&aacute; en un archivo sin abrir, TeXShop lo abre. Entonces, el texto se desplaza hasta el lugar apropiado, y la frase aparece resaltada en amarillo. (Ese n&uacute;mero de 20 archivos ya ha sido aumentado a 60, y a&uacute;n puede cambiar en el futuro; escribe si necesitas que la b&uacute;squeda alcance a una mayor cantidad de archivos.)</P>

<P>Versiones anteriores de TeXShop usaban un m&eacute;todo de sincronizaci&oacute;n alternativo, inventado en 2003 por J&eacute;r&ocirc;me Laurens y Piero D'Ancona. 
Ellos escribieron un archivo de estilo similar, en cierto sentido, a los que funcionaban a&ntilde;adiendo informaci&oacute;n extra sobre el .dvi, pero para pdflatex. Su paquete, pdfsync.sty, hace que pdftex escriba, al componer p&aacute;ginas, un archivo extra, en el cual guarda la informaci&oacute;n necesaria para lograr la correlaci&oacute;n entre los archivos de entrada (c&oacute;digo tex) y salida (pdf). El trabajo de Laurens y D'Ancona depende de comandos internos de pdftex que sacan las coordenadas x e y de ciertas operaciones de composici&oacute;n, as&iacute; que s&oacute;lo funciona con pdftex, pdflatex y context; no sirve si usas tex + ghostscript para componer.</P>

<P>TeXShop todav&iacute;a puede usar este m&eacute;todo. Puedes elegir qu&eacute; tipo de sincron&iacute;a usar en la solapa Misc de las preferencias: &laquo;Pdf Sync&raquo; es le m&eacute;todo original, y &laquo;B&uacute;squeda&raquo; el nuevo. Tambi&eacute;n es posible indicarle que use ambos. En ese caso, si el m&eacute;todo de las b&uacute;squedas en el pdf falla, es entonces cuando sincroniza con pdfsync.</P>

<P>El m&eacute;todo &laquo;pdfsync&raquo; requiere que tengas instalada la &uacute;ltima versi&oacute;n de pdfsync.sty. Lee &laquo;&iquest;C&oacute;mo configuro TeXShop?: &iquest;Has instalado TeXShop correctamente?&raquo; para estar seguro de si lo has hecho bien.</P>

<P>Para usar pdfsync con LaTeX, a&ntilde;ade al pre&aacute;mbulo de tu documento con c&oacute;digo tex (antes de la l&iacute;nea con el \begin{document}) la siguiente l&iacute;nea:
<dl>
<dd>\usepackage{pdfsync}
</dl>
Este paquete ser&aacute; ignorado si est&aacute;s compilando con tex + ghostscript, pero si lo estas haciendo con pdflatex, se crear&aacute; un archivo extra con extansi&oacute;n .pdfsync. Por ejemplo, si el documento con el c&oacute;dido fuente se llama main.tex, el archivo extra se llamar&aacute; main.pdfsync. Este archivo contiene la informaci&oacute;n necesaria para relacionar puntos del archivo pdf con puntos del archivo tex. Cuando se usa pdfsync, la mayor&iacute;a de los archivos se compilan sin errores, pero, en un peque&ntilde;o n&uacute;mero de casos, este paquete introduce errores extra.
Si eso ocurre, el c&oacute;digo peligroso se puede encerrar entre un par de comandos
\pdfsyncstop y \pdfsyncstart. Por otra parte, para aumentar la precisi&oacute;n, se pueden a&ntilde;adir puntos de syncronizaci&oacute;n extra mediante el comando \pdfsync.
</P>

<P>Una vez que has compuesto las p&aacute;ginas a partir de un archivo con pdfsync, haz clic en un punto del pdf previsto mientras mantienes pulsada la tecla comando. Aparecer&aacute; en el frente la ventana con el c&oacute;digo, all&iacute; estar&aacute; seleccionada la l&iacute;nea que contiene el correspondiente c&oacute;digo, y la ventana se desplazar&aacute; hasta mostrar esa l&iacute;nea si fuera necesario. Si un proyecto contiene un archivo ra&iacute;z y cap&iacute;tulos adicionales a&ntilde;adidos con \include, y si el punto en la ventana del pdf corresponde al c&oacute;digo incluido en el archivo de alg&uacute;n cap&iacute;tulo, el archivo se abrir&aacute;, aparecer&aacute; en el frente, y se producir&aacute; el desplazamiento hasta el lugar apropiado en el c&oacute;digo.</P>

<P> Esta sincron&iacute;a tambi&eacute;n funciona en sentido contrario. Haz click en una l&iacute;nea del c&oacute;digo fuente mientras mantienes pulsada la tecla comando. Entonces, TeXShop muestra la ventana con el pdf previsto, y selecciona la p&aacute;gina apropiada.
Este proceso funciona si el documento con el c&oacute;digo tiene una l&iacute;nea %SourceDoc o un archivo ra&iacute;z; se selecciona la p&aacute;gina apropiada en la ventana con el pdf del documento ra&iacute;z.
</P>

<P> Aviso: si un documento ra&iacute;z usa \include para a&ntilde;adir otros archivos de c&oacute;digo, pero estos archivos no saben cu&aacute;l es su documento ra&iacute;z (es decir, no tienen l&iacute;nea &laquo;%!TEX root&raquo; o archivo root), entonces comando-click nos desplaza desde la ventana con el pdf a la del c&oacute;digo incluido, pero no puede volver de la del c&oacute;digo incluido a la del pdf. Esto se remedia f&aacute;cilmente a&ntilde;adiendo el correspondiente comentario &laquo;%!TEX root&raquo; al comienzo de cada archivo con c&oacute;digo.
</P>

<P> Tal como se ha explicado antes, pdfsync funciona con archivos que se cargan con \include{myfile}. Tambi&eacute;n funciona cuando el modo que se usa para incluir archivos es \input{myfile}; pero la sintaxis alternativa \input myfile no funciona.
</P>

<p> El archivo pdfsync.sty se usa en LaTeX; los archivos similares pdfsync.tex y pdfsync4context.tex sirven para la sincronizaci&oacute;n con tex y context.</p>

<p> La sincronizaci&oacute;n funciona por medio de un archivo mysource.pdfsync en el que se almacenan los datos correspodientes a ciertos puntos de sincronizaci&oacute;n en la ventana con el pdf previsto. Grosso modo, cada entrada de datos contiene </p>
<dl>
<dd> el n&uacute;mero de la p&aacute;gina del documento pdf en el que se ha colocado el punto
<dd> la localizaci&oacute;n del punto en esa p&aacute;gina
<dd> el nombre del archivo de c&oacute;digo que ha producido el punto
<dd> el n&uacute;mero de l&iacute;nea en ese documento de c&oacute;digo que ha producido el punto
</dl>
<p> Hay una manera de indicarle a TeXShop que muestre esos puntos de sincronizaci&oacute;n. La barra de herramientas de la ventana del pdf contiene un &lsquo;checkbox&rsquo; llamado SyncMarks. Por defecto, este &iacute;tem no aparece; usa &laquo;Personalizar barra de herramientas...&raquo; en el men&uacute; ventana para ponerlo. Cuando el &lsquo;checkbox&rsquo; est&aacute; marcado, TeXShop muestra los puntos de sincronizaci&oacute;n.</p>
<p> Cuando la ventana con el pdf previsto aparece por primera vez, este &iacute;tem no est&aacute; marcado. Esto se puede cambiar con una preferencia oculta:</p>
<dl>
<dd> defaults write TeXShop ShowSyncMarks YES
</dl> 
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
