<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Componer (&lsquo;typeset&rsquo;) documentos</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="componer; typeset; marca; abrir; varios archivos; modificar comportamiento">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Para usar TeXShop, escribe un archivo con c&oacute;digo LaTeX en la ventana de edici&oacute;n incorporada. Entonces pulsa el bot&oacute;n LaTeX que se encuentra en la parte de arriba de la ventana. TeXShop guarda el archivo y llama a pdflatex. Se abre una segunda ventana (la consola) en la que se muestran los mensajes que proporciona tex. Si hay errores, pdflatex se parar&aacute;; pulsa &laquo;return&raquo; para ignorar los errores uno a uno, o una de las instrucciones est&aacute;ndar de tex para salir, continuar en silencio, etc. Despu&eacute;s de compilar el documento con un m&iacute;nimo de &eacute;xito, aparece una nueva ventana mostrando el archivo pdf que hemos obtenido. Podemos alternar entre las dos ventanas tecleando comando-1.</P>
		<p>Al pulsar con el rat&oacute;n en alguna parte de la ventana con la salida pdf, aparece una lupa que aumenta una peque&ntilde;a regi&oacute;n cercana al cursor. Haciendo doble click, se aumenta una regi&oacute;n mayor; y con triple click, otra aun mayor. Para predeterminar el tama&ntilde;o de la regi&oacute;n que se aumenta, basta usar la herramienta destinada a tal fin (y que se encuentra en la barra de herramientas, justo encima de la p&aacute;gina).</p>
		<p>Para componer un documento TeX (m&aacute;s propiamente dicho, plain TeX), pulsa el bot&oacute;n &laquo;Programa&raquo; y selecciona Plain TeX en lugar de LaTeX. Si generalmente usas plain TeX, elige TeX como opci&oacute;n por defecto en el di&aacute;logo de Preferencias.</p>
		<p>Si al compilar aparece un error en el c&oacute;digo (se muestra en la consola), puedes corregirlo de modo inmediato en la ventana de edici&oacute;n; entonces, pulsa el bot&oacute;n &laquo;Componer&raquo; de nuevo. En este momento, TeXShop interrumpir&aacute; la compilaci&oacute;n en curso y comenzar&aacute; una nueva con el c&oacute;digo corregido.</p>
		<p>TeXShop memoriza los n&uacute;meros de l&iacute;nea en los que han ocurrido los veinte primeros errores. Para ir, de manera sucesiva, a estas l&iacute;neas de c&oacute;digo, elije &laquo;Ir al error&raquo; en el men&uacute; Edici&oacute;n o usa la correspondiente equivalencia de teclado.</p>
		<p>Cuando corriges errores y vuelves a compilar, el visor de pdf recuerda en qu&eacute; p&aacute;gina te encontrabas y la muestra de nuevo.</p>
		<p>Si una l&iacute;nea de c&oacute;digo comienza con los caracteres &laquo;%:&raquo;, TeXShop interpreta el resto de la l&iacute;nea como una &laquo;marca&raquo;, que aparecer&aacute; en el men&uacute; desplegable Marcas. Al elegir uno de los &iacute;tems de este men&uacute;, TeXShop nos llevar&aacute; a la correspondiente l&iacute;nea en el documento con el c&oacute;digo fuente. Las l&iacute;neas que comienzan con las palabras  \section, \subsection, \subsubsection o \chapter se a&ntilde;aden autom&aacute;ticamente al men&uacute; Marcas. Sin embargo, se puede cambiar este comportamiento tecleando el siguiente comando en el Terminal de Apple:
		<dl>
			<dd><tt>defaults write edu.uoregon.math.koch.TeXShop TagSections NO</tt>
		</dl>
		<p>TeXShop puede manejar varios documentos. Si elegimos &laquo;Nuevo&raquo; o &laquo;Abrir&raquo;, el documento (o documentos) que ten&iacute;amos abierto permanece as&iacute; y se abre una nueva ventana de c&oacute;digo. Si abrimos un archivo tex de una carpeta en la cual hay un archivo pdf con el mismo nombre, tambi&eacute;n aparece una ventana que muestra el pdf.</p>
		<p>A algunos usuarios les gusta dividir el c&oacute;digo fuente en m&uacute;ltiples archivos controlados por un archivo maestro que usa comandos \input. Si, en las Preferencias, el &iacute;tem &laquo;Al guardar, Guardar relacionados&raquo; est&aacute; activado, cuando vayamos a componer, TeXShop se encargar&aacute; de buscar el archivo maestro, y guardar&aacute; cualquier archivo \input que est&eacute; abierto. Esto ha sido implementado por John Nairn.</p>
		<p>Podemos cargar TeXShop haciendo doble click en un documento con extensi&oacute;n &laquo;.tex&raquo;. El programa abre este documento y (si existe) el documento pdf asociado.</p>
		<p>Podemos cerrar la ventana con el pdf en cualquier momento. Reaparecer&aacute; al componer el documento de nuevo. Si cerramos la ventana de c&oacute;digo, entonces se cerrar&aacute; tambi&eacute;n, autom&aacute;ticamente, la ventana con su correspondiente pdf (las ventanas de otros documentos tex permanecer&aacute;n abiertas). Por tanto, si una ventana con c&oacute;digo te est&aacute; estorbando en la pantalla, puede ser preferible minimizarla, en lugar de cerrarla.</p>
		<p>pdftex y pdflatex son programas unix derivados del programa TeX de Donald Knuth. La sintaxis de TeX no permite espacios en los nombres de archivos, luego no deber&iacute;amos incluir espacios en los nombres de los archivos creados con TeXShop. Sin embargo, TeXShop en s&iacute; mismo no tiene ning&uacute;n problema con tales archivos.</p>
		<p>El comportamiento de la ventana con el pdf previsto se puede cambiar usando los &iacute;tem  &laquo;Aumento&raquo; y &laquo;Mostrar p&aacute;ginas&laquo; del men&uacute; PDF. Por ejemplo, puedes configurar el desplazamiento para que fluya de manera continua por todas las p&aacute;ginas del documento (opci&oacute;n &laquo;Multip&aacute;gina&laquo); la ventana con el pdf previsto puede mostrar dos paginas juntas; se puede conseguir que, al modificar el tama&ntilde;o de la ventana, se cambie el aumento proporcionado por la lupa. Experimenta hasta que encuentres lo que prefieres y, entonces, f&iacute;jalo de este modo en las preferencias.</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda b&aacute;sica</div><div id="header_title">Componer (&lsquo;typeset&rsquo;) documentos</div>
		<div id="menu_border">
		<ul>
			<LI><a href="basic_preliminaries.htm">Preliminares</a>
			<LI><a href="basic_installtetex.htm">C&oacute;mo obtener e instalar teTeX</a>
			<LI><a href="basic_installtexshop.htm">C&oacute;mo obtener e instalar TeXShop</a>
			<li><a href="basic_typesetting.htm">Componer (&lsquo;typeset&rsquo;) documentos</a>
			<li><a href="basic_alternatetypeset.htm">M&eacute;todos alternativos de composici&oacute;n</a>
			<li><a href="basic_spelling.htm">Correcci&oacute;n ortogr&aacute;fica</a>
			<li><a href="basic_latexpanel.htm">Panel LaTeX</a>
			<li><a href="basic_matrixpanel.htm">Panel matrices</a>
			<li><a href="basic_macros.htm">Macros</a>
			<li><a href="basic_toolbar.htm">Barra de herramientas y AppleScript</a>
			<li><a href="basic_graphics.htm">Inclusi&oacute;n de gr&aacute;ficos</a>
			<li><a href="basic_printing.htm">Imprimir</a>
			<li><a href="basic_preferences.htm">Establecer preferencias</a>
			<li><a href="basic_templates.htm">Personalizaci&oacute;n del men&uacute; Plantillas</a>
			<li><a href="basic_edittricks.htm">Trucos de edici&oacute;n</a>
			<li><a href="basic_autocompletion.htm">Autocompleci&oacute;n</a>
			<li><a href="basic_commandcompletion.htm">Compleci&oacute;n de comandos</a>
			<li><a href="basic_bugs.htm">Notificaci&oacute;n de errores (&lsquo;bugs&rsquo;)</a>
			<li><a href="basic_websites.htm">Sitios web &uacute;tiles</a>
			<li><a href="basic_license.htm">Licencia</a>
			<li><a href="basic_thistranslation.htm">Sobre la traducci&oacute;n a espa&ntilde;ol</a>
		</UL>
	</div>
	</BODY>

</HTML>
