<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Preliminares</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Preliminares</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Por favor, lee s&oacute;lo la primera secci&oacute;n (justo debajo) si eres un usuario nuevo que est&aacute; instalando TeXShop por primera vez. Si est&aacute;s actualizando desde versiones anteriores, lee esa secci&oacute;n y las tres siguientes. Si est&aacute;s familiarizado con TeXShop y quieres personalizarlo, lee las restantes secciones.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">La primera vez que se ejecuta TeXShop, &eacute;ste coloca sus preferencias y plantillas predeterminadas en la carpeta Library del usuario. Si, m&aacute;s tarde, actualizas TeXShop, estas preferencias y plantillas no se modifican automaticamente, puesto que el usuario puede haberlas editado. En algunos casos (pocos), se han hecho cambios importantes en las opciones predeterminadas; aqu&iacute; detallamos estos cambios para que los usuarios de versiones previas puedan modificar las preferencias y las plantillas de manera adecuada.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop tiene algunas preferencias ocultas, que pueden resultar &uacute;tiles a usuarios avanzados. Tales usuarios tambi&eacute;n pueden modificar el comportamiento del programa a&ntilde;adiendo varios archivos plist. Se dan detalles m&aacute;s adelante.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Las nuevas versiones de TeXShop a veces requieren &iacute;tem de men&uacute;s adicionales y otros componentes en la interfaz. Estos nuevos &iacute;tem aparecen en ingl&eacute;s, aunque el resto del interfaz haya sido localizado a otra lengua. Si los usuarios me env&iacute;an las traducciones que se necesiten, incorporar&eacute; inmediatamente los cambios en la copia de TeXhop de mi p&aacute;gina web. Escribidme a <a href="mailto:koch@math.uoregon.edu">koch@math.uoregon.edu</a>. </font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>
