<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>&iquest;Has instalado TeXShop correctamente?</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="instalaci&oacute;n correcta; carpeta TeX; macro; pdfsync">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Comenzando con la versi&oacute;n 1.34, y continuando en la 1.35, TeXShop dispone de una utilidad denominada pdfsync: al hacer clic en alg&uacute;n punto de la ventana con el pdf previsto, se abre la ventana correspondiente al c&oacute;digo TeX y, en ella, aparece seleccionada la l&iacute;nea de c&oacute;digo apropiada.
Para que esto funcione, es necesario que teTeX tenga instalados los archivos &laquo;pdfsync.sty&raquo;, &laquo;pdfsync.tex&raquo; y &laquo;pdfsync4context.tex&raquo; en las carpetas ~/Library/texmf/tex/latex, ~/Library/texmf/tex/plain y ~/Library/texmf/tex/context, respectivamente. Si ya exist&iacute;a, borra el antiguo &laquo;pdfsync.sty&raquo; de la carpeta ~/Library/texmf/tex/latex. A continuaci&oacute;n, busca los nuevos archivos en la distribuci&oacute;n de TeXShop y arr&aacute;stralos a sus correspondientes carpetas. Aqu&iacute;, ~/Library se refiere a la carpeta Library de tu directorio de usuario (&lsquo;home&rsquo;). Si no lo has hecho antes, puede que necesites crear alguna de las carpetas texmf, tex, latex, plain y context.</P>
		<P>Desde la versi&oacute;n 1.33, TeXShop viene con applescripts adicionales realizados por Claus Gerhardt y Will Robertson. Si est&aacute;s actualizando desde una versi&oacute;n anterior, no los ver&aacute;s autom&aacute;ticamente.</P>
		<p>Si no has editado nunca el conjunto de macros predeterminadas, puedes activar las nuevos macros yendo a la carpeta ~/Library/TeXShop y borrando toda la carpeta Macros que hay all&iacute;. La siguiente vez que lo arranques, TeXShop volver&aacute; a crear esta carpeta con las &uacute;ltimos macros. No es suficiente borrar el contenido de la carpeta Macros; hay que borrar tambi&eacute;n la carpeta misma.</p>
		<p>Si has editado las macros que ven&iacute;an por defecto, y a&ntilde;adido algunas nuevas, borra temporalmente la carpeta Macros y deja que TeXShop cree una nueva. Entonces, a&ntilde;ade las macros propias que ya ten&iacute;as con el editor de macros.
		<p> TeXShop 1.35 viene con nuevas plantillas creadas por Will Robertson. 
Estas plantillas no se instalan autom&aacute;ticamente. Puedes conseguirlas yendo a la carpeta ~/Library/TeXShop y moviendo la carpeta Templates entera al escritorio.
La siguiente vez que arranques TeXShop, &eacute;ste crear&aacute; de nuevo esa carpeta, y pondr&aacute; dentro las &uacute;ltimas versiones de las plantillas. Ahora, puedes mover las antiguas plantillas que hubieras editado desde el escritorio a la carpeta ~/Library/TeXShop/Templates reci&eacute;n creada.
</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">&iquest;C&oacute;mo configuro TeXShop?</div><div id="header_title">&iquest;Has instalado TeXShop correctamente?</div>
		<div id="menu_border">
		<UL>
			<LI><a href="configure_preliminaries.htm">Preliminares</a>
			<LI><a href="configure_correctinstall.htm">&iquest;Has instalado TeXShop correctamente?</a>
			<LI><a href="configure_prefchanges.htm">Recomendaciones de cambios en las preferencias</a>
			<LI><a href="configure_convertgraphics.htm">Conversi&oacute;n autom&aacute;tica de formatos gr&aacute;ficos</a>
			<LI><a href="configure_defaults.htm">Preferencias predeterminadas</a>
			<LI><a href="configure_latextemplate.htm">Plantilla LaTeX predeterminada</a>
			<li><a href="configure_hidden.htm">Preferencias ocultas</a>
			<li><a href="configure_plist.htm">Archivos .plist</a>
			<li><a href="configure_panel.htm">Modificaci&oacute;n del panel LaTeX</a>
			<li><a href="configure_autocompletion.htm">Modificaci&oacute;n de la autocompleci&oacute;n</a>
			<li><a href="configure_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
			<li><a href="configure_macros.htm">Modificaci&oacute;n del men&uacute; Macros</a>
		</UL>
	</div>
	</BODY>

</HTML>
