<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Recomendaciones de cambios en las preferencias</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="cambios en preferencias; colocar ventana de c&oacute;digo y del PDF previsto; aumento; magnification; seguridad; aviso shell-escape">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>
Los usuarios pueden querer cambiar algunas de las preferencias previamente establecidas por TeXShop. Algunos de estos cambios depender&aacute;n de determinadas caracter&iacute;sticas individuales, y no se pueden establecer hasta no haber usado el programa.
</P>
		<p>
Por defecto, TeXShop abre la ventana de c&oacute;digo y la del pdf previsto en la posici&oacute;n en que las mostr&oacute; por &uacute;ltima vez. Esto s&oacute;lo tiene sentido cuando estamos manejando un solo documento cada vez. Usualmente, es mejor abrir ambas ventanas en un lugrar &oacute;ptimo predeterminado. Para ver qu&eacute; es lo que ocurre, compila un documento. Entonces, pon el tama&ntilde;o y posici&oacute;n de la ventana donde quieras. Si la pantalla es grande, lo mejor es ponerlas una junto a otra. En la solapa &laquo;Documento&raquo;, selecciona &laquo;Comenzar con posici&oacute;n fija&raquo; y haz click en &laquo;Establecer con posici&oacute;n actual&raquo;. Haz el mismo cambio en la solapa &laquo;PDF previsto&raquo;.
</p>
		<p>
Es ahora una buena ocasi&oacute;n para prefijar el aumento de la ventana con el PDF previsto. Utiliza el bot&oacute;n para escalar (en la parte de arriba de la ventana) hasta que obtengas lo que deseas. Entonces, en la solapa &laquo;PDF previsto&raquo; de las Preferencias, teclea el aumento que has considerado &oacute;ptimo, pulsa el bot&oacute;n &laquo;Establecer&raquo;, y luego &laquo;OK&raquo;.
</p>
		<p>
Finalmente, puedes querer enfrentarte con un posible problema de seguridad. Por defecto, TeXShop est&aacute; configurado para permitir que pdftex y pdflatex llamen a otros programas cuando est&aacute;n componiendo. Cuando pdftex encuentra una ilustraci&oacute;n en un formato que no entiende, autom&aacute;ticamente llama a un programa de conversiones gr&aacute;ficas, para que convierta el gr&aacute;fico en un formato &uacute;til. Por ejemplo, los archivos eps se convierten en pdf, y los archivos tif en png.
</p>
<p>
Sin embargo, la configuraci&oacute;n permite a pdftex llamar a CUALQUIER programa. Es concebible que otro usuario te env&iacute;e un archivo tex que, al compilarlo, le haga a tu sistema cosas no muy agradables. Si est&aacute;s precupado por que te pueda ocurrir esto, vete a la solapa &laquo;Motor&raquo; de las Preferencias y selecciona la opci&oacute;n &laquo;Avisos shell-escape&raquo;. Cuando este bot&oacute;n est&aacute; marcado, la primera vez que TeXShop compila una archivo tex en una sesi&oacute;n, aparece un di&aacute;logo que te permite desactivar la comunicaci&oacute;n entre pdftex y otros programas durante toda la compilaci&oacute;n del archivo. As&iacute;, puedes continuar consiguiendo la conversi&oacute;n autom&aacute;tica en tus propios archivos, pero actuar de manera segura cuando los hayas recibido de otros.
</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">&iquest;C&oacute;mo configuro TeXShop?</div><div id="header_title">Recomendaciones de cambios en las preferencias</div>
		<div id="menu_border">
		<UL>
			<LI><a href="configure_preliminaries.htm">Preliminares</a>
			<LI><a href="configure_correctinstall.htm">&iquest;Has instalado TeXShop correctamente?</a>
			<LI><a href="configure_prefchanges.htm">Recomendaciones de cambios en las preferencias</a>
			<LI><a href="configure_convertgraphics.htm">Conversi&oacute;n autom&aacute;tica de formatos gr&aacute;ficos</a>
			<LI><a href="configure_defaults.htm">Preferencias predeterminadas</a>
			<LI><a href="configure_latextemplate.htm">Plantilla LaTeX predeterminada</a>
			<li><a href="configure_hidden.htm">Preferencias ocultas</a>
			<li><a href="configure_plist.htm">Archivos .plist</a>
			<li><a href="configure_panel.htm">Modificaci&oacute;n del panel LaTeX</a>
			<li><a href="configure_autocompletion.htm">Modificaci&oacute;n de la autocompleci&oacute;n</a>
			<li><a href="configure_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
			<li><a href="configure_macros.htm">Modificaci&oacute;n del men&uacute; Macros</a>
		</UL>
	</div>
	</BODY>

</HTML>
