<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Establecer un documento ra&iacute;z</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="documento ra&iacute;z; archivo ra&iacute;z; root file; varios archivos peque&ntilde;os; proyecto">
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Establecer un documento ra&iacute;z</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">En lugar de tener un archivo TeX muy grande, es usual descomponerlo en varios archivos m&aacute;s peque&ntilde;os controlados por un documento ra&iacute;z (&lsquo;root&rsquo;). Por ejemplo, el archivo ra&iacute;z de un proyecto de un libro puede tener la forma
</font></P>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\documentclass[11pt]{book}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\includeonly{Chapter2/two.tex}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\textwidth = 6.5 in</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\textheight = 9 in</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\begin{document}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\include{Chapter1/one.tex}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\include{Chapter2/two.tex}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\include{Chapter3/three.tex}</tt></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\end{document}</tt></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Este documento ra&iacute;z contiene comandos que afectar&aacute;n al proyecto entero (por ejemplo, para controlar la apariencia del libro), pero el texto del libro en s&iacute; mismo est&aacute; contenido en los archivos one.tex, two.tex y three.tex. La segunda l&iacute;nea del c&oacute;digo anterior le indica a TeX que componga s&oacute;lo el cap&iacute;tulo dos, lo cual permite acelerar las pruebas de composici&oacute;n mientras estamos escribiendo el cap&iacute;tulo dos. Cuando el libro est&eacute; completo, basta con que &laquo;comentemos esta l&iacute;nea&raquo; (a&ntilde;adiendo % delante) y as&iacute; podremos componer el libro entero.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Mientras estamos escribiendo el cap&iacute;tulo dos, lo m&aacute;s natural es que tengamos abierto el archivo two.tex con TeXShop. Pero, despu&eacute;s de que hayamos hecho cambios en este archivo, TeXShop no debe componer two.tex; en su lugar, debe componer el archivo ra&iacute;z. Le podemos indicar a TeXShop que haga esto usando el men&uacute; &laquo;Documento ra&iacute;z...&raquo;. Esto har&aacute; que aparezca un panel con una caja de texto en la que podemos escribir el nombre del documento ra&iacute;z.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Si el documento ra&iacute;z est&aacute; en la misma carpeta que el achivo que estamos editando, es suficiente con que demos su nombre, incluyendo la extensi&oacute;n &laquo;.tex&raquo;. Por ejemplo, si el archivo ra&iacute;z se llama Main, ponemos Main.tex en la caja de texto.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Si el archivo ra&iacute;z est&aacute; en un directorio diferente, debemos dar su nombre relativo a la localizaci&oacute;n del archivo que estamos editando. En el ejemplo anterior, los diversos cap&iacute;tulos est&aacute;n contenidos en subcarpetas dentro de la carpeta que contiene al documento ra&iacute;z. En tal caso, introducimos ../Main.tex en la caja de texto, indicando de esta manera la locaolizaci&oacute;n del archivo ra&iacute;z relativo al archivo con cada cap&iacute;tulo.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Finalmente, podemos proporcionar el nombre del archivo ra&iacute;z por medio de su nombre absoluto, como en /Users/me/Main.tex.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Si todo el c&oacute;digo TeX est&aacute; en un solo archivo, no es necesario establecer el documento ra&iacute;z.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop recuerda el nombre del documento ra&iacute;z escribiendo esta informaci&oacute;n en un archivo con el mismo nombre que el archivo que estamos editando y la extensi&oacute;n &laquo;.texshop&raquo;. Por ejemplo, si el archivo para el cap&iacute;tulo dos es two.tex, TeXShop guarda el nombre del archivo ra&iacute;z en two.texshop, en el mismo directorio que two.tex. Si borramos two.texshop, a partir de entonces TeXShop compondr&aacute; two.tex en lugar de Main.tex.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Hay un m&eacute;todo alternativo de establecer cu&aacute;l es el documento ra&iacute;z. En lugar de hacerlo por medio del men&uacute;, podemos incluir, en el archivo con el c&oacute;digo fuente de cada cap&iacute;tulo, una l&iacute;nea como &eacute;sta:</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>%SourceDoc ../Main.tex</tt></font>
		</dl>
		<ul>
			
		</ul>
	</BODY>

</HTML>
