<HTML>

<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
<TITLE>Panel LaTeX</TITLE>
</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Panel LaTeX</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Bajo el men&uacute; Ventana, hay un &iacute;tem llamado &laquo;Panel LaTeX...&raquo;. Al elegirlo, se abrir&aacute; un panel que contiene una gran cantidad de s&iacute;mbolos matem&aacute;ticos, letras griegas, caracteres internacionales, y entornos de composici&oacute;n. Al hacer click en un s&iacute;mbolo, el correspondiente texto se insertar&aacute; en el archivo con el c&oacute;digo fuente LaTeX. Debemos este magn&iacute;fico panel a Geoffroy Lenglin; su correo electr&oacute;nico es <a href="mailto:geoffroy.lenglin@m4x.org">geoffroy.lenglin@m4x.org</a>.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Algunos s&iacute;mbolos del panel requieren la l&iacute;nea</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\usepackage{amssymb}</tt></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">al principio en el c&oacute;digo fuente. </font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Es posible personalizar el comportamiento del panel. Cuando TeXShop se ejecuta por primera vez, crea una archivo ~/Library/TeXShop/LatexPanel/completion.plist en tu carpeta de usuario Library. &Eacute;ste es un archivo de texto ordinario que se puede abrir y editar con TeXShop. En &eacute;s se encuentran todas las cadenas de caracteres que se insertan en el c&oacute;digo TeX cuando se elige un &iacute;tem de la paleta. Si una de tales cadenas de caracteres contiene #SEL#, entonces lo que est&eacute; seleccionado reemplazar&aacute; a esta expresi&oacute;n en el texto que se inserta. Si contiene #INS#, entonces el cursor se colocar&aacute; en esa posici&oacute;n tras insertar el texto. Para personalizar el comportamiento del panel, hay que editar completion.plist.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Editar archivos plist requiere peque&ntilde;os trucos; v&eacute;ase, en la ayuda, el apartado dedicado a ello. Si usas caracteres Unicode, aseg&uacute;rate de editar y guardar el archivo con formato UTF-8.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Los usuarios pueden a&ntilde;adir hasta diecis&eacute;is &iacute;tem adicionales al Panel LaTeX, editando el archivo completion.plist. &Eacute;stos aparecen en el subpanel &laquo;Personal&raquo; del Panel LaTeX. Para conocer con m&aacute;s detalle c&oacute;mo a&ntilde;adir estos &iacute;tem, v&eacute;anse los comentarios sobre completion.plist.</font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>

