<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Trucos de edici&oacute;n</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="trucos de edici&oacute;n; comentarios; sangr&iacute;a; dividir ventana; arrastrar y soltar; archivo de respaldo; backup file">
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Trucos de edici&oacute;n</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Podemos comentar grupos de l&iacute;neas usando un comando en el correspondiente men&uacute; y, si lo deseamos, activarlas de nuevo m&aacute;s tarde. Tambi&eacute;n podemos sangrar varias l&iacute;neas a la vez, o quitarles la sangr&iacute;a. Si el comienzo de una l&iacute;nea est&aacute; tabulado, las nuevas l&iacute;neas que vayamos creando comienzan con la misma tabulaci&oacute;n, hasta que cancelemos este comportamiento con la tecla de retroceso. Este comportamiento con tabuladores ha sido a&ntilde;adido a TeXShop por Nicol&aacute;s Ojeda B&auml;r, de Argentina, cuyo correo electr&oacute;nico es <a href="mailto:lojedaortiz@interlink.com.ar">lojedaortiz@interlink.com.ar</a>. &iexcl;Gracias!</font></P>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">La ventana con el c&oacute;digo fuente se puede dividir en dos usando la correspondiente herramienta que aparece en la parte de arriba de la ventana. Cuando la ventana est&aacute; dividida, se muestran dos vistas del mismo c&oacute;digo. Puedes teclear en cualqueira de las dos partes, y los cambios que efect&uacute;es en una aparecer&aacute;n tambi&eacute;n &mdash;autom&aacute;ticamente&mdash; en la otra. De este modo, puedes efectuar modificaciones en una secci&oacute;n del c&oacute;digo teniendo a la vista otra secci&oacute;n del c&oacute;digo.</font></P>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Podemos arrastrar iconos de archivos en la ventana de c&oacute;digo. Si el archivo que se arrastra es un archivo TeX, se a&ntilde;ade un comando \input junto con la ruta relativa que lleva al archivo. Si es un archivo gr&aacute;fico, se a&ntilde;ade, en su lugar, un comando \includegraphics.</font></P>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Podemos hacer que TeXShop cree un archivo de respaldo (&lsquo;buckup&rsquo;) cada vez que guardamos o componemos. Para ello, hay que emplear las preferencias ocultas. Para que TeXShop cree archivos de respaldo, abre la Terminal y teclea el siguiente comando:</font></P>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>defaults write edu.uoregon.math.koch.TeXShop SaveBackup YES</tt></font>
		</dl>
<P><font size="2" face="Lucida Grande,Geneva,Arial">Cambia YES por NO para dejar de hacer copias de respaldo.
</font></P>


		<ul>
			
		</ul>
	</BODY>

</HTML>
