<HTML>

<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
<TITLE>TeXShop beschaffen und installieren</TITLE>
<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Unter http://pages.uoregon.edu/koch/texshop/texshop.html k&ouml;nnen Sie TeXShop herunterladen und nach dieser Anleitung installieren.">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>
	<div id="content_border">	
			<P>Rufen Sie im Webbrowser folgende Seite auf:
			<p><a href="(EmptyReference!)" target="http://pages.uoregon.edu/koch/texshop/texshop.html">http://pages.uoregon.edu/koch/texshop/texshop.html</a></p>
			<p>Klicken Sie auf den Link &bdquo;TeXShop&ldquo; um die Datei &bdquo;TeXShop.dmg&ldquo; herunterzuladen. Nachdem Sie doppelt auf die Datei geklickt haben, erscheint ein Ordner, der TeXShop und einige andere Dateien enth&auml;lt. Diese zus&auml;tzlichen Dateien k&ouml;nnen Sie lesen oder auch l&ouml;schen. Ziehen Sie TeXShop in den Ordner &bdquo;Programme&ldquo;. Wenn Sie es h&auml;ufiger benutzen m&ouml;chten, sollten Sie das Icon in das Dock ziehen.</p>
				<p> TeXShop beinhaltet eine Funktion mit Namen pdfsync. Hiermit k&ouml;nnen Sie durch Klicken in das Vorschau-Fenster zum entsprechenden Punkt im Quelltext gelangen. Um diese Funktion zu nutzen, m&uuml;ssen die Dateien &bdquo;pdfsync.sty&ldquo;, "pdfsync.tex" und "pdfsync4context.tex in teTeX installiert sein. Kopieren Sie diese Datei aus der TeXShop Distribution, die Sie aus dem Internet geladen haben, und kopieren Sie diese nach &bdquo;~/Library/texmf/tex/latex&ldquo;, ~/Library/texmf/tex/plain und ~/Library/texmf/tex/contex. Wobei &bdquo;~/Library&ldquo; der Library-Ordner Ihres Privat-Verzeichnisses ist. Sollten einige der oben genannten Ordner nicht existieren, m&uuml;ssen Sie diese erstellen.</p>
				<p>Seit Version 1.35 werden mit TeXShop AppleScripts von Will Robertson und Claus Gerhardt mitgeliefert. Wenn Sie von einer &auml;lteren Verion aktualisieren erscheinen diese Skripte nicht automatisch im Men&uuml; &bdquo;Makros&ldquo;.</p>
				<p>Wenn Sie die Standardmakros nicht ver&auml;ndert haben, k&ouml;nnen Sie die Skripte erhalten, indem Sie den Ordner &bdquo;Macros&ldquo; aus dem Ordner &bdquo;~/Library/TeXShop&ldquo; l&ouml;schen. Beim n&auml;chsten Start wird TeXShop den Ordner mit den neuen Skripten neu anlegen. Es gen&uuml;gt nicht, den Inhalt des Makro Ordners zu l&ouml;schen, der gesammte Ordner muss entfernt werden.</p>
				<p>Wenn Sie die Standardmakros ge&auml;ndert haben, solten Sie den oben genannten Ordner &bdquo;Macros&ldquo; nur an einen anderen Ort verschieben. Nachdem TeXShop den neuen Ordner angelegt hat, k&ouml;nnen Sie Ihre angepassten Makros mit Hilfe des Makro-Editors wieder einf&uuml;gen.</p>
				<p>TeXShop 1.35 enth&auml;lt neue Vorlagen von Will Robertson. Diese Vorlagen werden nicht automatisch installiert. Um diese zu nutzen ist der gesamte "Templates" Ordner aus &bdquo;~/Library/TeXShop&ldquo; am besten auf den Desktop zu verschieben. Beim n&auml;chsten Start erstellt TeXShop den Ordner mit den aktuellen Vorlagen neu. Ältere von Ihnen bearbeitete Vorlagen k&ouml;nnen dann von dem auf den Desktop befindlichen alten Ordner in den neuen zurückbewegt werden. 
	</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Grundlagen</div>
<div id="header_title">TeXShop beschaffen und installieren</div>


	<div id="menu_border">
		<UL>
			<LI><a href="basic_preliminaries.htm">Einf&uuml;hrung</a></li>
			<LI><a href="basic_installtetex.htm">teTeX beschaffen und installieren</a></li>
			<LI><a href="basic_installtexshop.htm">TeXShop beschaffen und installieren</a></li>
			<LI><a href="basic_typesetting.htm">Dokumente setzen</a></li>
			<li><a href="basic_alternatetypeset.htm">Alternativer Schriftsatzmodus</a></li>
			<li><a href="basic_spelling.htm">Rechtschreibpr&uuml;fung</a></li>
			<li><a href="basic_latexpanel.htm">LaTeX Palette</a></li>
			<li><a href="basic_matrixpanel.htm">Matrix-Palette</a></li>
			<li><a href="basic_macros.htm">Makros</a></li>
			<li><a href="basic_toolbar.htm">Werkzeugleiste und AppleScript</a></li>
			<li><a href="basic_graphics.htm">Grafik einf&uuml;gen</a></li>
			<li><a href="basic_printing.htm">Drucken</a></li>
			<li><a href="basic_preferences.htm">Einstellungen &auml;ndern</a></li>
			<li><a href="basic_templates.htm">&Auml;ndern des Vorlagenmen&uuml;s</a></li>
			<li><a href="basic_edittricks.htm">Bearbeitungstipps</a></li>
			<li><a href="basic_autocompletion.htm">Autovervollst&auml;ndigen</a></li>
			<li><a href="basic_commandcompletion.htm">Vervollst&auml;ndigung von Befehlen</a></li>
			<li><a href="basic_bugs.htm">Fehlerbericht &uuml;bermitteln</a></li>
			<li><a href="basic_websites.htm">N&uuml;tzliche Webseiten</a></li>
			<li><a href="basic_license.htm">Lizenz</a></li>
		</UL>
	</div>
	
</BODY>
</HTML>