Repository: TeXShop/TeXShop
Catalog: Resources/Interfaces/*.lproj/Encodings.strings
Languages: german, italian, japanese, spanish, zh_cn

source: DOS Chinese Simplified
german: Vereinfachtes Chinesisch (Windows, DOS)
italian: Cinese semplificato (Windows, DOS)
japanese: 簡体字中国語（Windows, DOS）
spanish: Chino simplificado (Windows, DOS)
zh_cn: 简体中文 (Windows, DOS)

source: DOS Chinese Traditional
german: Traditionelles Chinesisch (Windows, DOS)
italian: Cinese tradizionale (Windows, DOS)
japanese: 繁体字中国語（Windows, DOS）
spanish: Chino tradicional (Windows, DOS)
zh_cn: 繁体中文 (Windows, DOS)

source: DOS Cyrillic
german: Kyrillisch (DOS)
italian: Cirillico (DOS)
japanese: キリル文字（DOS）
spanish: Cirílico (DOS)
zh_cn: 西里尔文 (DOS)

source: DOS Russian
german: Russisch (DOS)
italian: Russo (DOS)
japanese: ロシア語（DOS）
spanish: Ruso (DOS)
zh_cn: 俄文 (DOS)

source: DOSJapanese
german: Japanisch (Windows, DOS, ShiftJIS )
italian: Giapponese (Windows, DOS, ShiftJIS )
japanese: Japanese (ShiftJIS )
spanish: Japonés (Windows, DOS, ShiftJIS )
zh_cn: 日文 (Windows, DOS, ShiftJIS )

source: EUC_JP
german: Japanisch (EUC)
italian: Giapponese (EUC)
japanese: Japanese (EUC)
spanish: Japonés (EUC)
zh_cn: 日文 (EUC)

source: GB 18030
german: Chinesisch (GB 18030)
italian: Cinese (GB 18030)
japanese: 中国語（GB 18030）
spanish: Chino (GB 18030)
zh_cn: 中文 (GB 18030)

source: GB 2312
german: Vereinfachtes Chinesisch (GB 2312)
italian: Cinese semplificato (GB 2312)
japanese: 簡体字中国語（GB 2312）
spanish: Chino simplificado (GB 2312)
zh_cn: 简体中文 (GB 2312)

source: GBK
german: Chinesisch (GBK)
italian: Cinese (GBK)
japanese: 中国語（GBK）
spanish: Chino (GBK)
zh_cn: 中文 (GBK)

source: IsoLatin
german: Westeuropäisch (ISO Latin 1)
italian: Occidentale (ISO Latin 1)
japanese: 欧米（ISO Latin 1）
spanish: Occidental (ISO latino 1)
zh_cn: 西文 (ISO Latin 1)

source: IsoLatin2
german: Mitteleuropäisch (ISO Latin 2)
italian: Centro-Europa (ISO Latin 2)
japanese: 中欧（ISO Latin 2）
spanish: Centroeuropeo (ISO latino 2)
zh_cn: 中欧语系 (ISO Latin 2)

source: IsoLatin5
german: Türkisch (ISO Latin 5)
italian: Turco (ISO Latin 5)
japanese: トルコ語（ISO Latin 5）
spanish: Turco (ISO latino 5)
zh_cn: 土耳其 (ISO Latin 5)

source: IsoLatin9
german: Westeuropäisch (ISO Latin 9)
italian: Occidentale (ISO Latin 9)
japanese: 欧米（ISO Latin 9）
spanish: Occidental (ISO latino 9)
zh_cn: 西文 (ISO Latin 9)

source: IsoLatinGreek
german: Greek (ISO 8859-7)
italian: Greek (ISO 8859-7)
japanese: Greek (ISO 8859-7)
spanish: Greek (ISO 8859-7)
zh_cn: 希腊文 (ISO 8859-7)

source: JISJapanese
german: Japanisch (ISO 2022-JP)
italian: Giapponese (ISO 2022-JP)
japanese: Japanese (JIS)
spanish: Japonés (ISO 2022-JP)
zh_cn: 日文 (ISO 2022-JP)

source: KOI8_R
german: Russisch (KOI8-R)
italian: Russo (KOI8-R)
japanese: ロシア語（KOI8-R）
spanish: Ruso (KOI8-R)
zh_cn: 俄文 (KOI8-R)

source: Mac Central European Roman
zh_cn: Mac 中欧语系

source: Mac Chinese Simplified
german: Vereinfachtes Chinesisch (Mac OS)
italian: Cinese semplificato (Mac OS)
japanese: 簡体字中国語（Mac OS）
spanish: Chino simplificado (Mac OS)
zh_cn: 简体中文 (Mac OS)

source: Mac Chinese Traditional
german: Traditionelles Chinesisch (Mac OS)
italian: Cinese tradizionale (Mac OS)
japanese: 繁体字中国語（Mac OS）
spanish: Chino tradicional (Mac OS)
zh_cn: 繁体中文 (Mac OS)

source: Mac Cyrillic
german: Kyrillisch (Mac OS)
italian: Cirillico (Mac OS)
japanese: キリル文字（Mac OS）
spanish: Cirílico (Mac OS)
zh_cn: 西里尔文 (Mac OS)

source: MacJapanese
german: Japanisch (Mac OS, ShiftJIS ¥)
italian: Giapponese (Mac OS, ShiftJIS ¥)
japanese: Japanese (ShiftJIS ¥)
spanish: Japonés (Mac OS, ShiftJIS ¥)
zh_cn: 日文 (Mac OS, ShiftJIS ¥)

source: MacKorean
german: Koreanisch (Mac OS)
italian: Coreano (Mac OS)
japanese: 韓国語（Mac OS）
spanish: Coreano (Mac OS)
zh_cn: 韩文 (Mac OS)

source: DOSKorean
zh_cn: 韩文 (Windows, DOS)

source: MacOSRoman
german: Westeuropäisch (Mac OS Lateinisch)
italian: Occidentale (Mac OS Roman)
japanese: 欧米（Mac OS Roman）
spanish: Occidental (Mac OS Roman)
zh_cn: 西文 (Mac OS Roman)

source: SJIS_X0213
german: Japanisch (Shift JIS X0213)
italian: Giapponese (Shift JIS X0213)
japanese: Japanese (ShiftJIS X0213)
spanish: Japonés (Shift JIS X0213)
zh_cn: 日文 (Shift JIS X0213)

source: Standard Unicode
german: Unicode (UTF-16)
italian: Unicode (UTF-16)
japanese: Unicode (UTF-16)
spanish: Unicode (UTF-16)
zh_cn: Unicode (UTF-16)

source: UTF-8 Unicode
german: Unicode (UTF-8)
italian: Unicode (UTF-8)
japanese: Unicode (UTF-8)
spanish: Unicode (UTF-8)
zh_cn: Unicode (UTF-8)

source: Windows Cyrillic
german: Kyrillisch (Windows)
italian: Cirillico (Windows)
japanese: キリル文字（Windows）
spanish: Cirílico (Windows)
zh_cn: 西里尔文 (Windows)

source: WindowsCentralEurRoman
german: Central European Roman (Windows)
italian: Central European Roman (Windows)
japanese: Central European Roman (Windows)
spanish: Central European Roman (Windows)
zh_cn: 中欧语系 (Windows)
