Repository: TeXShop/TeXShop
Catalog: Resources/Interfaces/*.lproj/InfoPlist.strings
Languages: de, zh_cn

# NSHumanReadableCopyright
source: Copyright 2001-2022, Richard Koch https://pages.uoregon.edu/koch/texshop/texshop.html
de: Copyright 2001-2021, Richard Koch https://pages.uoregon.edu/koch/texshop/texshop.html
zh_cn: 版权所有 2001-2016, Richard Koch http://pages.uoregon.edu/koch/texshop/texshop.html

source: TeX File
de: TeX Dokument

source: LaTeX File
de: LTX File

source: ConTeXt File
de: ctx Datei

source: mp
de: mp Datei
zh_cn: mp 文件

source: sty
de: sty Datei
zh_cn: STY 文件

source: cls
de: cls Datei
zh_cn: CLS 文件

source: mf
de: mf Datei
zh_cn: mf 文件

source: bst
de: bst Datei
zh_cn: bst 文件

source: bib
de: bib Datei
zh_cn: TeX bib 文件

# NSTIFFPboardType
source: TIFF Document
de: TIFF-Dokument
zh_cn: TIFF 文档

source: PNG Image
de: PNG-Bild

# jpeg
source: JPEG Image
de: JPEG-Bild
zh_cn: JPEG 图像

# NSEPSPboardType
source: EPS Image
de: EPS-Dokument
zh_cn: EPS 文档

source: epsi
de: EPSI Dokument
zh_cn: EPSI 文档

source: log
de: TeX Log Datei

source: aux
de: TeX Aux Datei

source: PostScript File
de: Postscript-Dokument
zh_cn: PostScript 文档

source: HieroTeX File
de: HieroTeX-Dokument

source: Sketch File
de: Sketch-Dokument

source: dvi
de: dvi Datei

source: ins
de: ins Datei
zh_cn: INS 文件

source: dtx
de: dtx Datei
zh_cn: DTX 文件

source: drv
de: drv Datei
zh_cn: drv 文件

source: abc
de: abc Datei
zh_cn: abc 文件

source: ly
de: ly Datei
zh_cn: ly 文件

source: Rnw
de: Rnw Datei
zh_cn: Rnw 文件

source: asy
de: asy Datei
zh_cn: asy 文件

source: Stex
de: Stex Datei

source: lytex
de: lytex Datei

source: cbx
de: cbx Datei
zh_cn: cbx 文件

# lbx
source: lbc
de: lbc Datei
zh_cn: lbx 文件

source: bbx
de: bbx Datei
zh_cn: bbx 文件

source: skt
de: skt Datei
zh_cn: skt 文件

# py
source: Python File
de: py Datei

# NSStringPboardType
source: Text Document
de: Reines Textdokument
zh_cn: 纯文本文档

source: md
de: md Datei
zh_cn: md 文件

# CFBundleHelpBookName
source: TeXShop Help
zh_cn: TeXShop 帮助

source: clo
zh_cn: CLO 文件

source: dn
zh_cn: dn 文件

source: engine
zh_cn: TeXShop 引擎

source: fd
zh_cn: FD 文件
