Repository: TeXShop/TeXShop
Catalog: Resources/Interfaces/*.lproj/Localizable.strings
Languages: fr, it, japanese, pt, spanish, zh_cn

source: Tags
fr: Étiquettes
it: Etichette
japanese: タグ
pt: Marcas
spanish: Marcas
zh_cn: 标签

source: Typeset
fr: Composition
it: Compilatore
japanese: タイプセット
pt: Compor
spanish: Componer
zh_cn: 排版

source: Save
fr: Enregistrer
it: Registra
japanese: 保存
pt: Salvar
spanish: Guardar
zh_cn: 存储

source: Print...
fr: Imprimer...
it: Stampa...
japanese: プリント...
pt: Imprimir...
spanish: Imprimir...
zh_cn: 打印...

source: Print Source...
fr: Imprimer les sources...
it: Stampa Sorgente...
japanese: ソースをプリント...
pt: Imprimir código fonte...
spanish: Imprimir código...
zh_cn: 打印源代码...

source: Set Project Root...
fr: Document principal...
it: Definisci Documento Principale...
japanese: プロジェクトルートの設定...
pt: Definir Documento principal...
spanish: Documento principal...
zh_cn: 设置项目根文件...

source: LaTeX Panel...
fr: Palette LaTeX...
it: Pannello LaTeX...
japanese: LaTeX パネル...
pt: Painel LaTeX...
spanish: Panel LaTeX...
zh_cn: LaTeX 面板...

source: Close LaTeX Panel
fr: Fermer la Palette LaTeX
it: Chiudi Pannello LaTeX
japanese: LaTeX パネルを閉じる
pt: Fechar Painel LaTeX
spanish: Cerrar panel LaTeX
zh_cn: 关闭 LaTeX 面板

source: Matrix Panel...
fr: Palette Matrice...
it: Pannello matrici...
japanese: 行列パネル...
pt: Painel Matriz...
spanish: Panel matrices...
zh_cn: 矩阵面板...

source: Close Matrix Panel
fr: Fermer la Palette Matrice
it: Chiudi Pannello matrici
japanese: 行列パネルを閉じる
pt: Fechar Painel Matriz
spanish: Cerrar panel matrices
zh_cn: 关闭矩阵面板

source: Open for Preview...
fr: Ouvrir un aperçu...
it: Apri per Anteprima...
japanese: プレビューを開く...
pt: Abrir para ver...
spanish: Abrir para previsualizar...
zh_cn: 打开以预览...

source: Open for Editing...
fr: Ouvrir pour éditer...
it: Apri per Editare...
japanese: 開いて編集する...
pt: Abrir para editar...
spanish: Abrir para editar...
zh_cn: 打开以编辑...

source: File
fr: Fichier
it: Composizione
japanese: ファイル
pt: Arquivo
spanish: Edición
zh_cn: 文件

source: Goto Error
fr: Erreur
it: Vai all'Errore
japanese: エラー箇所へ移動
pt: Mostrar erro
spanish: Ir al error
zh_cn: 转到错误

source: RotateClockwise
fr: Rotation vers la droite
it: Ruota in Senso Orario
japanese: 時計回りに回転
pt: RotacionarADireita
spanish: Rotar en sentido horario
zh_cn: 顺时针旋转

source: RotateCounterclockwise
fr: Rotation vers la gauche
it: Ruota in Senso Antiorario
japanese: 反時計回りに回転
pt: RotacionarAEsquerda
spanish: Rotar en sentido antihorario
zh_cn: 逆时针旋转

source: Comment
fr: Ajouter un commentaire
it: Aggiungi Commento
japanese: コメント
pt: Comentar
spanish: Comentar
zh_cn: 注释

source: Uncomment
fr: Enlever le commentaire
it: Rimuovi Commento
japanese: コメントを外す
pt: Descomentar
spanish: Descomentar
zh_cn: 取消注释

source: Indent
fr: Ligne en retrait
it: Aumenta Rientranza
japanese: 行を右シフト
pt: Identar
spanish: Sangrar
zh_cn: 缩进

source: Unindent
fr: À la ligne
it: Diminuisci Rientranza
japanese: 行を左シフト
pt: Remover identação
spanish: Quitar sangría
zh_cn: 取消缩进

source: Macros
it: Macro
japanese: マクロ
zh_cn: 宏

source: Open Macro Editor...
fr: Ouvrir l'éditeur de macros...
it: Apri Editor delle Macro...
japanese: マクロエディタを開く...
pt: Abrir editor de Macro...
spanish: Abrir editor de macros...
zh_cn: 打开宏编辑器...

source: Close Macro Editor
fr: Fermer l'éditeur de macros
it: Chiudi Editor delle Macro
japanese: マクロエディタを閉じる
pt: Fechar editor de Macro
spanish: Cerrar editor de macros
zh_cn: 关闭宏编辑器

source: Add macros from file...
fr: Ajouter une macro à partir du fichier...
it: Aggiungi macro da un file...
japanese: ファイルからマクロを追加...
pt: Adicionar macros de um arquivo...
spanish: Añadir macros desde archivo...
zh_cn: 从文件添加宏...

source: Save selection to file...
fr: Enregistrer la sélection dans le fichier...
it: Salva la selezione...
japanese: 選択したマクロをファイルに保存...
pt: Salvar seleção em um arquivo...
spanish: Guardar selección en archivo...
zh_cn: 存储选区到文件...

source: Convert \yen to \ in Pasteboard
fr: Convertir \yen en \ dans le Presse-papiers
it: Converti \yen in \ nel Pasteboard
japanese: クリップボードで ¥ を \ に変換
pt: Converter \yen para \ na área de transferência
spanish: Convertir \yen a \ en Portapapeles
zh_cn: 在夹纸板中转换 \yen 到 \

source: Convert \ to \yen in Pasteboard
fr: Convertir \ en \yen dans le Presse-papiers
it: Converti \ in \yen nel Pasteboard
japanese: クリップボードで \ を ¥ に変換
pt: Convert \ de \yen na área de transferência
spanish: Convertir \ a \yen en Portapapeles
zh_cn: 在夹纸板中转换 \ 到 \yen

source: Edit
fr: Édition
it: Composizione
japanese: 編集
pt: Editar
spanish: Edición
zh_cn: 编辑

source: Warning
fr: Avertissement
it: Avviso
japanese: 警告
pt: Atenção
spanish: Aviso
zh_cn: 警告

source: Don't Save
fr: Ne pas enregistrer
it: Non registrare
japanese: 保存しない
pt: Não salvar
spanish: No guardar
zh_cn: 不存储

source: Cancel
fr: Annuler
it: Annulla
japanese: キャンセル
pt: Cancelar
spanish: Cancelar
zh_cn: 取消

source: Do you want to save macros?
fr: Voulez-vous enregistrer les macros ?
it: Vuoi salvare le macro?
japanese: マクロの変更内容を保存しますか？
pt: Você quer salvar macros?
spanish: ¿Quieres guardar las macros?
zh_cn: 您想存储宏吗？

source: Save Spot
fr: Enregistrer le spot
it: Salva Spot
japanese: 保存ポイント
pt: Salvar ponto
spanish: Guardar posición
zh_cn: 存储位置

source: Template
fr: Modèle
japanese: テンプレート
pt: Modelo
spanish: Plantilla
zh_cn: 模板

source: Typing
japanese: 入力
pt: Compondo
spanish: Tecleando
zh_cn: 键入

# AutoComplete
source: Key Bindings
fr: Raccourcis clavier
it: Completa automaticamente
japanese: キーバインド
pt: AutoCompletar
spanish: Autocompleción
zh_cn: 自动更正

# Autocompletion
source: Bound Expression
fr: Expression liée
it: Autocompletamento
japanese: キーバインドによる入力
pt: Autocompletar
spanish: Autocompleción
zh_cn: 自动更正

source: Page Number
fr: Numéro de page
it: Numero di pagina
japanese: ページ数
pt: Número da página
spanish: Número de página
zh_cn: 页码

source: Page Number Panel
it: Pannello Numero di pagina
japanese: ページ数パネル
pt: Painel de número de página
spanish: Panel de número de página
zh_cn: 页码面板

source: Magnification Panel
fr: Panneau de magnification
it: Pannello Ingrandimento
japanese: ズーム倍率パネル
pt: Painel de zoom
spanish: Panel de aumento
zh_cn: 放大面板

source: Omit Shell Escape
fr: Omettre Shell Escape
it: Ometti Shell Escape
japanese: Shell Escape を無視する
pt: Omitir Shell Escape
spanish: Omitir shell-escape
zh_cn: 忽略 Shell Escape

source: Warning: Using Shell Escape
fr: Avertissement : utilisation de Shell Escape
it: Avviso: si sta usando il comando di Shell Escape
japanese: 警告： Shell Escape が使われています
pt: Atenção: Usando Shell Escape
spanish: Aviso: Usando shell-escape
zh_cn: 警告: 正在使用 Shell Escape

source: Preview
fr: Page
it: Anteprima
japanese: プレビュー
pt: Pré-visualizar
spanish: PDF
zh_cn: 预览

source: Display Format
fr: Afficher le format
it: Vista Documento
japanese: ページレイアウト
pt: Formato de exibição
spanish: Mostrar páginas
zh_cn: 显示样式

source: Magnification
fr: Agrandissement
it: Ingrandimento
japanese: ズーム倍率
pt: Zoom
spanish: Aumento
zh_cn: 放大

source: Copy Format
fr: Copier le format
it: Formato di copia
japanese: コピーフォーマット
pt: Copiar Formato
spanish: Copiar con formato
zh_cn: 拷贝样式

source: ToolbarItems
fr: Éléments de la barre d'outils
it: Elementi della Barra degli Strumenti
japanese: ツールバー項目
pt: ItemsBarraDeFerramentas
spanish: Herramientas
zh_cn: 工具栏项目

source: Completion
fr: Complétion
it: Completamento
japanese: コマンド補完
pt: Completar
spanish: Compleción
zh_cn: 补全

source: Path: %@ File size: %d bytes Creation date: %@ Modification date: %@
fr: Chemin : %@ File size: %d octets Creation date : %@ Modification date : %@
it: Percorso: %@ Dimensione: %d bytes Data creazione: %@ Data modifica: %@
japanese: 場所： %@ ファイルサイズ： %d バイト 作成日： %@ 変更日： %@
pt: Caminho: %@ Tamanho do arquivo: %d bytes Data de criação: %@ Data de modificação: %@
spanish: Ruta: %@ Tamaño de archivo: %d bytes Fecha de creación: %@ Fecha de modificación: %@
zh_cn: 路径: %@ File size: %d bytes Creation date: %@ Modification date: %@

source: Info: %@
fr: Informations : %@
japanese: 情報: %@
zh_cn: 信息: %@

source: %@ Characters: %d
it: %@ Caratteri: %d
japanese: %@ 文字数: %d 文字
pt: %@ Caracteres: %d
spanish: %@ Caracteres: %d

source: The file encoding changed; characters can be lost if the wrong encoding is used.
fr: L'encodage du fichier a changé ; des caractères risquent d'être perdus si le mauvais encodage est utilisé.
it: La codifica del file è cambiata; alcuni caratteri possono essere persi se si usa una codifica non appropriata.
japanese: ファイルのエンコーディングが変更されました。違うエンコーディングを使うと、文字情報が失われることがあります。
pt: A codificação do arquivo foi alterada; caracteres podem ser perdidos se uma codificação errada for usada.
spanish: La codificación del archivo ha cambiado; se pueden perder caracteres si se usa una codificación equivocada.
zh_cn: 文件编码已更改，如果使用错误的编码将会导致字符丢失。

source: Currently open files retain their old encoding.
fr: Les fichiers déjà ouverts gardent leurs encodages.
it: I file attualmente aperti mantengono la propria codifica.
japanese: 現在開かれているファイルのエンコーディングは変更されません。
pt: Arquivos abertos continuarão a manter a codificação antiga.
spanish: Los archivos actualmente abiertos mantienen su codificación antigua.
zh_cn: 当前打开的文件仍保留旧的编码。

source: Drag && Drop
fr: Glisser && Déposer
japanese: ドラッグ＆ドロップ
pt: Arrastar && Soltar
spanish: Arrastar y soltar
zh_cn: 拖拽

source: The link /Library/TeX/texbin does not exist. To fix this, go to http://tug.org/mactex and install MacTeX or Basic TeX (2015 or later). Or for a much smaller download, go to http://pages.uoregon.edu/koch and install FixLink.
japanese: /Library/TeX/texbin が見つかりません。これを修正するには、http://tug.org/mactex から MacTeX / BasicTeX を再インストールし、TeX Wiki https://texwiki.texjp.org/?Mac の記述を参照して日本語設定を行ってください。
pt: O link /Library/TeX/texbin não existe. Para corrigir isso vá no site http://tug.org/mactex e instale o MacTeX ou BasicTeX (2015 ou posterior). Ou, caso queira baixar um arquivo bem menor, vá no site http://pages.uoregon.edu/koch e instale o FixLink.
spanish: El enlace /Library/TeX/texbin no existe. Para solucionarlo, ve a http://tug.org/mactex e instala MacTeX o Basic TeX (2015 o posterior). O, para descargar menos archivos, ve a http://pages.uoregon.edu/koch e instala FixLink.
zh_cn: 目录链接 /Library/TeX/texbin 不存在。若要修复，请访问 http://tug.org/mactex 并安装 MacTeX 或 Basic TeX (2015 或更新版)。若想节省下载时间，也可访问 http://pages.uoregon.edu/koch 并安装 FixLink 用以修复。

source: %@ does not exist. TeXShop is a front end for TeX, but you also need a TeX distribution. Perhaps such a distribution was not installed or was removed during a system upgrade. If so, go to http://tug.org/mactex and follow the instructions to install MacTeX or BasicTeX.
japanese: %@ が見つかりません。TeXShop は TeX のフロントエンドに過ぎず、別途 TeX 本体のインストールが必要です。TeX 本体がインストールされていないか、システムのアップグレードの際に削除された可能性があります。もしそうなら、TeX Wiki https://texwiki.texjp.org/?Mac の記述を参照して、http://tug.org/mactex/ から MacTeX / BasicTeX をインストールするなどの対応をとってください。
pt: %@ não existe. TeXShop é um aplicativo gráfico para TeX, sendo assim você precisa de uma distribuição TeX. Possivelmente essa distribuição não está instalada ou foi removida durante uma atualização do sistema. Se for isso, então vá no site http://tug.org/mactex e siga as instruções para instalar o MacTeX ou BasicTeX.
spanish: %@ no existe. TeXShop es una interfaz gráfica para TeX, pero también necesitas una distribución de TeX. Quizás no has instalado ninguna distribución, o se ha borrado durante una actualización del sistema. En ese caso, ve a http://tug.org/mactex y sigue las instrucciones para instalar MacTeX o BasicTeX.
zh_cn: %@ 不存在。TeXShop 仅为 TeX 的前端，您还需要安装 TeX 发行包。发行包可能尚未安装，或在系统升级时被删除。若有此 况，请访问 http://tug.org/mactex 并按照说明安装 MacTeX 或 BasicTeX。

source: Can't find required tool.
fr: N'a pu trouver l'outil requis.
japanese: 必要なツールが見つかりません。
pt: Não foi possível encontrar a ferramenta necessária.
spanish: No puedo encontrar la herramienta requerida.
zh_cn: 找不到必要的工具。

source: Typesetting engine cannot be found.
fr: Le moteur TeX n'a pas été trouvé.
japanese: タイプセットエンジンが見つかりません。
pt: Motor de compilação não pode ser encontrado.
spanish: No puedo encontrar el motor de composición.
zh_cn: 找不到排版引擎。

source: The source LaTeX document cannot be found.
fr: Le source LaTeX du document n'a pas été trouvé.
japanese: LaTeX のソースが見つかりません。
pt: O fonte do documento LaTeX não pode ser encontrado.
spanish: No puedo encontrar el documento con código fuente LaTeX.
zh_cn: 找不到 LaTeX 源代码文档。

source: Sync Marks
japanese: Sync
pt: Marcas de sincronismo
zh_cn: 同步标记

source: %@ does not exist.
fr: %@ n'existe pas.
japanese: %@ が見つかりません。
pt: %@ não existe.
spanish: %@ no existe.
zh_cn: %@ 不存在。

source: %@ does not have the executable bit set.
fr: %@ ne possède pas le bit d'exécution activé.
japanese: %@ に実行権限がセットされていません。
pt: %@ não possui o bit de execução ativado
spanish: %@ no tiene puesto el bit de archivo ejecutable.
zh_cn: %@ 不存在。TeXShop 仅为 TeX 的前端，您还需要安装 TeX 发行包。发行包可能尚未安装，或在系统升级时被删除。若有此 况，请访问 http://tug.org/mactex 并按照说明安装 MacTeX 或 BasicTeX。

source: This file was opened with IsoLatin9 encoding.
fr: Ce fichier a été ouvert avec l'encodage IsoLatin9.
japanese: このファイルは IsoLatin9 エンコーディングで開かれました。
pt: Este arquivo foi aberto com a codificação IsoLatin9
spanish: Este archivo se abrirá con caracteres codificados en IsoLatin9.
zh_cn: 本文件以 IsoLatin9 西文编码打开。

source: The file could not be opened with %@ encoding because it was not saved with that encoding. If you wish to open in another encoding, close the window and open again.
fr: Le fichier n'a pu être ouvert avec l'encodage %@ parce que il n'a pas été enregistré avec celui-ci. Si vous souhaitez l'ouvrir dans un autre encodage, fermez la fenêtre et l'ouvrir à nouveau.
japanese: エンコーディングが違うため、ファイルを %@ エンコーディングで開くことができませんでした。ファイルを他のエンコーディングで開きたい場合は、ウインドウを閉じてもう一度開いて下さい。
pt: O arquivo não pode ser aberto com a codificação %@ por que este não foi salvo com esta mesma codificação. Se deseja abrí-lo em outra codificação, feche a janela e a abra novamente.
spanish: No se puede abrir el archivo con caracteres codificados en %@ porque no fue guardado con esa codificación. Si quieres abrirlo con otra codificación, cierra la ventana y ábrela de nuevo.
zh_cn: 该文件无法以 %@ 编码打开，因为它并未存储为此编码。如果您想以其他编码打开，请关闭窗口再打开。

source: Error
fr: Erreur
japanese: エラー
pt: Erro
zh_cn: 错误

source: There was an error checking for updates.
fr: Erreur pendant l'analyse des mises à jour.
japanese: アップデートを確認中にエラーが起きました。
pt: Foram encontrados erros durante a verificação por novas atualizações.
spanish: Se ha producido un error al comprobar actualizaciones.
zh_cn: 检查更新时发生错误。

source: Your copy of TeXShop is up-to-date
fr: Votre copie de TeXShop est à jour
japanese: お使いのソフトウェアは最新のものです。
pt: Sua cópia do TeXShop está atualizada
spanish: Tu copia de TeXShop está actualizada
zh_cn: TeXShop 的版本是最新的

source: You have the most recent version of TeXShop.
fr: Vous avez la version la plus récente de TeXShop.
japanese: この TeXShop は最新のバージョンです。
pt: Você possui a versão mais recente do TeXShop.
spanish: Tienes la versión más reciente de TeXShop.
zh_cn: 您正在使用最新版本的 TeXShop。

source: New version available
fr: Nouvelle version disponible
japanese: 新しいバージョンが公開されています。
pt: Nova versão está disponível
spanish: Nueva versión disponible
zh_cn: 新版本可用

source: A new version of TeXShop is available (version %@). Would you like to download it now?
fr: Une nouvelle version de TeXShop est disponible (version %@). Souhaiteriez-vous le télécharger maintenant ?
japanese: TeXShop の新しいバージョン (version %@) が公開されています。今すぐダウンロードしますか？
pt: Uma nova versão do TeXShop está disponível (versão %@). Você gostaria de fazer a transferência?
spanish: Existe una nueva versión de TeXShop disponible (versión %@). ¿Quieres descargarla ahora?

source: This version of TeXShop requires Mac OS X 10.4 or higher. Use TeXShop 1.37 instead.
fr: Cette version de TeXShop requiert Mac OS X 10.4 ou plus. Utiliser TeXShop 1.37 au lieu.
japanese: このバージョンの TeXShop が動作するためには Mac OS X 10.4 以上が必要です。代わりに TeXShop 1.37 をお使いください。
pt: A versão do TeXShop requer Mac OS X 10.4 ou superior. Tente usar a versão do TeXShop 1.37
spanish: Esta versión de TeXShop requiere Mac OS X 10.4 o mayor. Usa TeXShop 1.37 en su lugar.
zh_cn: 本版 TeXShop 需要 Mac OS X 10.4 或更高版本。请使用 TeXShop 1.37。

source: Hard Wrap
fr: Enroulement des lignes
japanese: 改行を挿入
pt: Quebra dura
spanish: Ajuste de línea dinámico
zh_cn: 硬换行

source: Newline Removal
fr: Suppression de la nouvelle ligne
japanese: 改行を削除
pt: Remoção de nova linha
spanish: Eliminar fin de línea
zh_cn: 删除新行

source: Help
fr: Aide
it: Aiuto
japanese: ヘルプ
pt: Ajuda
spanish: Ayuda
zh_cn: 帮助

source: TeXShop Demos
fr: Démos de TeXShop
japanese: TeXShop デモ
zh_cn: TeXShop 演示

source: ShowFullPath
fr: Afficher le chemin entier
japanese: フルパス表示
pt: ExibirCaminhoCompleto
spanish: Mostar ruta completa
zh_cn: 显示完整路径

source: Close Current Environment
fr: Clore l'environnement en cours
japanese: 現在の環境を閉じる
pt: Fechar ambiente atual
spanish: Cerrar el entorno actual
zh_cn: 关闭当前环境

source: Your current setting of %@ will be replaced. OK?
fr: Votre réglage actuel de %@ sera remplacé. D'accord ?
japanese: 既存の %@ の設定が置き換えられます。よろしいですか？
pt: Suas configurações atuais de %@ serão substituídas. OK?
spanish: Se reemplazará tu ajuste actual de %@. ¿De acuerdo?
zh_cn: 您当前 %@ 的设置将会被替换。确定吗?

source: Convert
fr: Convertir
japanese: 変換
pt: Converter
spanish: Convertir
zh_cn: 转换

source: The program
fr: Le programme
it: Il programma
japanese: プログラム
pt: O programa
spanish: El programa
zh_cn: 程序

source: does not exist.
fr: n'existe pas.
it: non esiste.
japanese: が見つかりません。
pt: não existe.
spanish: no existe.
zh_cn: 未找到。

source: failed to copy selection.
fr: échec de la copie de la sélection.
it: non è possibile copiare la selezione.
japanese: 選択範囲をコピーできませんでした。
pt: falha ao copiar seleção.
spanish: fallado al copiar selección.
zh_cn: 无法拷贝选中的区域。

source: failed to save selection to the file.
fr: échec de la sauvegarde de la sélection dans le fichier.
it: non è possibile salvare la selezione in un file.
japanese: 選択範囲をファイルに保存できませんでした。
pt: falha ao salvar seleção no arquivo.
spanish: fallado al guardar selección en archivo.
zh_cn: 无法将选中的区域保存至文件。

source: <a letter consisting of %d characters>
fr: <une lettre composée de %d caractères>
it: <lettera composta da %d caratteri>
japanese: <%d字からなる文字>
pt: <uma letra formada por %d caracteres>
spanish: <una letra que consta de %d caracteres>
zh_cn: <包含 %d 个字符的单字>

source: %d letters, %d words, %d lines
fr: %d lettres, %d mots, %d lignes
it: %d lettere, %d parole, %d linee
japanese: %d文字，%d単語，%d行
pt: %d letras, %d palavras, %d linhas
spanish: %d letras, %d palabras, %d líneas
zh_cn: %d 个字符, %d 个单词, 共 %d 行

source: Emoji Style
fr: Style des émoticones
it: Stile Emoji
japanese: 絵文字スタイル
pt: Estilo Emoji
spanish: Estilo emoji
zh_cn: Emoji 样式

source: Text Style
fr: Style du texte
it: Stile del testo
japanese: テキストスタイル
pt: Estilo Texto
spanish: Estilo texto
zh_cn: 文本样式

source: Character Info
fr: Info caractère
it: Info caratteri
japanese: 文字情報
pt: Informação do caractere
spanish: Información caracteres
zh_cn: 字符信息

source: Variant
fr: Variante
it: Variante
japanese: 異体字
spanish: Variante
zh_cn: 变形

source: Revert To
fr: Revenir à
it: Ripristina a
japanese: バージョンを戻す
pt: Reverter Para
spanish: Volver a
zh_cn: 复原到

# Skin Tone I-II
source: Light
fr: Très claire
it: Carnagione Molto Chiara
japanese: スキントーン I-II
pt: Branca
spanish: Tono de piel blanco
zh_cn: 浅色

# Skin Tone III
source: Medium Light
fr: Claire
it: Carnagione Abbastanza Chiara
japanese: スキントーン III
pt: Morena clara
spanish: Tono de piel moreno claro
zh_cn: 较浅

# Skin Tone IV
source: Medium
fr: Mate
it: Carnagione Leggermente Scura/Olivastra
japanese: スキントーン IV
pt: Morena moderada
spanish: Tono de piel moreno
zh_cn: 中等

# Skin Tone V
source: Medium Dark
fr: Mate
it: Carnagione Scura
japanese: スキントーン V
pt: Morena escura
spanish: Tono de piel moreno oscuro
zh_cn: 较深

# Skin Tone VI
source: Dark
fr: Noire
it: Carnagione Scurissima/Nera
japanese: スキントーン VI
pt: Negra
spanish: Tono de piel negro
zh_cn: 深色

source: Unknown encoding; using Latin 9.
fr: Encodage inconnu ; ISO Latin 9 utilisé
it: Encoding sconosciuto; attivato ISO Latin 9.
japanese: 未知のエンコーディングが指定されたため、代わりに ISO Latin 9 エンコーディングを使用しました。
pt: Codificação desconhecida; usando ISO Latin 9.
spanish: Codificación desconocida; se usará ISO Latin 9.
zh_cn: 未知编码；使用 ISO Latin 9 编码。

source: Demo Movies require Mac OS 10.9, Mavericks, or higher.
fr: Les démos requièrent Mac OS 10.9, Mavericks ou plus.
it: I filmati dimostrativi richiedono Mac OS 10.9, Mavericks, o superiore.
japanese: デモ動画の再生には OS X 10.9 Mavericks 以上が必要です。
pt: Vídeos demo requerem Mac OS 10.9, Mavericks, ou superior
spanish: Mostrar vídeos con demos requiere Mac OS 10.9, Mavericks, o superior.
zh_cn: 演示视频需要 Mac OS 10.9 Mavericks 或更高版本。

source: Source
it: Sorgente
japanese: ソース
pt: Fonte
spanish: Código
zh_cn: 源代码

source: Type sample text here. Use several lines to test interline spacing.
fr: Taper ici un exemple de texte. Utiliser plusieurs lignes pour tester interlignage.
it: Scrivi un testo d’esempio qui. Scrivi su più linee per controllare la spaziatura interlinea.
japanese: ここにサンプルテキストを打ち込んでください。 行間隔をチェックするには複数行にまたがる文字列が必要です。
pt: Digite algum texto aqui. Escreva diversas para testar o espaçamento entre linhas.
spanish: Teclea aquí un ejemplo de texto. Usa varias líneas para comprobar el interlineado.
zh_cn: 在此输入示例文本。 输入多行 以测试行间距。

# <<Close All - unlocalized>>
source: Close All
japanese: すべて閉じる

source: Close All
fr: Tout fermer
japanese: すべて閉じる

source: Sync
zh_cn: 同步

source: Color Index
fr: Index des couleurs
pt: Índice de cor
