Repository: TeXShop/TeXShop
Catalog: Resources/Interfaces/*.lproj/ToolbarItems.strings
Languages: german

# tiLabelSave
source: Save
german: Sichern

# tiPaletteLabelSave
source: Save
german: Sichern

# tiToolTipSave
source: Save the source of the document
german: Quelltext des Dokuments sichern

# tiToolTipPrintSource
source: Print the TeX source
german: TeX Quelltext drucken

# tiToolTipPrint
source: Print the PDF image
german: PDF Bild drucken

# tiLabelTypeset
source: Typeset
german: Setzen

# tiPaletteLabelTypeset
source: Typeset
german: Setzen

# tiToolTipTypeset
source: Run typesetting program
german: Schriftsatzprogramm starten

# tiLabelProgram
source: Program
german: Programm

# tiPaletteLabelProgram
source: Program
german: Programm

# tiToolTipProgram
source: Choose typesetting program
german: Schriftsatzprogramm auswählen

# tiToolTipTeX
source: Process the source using plain TeX tool
german: Quelltext mit Standard-TeX ausführen

# tiToolTipLaTeX
source: Process the source using LaTeX
german: Quelltext mit LaTeX ausführen

# tiToolTipBibTeX
source: Run BibTeX
german: Starte BibTeX

# tiToolTipMakeIndex
source: Make Index
german: Index anlegen

# tiToolTipMetaPost
source: Run MetaPost
german: Starte MetaPost

# tiToolTipConTeX
source: Run ConTeXt
german: Starte ConTeXt

# tiToolTipMetaFont
source: Run MetaFont
german: Starte MetaFont

# tiLabelPreviousPage
source: Previous
german: Zurück

# tiPaletteLabelPreviousPage
source: Alternate Previous Page
german: Alternative letzte Seite

# tiToolTipPreviousPage
source: Show previous page
german: Zeige letzte Seite

# tiLabelNextPage
source: Next
german: Nächste

# tiPaletteLabelNextPage
source: Alternate Next Page
german: Alternative nächste Seite

# tiToolTipNextPage
source: Show next page
german: Zeige nächste Seite

# tiLabelGotoPage
source: Go to page
german: Gehe zu Seite

# tiPaletteLabelGotoPage
source: Go to page
german: Gehe zu Seite

# tiToolTipGotoPage
source: Go to page
german: Gehe zu Seite

# tiLabelMagnification
source: Magnification
german: Vergrösserung

# tiPaletteLabelMagnification
source: Magnification
german: Vergrösserung

# tiToolTipMagnification
source: Set page magnification
german: Stelle Seitenvergrösserung ein

# tiLabelTemplates
source: Templates
german: Vorlagen

# tiPaletteLabelTemplates
source: Templates
german: Vorlagen

# tiToolTipTemplates
source: Select a template to insert at cursor
german: Vorlage auswählen, die beim Cursor eingefügt wird

# tiLabelTags
source: Tags
german: Markierungen

# tiPaletteLabelTags
source: Tags
german: Markierungen

# tiToolTipTags
source: Select a tag to scroll to
german: Markierungen auswählen, zu der gescrollt werden soll

# tiLabelPreviousPageButton
source: Previous
german: Zurück

# tiPaletteLabelPreviousPageButton
source: Previous Page
german: Letzte Seite

# tiToolTipPreviousPageButton
source: Show previous page
german: Letzte Seite anzeigen

# tiLabelNextPageButton
source: Next
german: Nächste

# tiPaletteLabelNextPageButton
source: Next Page
german: Nächste Seite

# tiToolTipNextPageButton
source: Show next page
german: Nächste Seite anzeigen

# tiLabelTypesetEE
source: Typeset
german: Setzen

# tiPaletteLabelTypesetEE
source: Typeset
german: Setzen

# tiToolTipTypesetEE
source: Run typesetting program
german: Starte Schriftsatzprogramm

# tiLabelProgramEE
source: Program
german: Programm

# tiPaletteLabelProgramEE
source: Program
german: Programm

# tiToolTipProgramEE
source: Choose typesetting program
german: Schriftsatzprogramm auswählen

# tiLabelAutoComplete
source: KeyBindings
german: AutoVervollständigung

# tiPaletteLabelAutoComplete
source: KeyBindings
german: AutoVervollständigung

# tiToolTipAutoComplete
source: Toggle key bindings
german: AutoVervollständigung ein-/ausschalten

# tiLabelSplit
source: Split Source
german: Fenster teilen

# tiPaletteLabelSplit
source: Split Source
german: Fenster teilen

# tiToolTipSplit
source: Toggle source split
german: Fensterteilung ein-/ausschalten

# tiLabelMacros
source: Macros
german: Makros

# tiPaletteLabelMacros
source: Macros
german: Makros

# tiToolTipMacros
source: Insert macros
german: Makros einfügen

# tiLabelMacrosEE
source: Macros
german: Makros

# tiPaletteLabelMacrosEE
source: Macros
german: Makros

# tiToolTipMacrosEE
source: Insert macros
german: Makros einfügen

# tiLabelMouseMode
source: MouseMode
german: MausModus

# tiPaletteLabelMouseMode
source: Mouse Mode
german: Mause Modus

# tiToolTipMouseMode
source: Change Mouse Mode
german: Mause Modus ändern

# tiLabelSyncMarks
source: SyncMarks
german: SynchPunkte

# tiPaletteLabelSyncMarks
source: Sync Marks
german: Synchronisationspunkte

# tiToolTipSyncMarks
source: Show Sync Marks
german: Synchronisationspunkte anzeigen

# tiLabelTypesetKIT
source: Typeset
german: Setzen

# tiPaletteLabelTypesetKIT
source: Typeset
german: Setzen

# tiToolTipTypesetKIT
source: Run typesetting program
german: Starte Schriftsatzprogramm

# tiLabelProgramKIT
source: Program
german: Setzmethode

# tiPaletteLabelProgramKIT
source: Program
german: Setzmethode

# tiToolTipProgramKIT
source: Choose typesetting program
german: Schriftsatzprogramm auswählen

# tiLabelPreviousPageKIT
source: Previous
german: Vorherige

# tiPaletteLabelPreviousPageKIT
source: Previous Page
german: Vorherige Seite

# tiToolTipPreviousPageKIT
source: Show previous page
german: Vorherige Seite anzeigen

# tiLabelNextPageKIT
source: Next
german: Nächste

# tiPaletteLabelNextPageKIT
source: Next Page
german: Nächste Seite

# tiToolTipNextPageKIT
source: Show next page
german: Nächste Seite anzeigen

# tiLabelPreviousPageButtonKIT
source: Previous
german: Zurück

# tiPaletteLabelPreviousPageButtonKIT
source: Previous Page
german: Letzte Seite

# tiToolTipPreviousPageButtonKIT
source: Show previous page
german: Letzte Seite anzeigen

# tiLabelNextPageButtonKIT
source: Next
german: Nächste

# tiPaletteLabelNextPageButtonKIT
source: Next Page
german: Nächste Seite

# tiToolTipNextPageButtonKIT
source: Show next page
german: Nächste Seite anzeigen

# tiLabelGotoPageKIT
source: Go to page
german: Gehe zu Seite

# tiPaletteLabelGotoPageKIT
source: Go to page
german: Gehe zu Seite

# tiToolTipGotoPageKIT
source: Go to page
german: Gehe zu Seite

# tiLabelMagnificationKIT
source: Magnification
german: Vergrößerung

# tiPaletteLabelMagnificationKIT
source: Magnification
german: Vergrößerung

# tiToolTipMagnificationKIT
source: Set page magnification
german: Stelle Seitenvergrösserung ein

# tiLabelMacrosKIT
source: Macros
german: Makros

# tiPaletteLabelMacrosKIT
source: Macros
german: Makros

# tiToolTipMacrosKIT
source: Insert macros
german: Makros einfügen

# tiLabelMouseModeKIT
source: MouseMode
german: Maus Modus

# tiPaletteLabelMouseModeKIT
source: Mouse Mode
german: Maus Modus

# tiToolTipMouseModeKIT
source: Change Mouse Mode
german: Maus Modus ändern

# tiLabelSyncMarksKIT
source: SyncMarks
german: SynchPunkte

# tiPaletteLabelSyncMarksKIT
source: Sync Marks
german: Synchronisationspunkte

# tiToolTipSyncMarksKIT
source: Show Sync Marks
german: Synchronisationspunkte anzeigen

# tiLabelBackForthKIT
source: Back/Forward
german: Zurück/Vorwärts

# tiPaletteLabelBackForthKIT
source: Back/Forward
german: Zurück/Vorwärts

# tiToolTipBackForthKIT
source: Back Forward Buttons
german: Zurück/Vorwärts Buttons

# tiLabelDrawerKIT
source: Drawer
german: Schublade

# tiPaletteLabelDrawerKIT
source: Drawer
german: Schublade

# tiToolTipDrawerKIT
source: Toggle Drawer
german: Schublade ein-/ausblenden
