<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Die Hauptdatei des Projekts festlegen</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Besteht Ihr Projekt aus einer Hauptdatei und mehreren in Dateien aufgeteilten Teilen, so k&ouml;nnen Sie die Hauptdatei festlegen.">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>
	<div id="content_border">
		<P>Es werden oft gro&szlig;e Dateien in mehrere kleine zerlegt, und diese kleineren Dateien werden von einer gro&szlig;en Hauptdatei kontrolliert. Als Beispiel k&ouml;nnte die Hauptdatei eines Buches folgende Form haben:</P>
		<dl>
			<dd><code>\documentclass[11pt]{book}</code>
			<dd><code>\includeonly{Kapitel2/zwei.tex}</code>
			<dd><code>\textwidth = 6.5 in</code>
			<dd><code>\textheight = 9 in</code>
			<dd><code>\begin{document}</code>
			<dd><code>\include{Kapitel1/eins.tex}</code>
			<dd><code>\include{Kapitel2/zwei.tex}</code>
			<dd><code>\include{Kapitel3/drei.tex}</code>
			<dd><code>\end{document}</code>
		</dl>
		<p>Diese Hauptdatei beinhaltet Formatierungsbefehle f&uuml;r das ganze Projekt. Der Inhalt jedoch steht in den Dateien eins.tex, zwei.tex und drei.tex. Die zweite Zeile weist TeX an nur das zweite Kapitel zu setzen. So kann man das Setzen beschleunigen, wenn man gerade am zweiten Kapitel arbeitet. Soll das ganze Buch gesetzt werden, k&ouml;nnen Sie diese Zeile auskommentieren.</p>
		<p>W&auml;hrend Sie an Kapitel 2 schreiben, habe Sie nat&uuml;rlich auch die Datei zwei.tex in TeXShop ge&ouml;ffnet. Nachdem &Auml;nderungen hieran jedoch gespeichert wurden, sollten Sie die Hauptdatei setzen und nicht die Datei zwei.tex. Sie k&ouml;nnen die Hauptdatei auf zwei Arten festlegen. Zum einen indem Sie in der ersten Zeile eines jeden Kapitels folgenden Befehl einf&uuml;gen:</p>
		<dl>
			<dd><code>%SourceDoc ../Haupt.tex</code>
		</dl>
		<p>Zum anderen k&ouml;nnen Sie den Befehl &bdquo;Hauptdatei festlegen...&ldquo; benutzen. Dieser Men&uuml;befehl &ouml;ffnet einen Dialog mit einem Textfeld, in der Sie den Namen der Hauptdatei angeben k&ouml;nnen.</p>
		<p>Ist die Hauptdatei in dem selben Ordner wie die die Eingabedatei, gen&uuml;gt es den Namen der Hauptdatei, einschlie&szlig;lich der Dateiendung &bdquo;.tex&ldquo; anzugben. Hei&szlig;t die Hauptdatei zum Beispiel Haupt, geben Sie im Textfeld Haupt.tex ein.</p>
		<p>Befindet sich die Hauptdatei in einem anderen Ordner, k&ouml;nnen Sie den Namen relativ zur Position der Eingabedateien angeben. Im obigen Beispiel sind die einzelnen Kapitel in Unterverzeichnissen zum Ordner mit der Hauptdatei abgelegt. Sie k&ouml;nnten nun den Pfad zur Hauptdatei mit ../Haupt.tex im Dialogfenster realtiv zur Position der Eingabedateien festlegen.</p>
		<p>Schlie&szlig;lich kann der Dateiname der Hauptdatei auch absolut in der Form /Users/ich/Haupt.tex eingegeben werden.</p>
		<p>Ist das ganze Projekt in einer Datei abgelegt, muss keine Hauptdatei festgelegt werden.</p>
		<p>TeXShop speichert die Information &uuml;ber die Hauptdatei in einer Datei, die den selben Namen tr&auml;gt wie die Eingabedatei und die Endung .texshop hat. So hie&szlig;e die Datei f&uuml;r den Fall von zwei.tex, zwei.texshop. Diese Datei w&uuml;rde im gleichen Ordner wie zwei.tex erzeugt. Sollte die Datei zwei.texshop sp&auml;ter einmal gel&ouml;scht werden, wird TeXShop wieder zwei.tex alleine setzen anstelle von Haupt.tex. Die .texshop-Datei wird nicht ben&ouml;tigt, wenn Sie SourceDoc in Ihr Dokument eingef&uuml;gt haben.</p>
		<p>Wenn Sie eine Hauptdatei festgelegt haben, so kann mit &bdquo;Befehl-1&ldquo; zum jeweils zum aktiven Quelltext geh&ouml;renden Vorschau-Fenster gewechselt werden. Bet&auml;tigen Sie &bdquo;Befehl-1&ldquo; ein zweites Mal, so kehren Sie wieder zum Quelltext zur&uuml;ck. Da ein Vorschaufenster zu mehreren Quelltexten geh&ouml;ren kann, wird jeweils das Fenster wieder aufgerufen, aus dem Sie zuvor das Vorschau-Fenster aufgerufen haben. Haben Sie &bdquo;Befehl-1&ldquo; vorher nicht ausgef&uuml;hrt, so wird zum Quelltext der Hauptdatei zur&uuml;ckgekehrt.</p>
	</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Erweitert</div>
<div id="header_title">Die Hauptdatei des Projekts festlegen</div>


	<div id="menu_border">
		<UL>
			<li><a href="advanced_personaltetex.htm">Pers&ouml;nliche sty- und Makrodateien zu teTeX hinzuf&uuml;gen</a></li>
			<LI><a href="advanced_addengine.htm">Zusätzliche Schriftsatz-Programme</a>
			<LI><a href="advanced_removeaux.htm">AUX-Dateien entfernen</a>
			<li><a href="advanced_externaleditor.htm">Einen externen Editor verwenden</a></li>
			<li><a href="advanced_pdfcopypaste.htm">Kopieren-Einf&uuml;gen und Drag-Drop aus dem Vorschau-Fenster</a></li>
			<li><a href="advanced_root.htm">Die Hauptdatei des Projekts festlegen</a></li>
			<li><a href="advanced_pdfsync.htm">Pdfsync</a></li>
			<li><a href="advanced_unicode.htm">Unicode</a></li>
			<li><a href="advanced_bibtex.htm">BibTeX</a></li>
			<li><a href="advanced_makeindex.htm">MakeIndex</a></li>
			<li><a href="advanced_otherfiles.htm">Andere Dateien mit TeXShop &ouml;ffnen</a></li>
			<li><a href="advanced_mathematica.htm">Mathematica</a></li>
			<li><a href="advanced_localization.htm">Lokalisierungen</a></li>
			<li><a href="advanced_syntaxcolor.htm">Syntax Farben </a></li>
			<li><a href="advanced_shellescape.htm">Shell Escape Schutz</a></li>
			<li><a href="advanced_coloredtext.htm">Farbiger Text in TeX</a></li>
			<li><a href="advanced_moretetex.htm">Mehr &uuml;ber teTeX</a></li>
			<li><a href="advanced_fink.htm">Zusammenarbeit mit Fink</a></li>
			<li><a href="advanced_otherdistributions.htm">Zusammenarbeit mit anderen TeX Distributionen</a></li>
			<li><a href="advanced_context.htm">ConTeXt und MetaPost</a></li>
			<li><a href="advanced_plist.htm">Plist Dateien</a></li>
			<li><a href="advanced_menushortcuts.htm">Tastaturk&uuml;rzel neubelegen</a></li>
		</UL>
	</div>
	
	</BODY>
</HTML>