<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Establecer preferencias</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Establecer preferencias</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Hay varias cosas que pueden cambiarse usando el men&uacute; Preferencias: la tipograf&iacute;a por defecto en la ventana de c&oacute;digo, la escala por defecto de la ventana de salida (pdf previsto), y la posici&oacute;n de estas ventanas cuando aparecen por primera vez. Se puede configurar la consola para que aparezca siempre que componemos un documento, o s&oacute;lo aparezca cuando hay alg&uacute;n error.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">El di&aacute;logo de preferencias se puede usar tambi&eacute;n para cambiar los comandos que se ejecutan al pulsar los botones &laquo;TeX&raquo; y &laquo;LaTeX&raquo;. Esto es &uacute;til pues algunos usuarios prefieren usar una versi&oacute;n de TeX llamada etex, y existen versiones pdf de etex llamadas pdfetex y pdfelatex. Obviamente, los comandos sustitutivos deben producir como salida un archivo pdf. Si los nuevos programas est&aacute;n en el directorio del c&oacute;digo binario de teTeX, basta con poner su nombre en la correspondiente casilla del di&aacute;logo de preferencias; el di&aacute;logo tambi&eacute;n aceptar&aacute; el nombre completo de la ruta (&lsquo;path&rsquo;) si el programa se encuentra en otra parte.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop edita archivos utilizando las clases Cocoa de Apple, que usan Unicode para su funcionamiento interno. Pero cuando TeXShop guarda archivos en disco, generalmente los convierte a c&oacute;digo ASCII de 8 bits, porque esto es lo que espera encontrar TeX en un archivo. Hay tres maneras de efectuar esta conversi&oacute;n, llamadas Mac OS Roman, Iso Latin 1 e Iso Latin 2. Por medio de las preferencias podemos elegir la que deseemos. Para muchos usuarios, la elecci&oacute;n no representar&aacute; ninguna diferencia. Algunos paquetes de TeX permiten al usuario introducir caracteres acentuados europeos directamente del teclado; estos paquetes requieren la conversi&oacute;n Iso Latin. Gracias a Martin Heusse  por proporcionar el c&oacute;digo que implementa esta elecci&oacute;n. Versiones previas de TeXShop siempre usaban la conversi&oacute;n Mac OS Roman.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Los usuarios de Jap&oacute;n y Corea pueden preferir otros tipos de conversi&oacute;n, tambi&eacute;n disponibles.</font></p>
	<p><font size="2" face="Lucida Grande,Geneva,Arial">Es posible cambiar el color de fondo de la ventana destinada al c&oacute;digo fuente TeX. Sin embargo, el di&aacute;logo de preferencias no dispone de la interfaz para efectuar este cambio. Para asignar (r, g, b) = (.42, .39, .77) como color de fondo, ejecuta en el Terminal los siguientes comandos:</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial">defaults write TeXShop background_R 0.42</font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial">defaults write TeXShop background_G 0.39</font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial">defaults write TeXShop background_B 0.77</font>
		</dl>

		<ul>
			
		</ul>
	</BODY>

</HTML>