<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>A&ntilde;adir archivos personales a teTeX</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="tetex; a&ntilde;adir archivos sty">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>
Es habitual que los usuarios creen archivos sty, cls, bib y tex para utilizarlos en varios proyectos. Seguro que tex y latex los encuentran si est&aacute;n en la misma carpeta que el documento con c&oacute;digo tex que se est&aacute; componiendo, pero de esta manera hay que tener m&uacute;ltiples copias de estos archivos en el ordenador.
 </P>

<P>
Si lo deseamos, podemos hacer que estos archivos sean visibles para todos los proyectos de teTeX, tanto si componemos con TeXShop o desde el Terminal. Para ello, en la carpeta Library de tu directorio personal, crea una subcarpeta y ll&aacute;mala texmf. Crea en ella subcarpetas llamadas tex, bibtex y makeindex. Y, dentro de tex, crea otra subcarpeta llamada latex. Almacena tus archivos personales en estas carpetas.
 </P>

<P>
Tex encontrar&aacute; cualquier archivo que est&eacute; en ~/Library/texmf/tex o en una subcarpeta de este directorio. Latex encontrar&aacute; cualquier archivo en ~/Library/texmf/tex/latex o en una subcarpeta de este directorio, y bibtex y makeindex encontrar&aacute;n cualquier archivo en ~/Library/texmf/bibtex o ~/Library/texmf/makeindex respectivamente, o en sus subcarpetas. No es necesario ejecutar texhash despu&eacute;s de a&ntilde;adir estas carpetas.
 </P>

<P>
En otras m&aacute;quinas Unix, suele ser com&uacute;n que haya que notificar a tex la localizaci&oacute;n de los archivos personales por medio de las variables de entorno TEXINPUTS, BSTINPUTS, and BIBINPUTS. Habitualmente, esto no es necesario en la distribuci&oacute;n de teTeX de Gerben Wierda, pero se puede hacer en algunas circunstancias. Mac OS X permite que los usuarios notifiquen a los programas el valor de las variables de entorno creando en el directorio ra&iacute;z (del usuario) un archivo llamado ~/.MacOSX/environment.plist.
Estas variables de entorno tienen efecto en cualquier shell, y las usan todos los programas Carbon y Cocoa, o sea que hay que ser cuidadoso al crear este archivo.
 </P>

<P>
A continuaci&oacute;n mostramos un ejemplo de archivo environment.plist que me ha enviado Nathan Potter; &iexcl;gracias! 
Para m&aacute;s detalles, cons&uacute;ltese
<a href="http://developer.apple.com/qa/qa2001/qa1067.html">http://developer.apple.com/qa/qa2001/qa1067.html</a>.

 </P>
<br>


<center><img align=center src="environment.tiff" border=3></center>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">A&ntilde;adir archivos personales a teTeX</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales y codificaci&oacute;n de caracteres</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_formats.htm">Creaci&oacute;n y uso de formatos de TeX</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
