Repository: TeXShop/TeXShop
Catalog: *.lproj/Localizable.strings
Languages: dutch, german

source: Tags
dutch: Markeringen
german: Markierungen

source: Typeset
dutch: Zet
german: Setzen

source: Save
dutch: Bewaar
german: Sichern

source: Print...
german: Drucken...

source: Print Source...
dutch: Print broncode
german: Quelltext drucken...

source: Set Project Root...
dutch: Stel moederbestand ln...
german: Hauptdatei festlegen...

source: LaTeX Panel...
dutch: LaTeX venster...
german: LaTeX Palette...

source: Close LaTeX Panel
dutch: Sluit LaTeX venster
german: LaTeX Palette schließen

source: Open for Preview...
dutch: Open alleen Printvoorbeeld
german: Zur Voransicht öffnen...

source: Open for Editing...
dutch: Open in TeXShop Editor
german: Zum Bearbeiten öffnen...

source: File
dutch: Archief
german: Bearbeiten

source: Goto Error
dutch: Ga naar fout...
german: Gehe zu Fehler

source: RotateClockwise
dutch: Roteer met klok mee
german: Drehen im Uhrzeigersinn

source: RotateCounterclockwise
dutch: Roteer tegen klok in
german: Drehen gegen den Uhrzeigersinn

source: Comment
german: Kommentar

source: Uncomment
german: Kein Kommentar

source: Indent
german: Eingerückt

source: Unindent
german: Nicht eingerückt

source: Macros
german: Makros

source: Open Macro Editor...
german: Makro Editor öffnen...

source: Close Macro Editor
german: Makro Editor schließen

source: Add macros from file...
german: Makros aus Datei hinzufügen...

source: Save selection to file...
german: Auswahl in Datei sichern...

source: Convert \yen to \ in Pasteboard
german: Konvertiere \yen nach \ in der Zwischenablage

source: Convert \ to \yen in Pasteboard
german: Konvertiere \ nach \yen in der Zwischenablage

source: Edit
german: Bearbeiten

source: Warning
german: Warnung

source: Don't Save
german: Nicht sichern

source: Cancel
german: Abbrechen

source: Do you want to save macros?
german: Sollen die Makros gesichert werden?

source: Save Spot
german: Sicherungsgrenze

source: Template
german: Vorlage

source: Typing
german: Tippen

source: AutoComplete
german: AutoVervollständigen

source: Page Number
german: Seitenzahl

source: Page Number Panel
german: Seitenzahl Palette

source: Magnification Panel
german: Vergrößerungspalette

source: Omit Shell Escape
german: Shell Escape nicht benutzen

source: Warning: Using Shell Escape
german: Warnung: Sie benutzen Shell Escape

source: Preview
german: Vorschau

source: Display Format
german: Anzeigeformat

source: Magnification
german: Vergrößerung

source: Copy Format
german: Bildkopie Format

source: ToolbarItems
german: Werkzeugleistenelemente

source: Autocompletion
german: Autovervollständigung

source: Completion
german: Vervollständigung

source: %@ Characters: %d
german: %@ Zeichen: %d

source: The file encoding changed; characters can be lost if the wrong encoding is used.
german: Die Dateikodierung hat sich geändert. Einige Zeichen können bei falscher Kodierung verloren gehen.

source: Currently open files retain their old encoding.
german: Gerade geöffnete Dateien behalten ihre alte Kodierung.

source: Untitled-
dutch: Naamloos-
