Repository: TeXShop/TeXShop
Catalog: *.lproj/ToolbarItems.strings
Languages: italian, japanese, portuguese, spanish

# tiLabelSave
source: Save
italian: Salva
japanese: 保存
portuguese: Guardar
spanish: Guardar

# tiPaletteLabelSave
source: Save
italian: Salva
japanese: 保存
portuguese: Guardar
spanish: Guardar

# tiToolTipSave
source: Save the source of the document
italian: Salva il sorgente del documento
japanese: 書類を保存します
portuguese: Guardar o documento
spanish: Guardar el código del documento

# tiToolTipPrintSource
source: Print the TeX source
italian: Stampa il sorgente TeX
japanese: TeX ソースを印刷します
portuguese: Imprimir o código TeX
spanish: Imprimir el código TeX

# tiToolTipPrint
source: Print the PDF image
italian: Stampa l'immagine PDF
japanese: PDF イメージを印刷します
portuguese: Imprimir a imagem PDF
spanish: Imprimir el PDF previsto

# tiLabelTypeset
source: Typeset
italian: Compila
japanese: タイプセット
portuguese: Compor
spanish: Componer

# tiPaletteLabelTypeset
source: Typeset
italian: Compila
japanese: タイプセット
portuguese: Compor
spanish: Componer

# tiToolTipTypeset
source: Run typesetting program
italian: Esegui il programma di compilazione
japanese: タイプセットプログラムを起動します
portuguese: Correr o programa de composição
spanish: Ejecutar el programa que compone

# tiLabelProgram
source: Program
italian: Programma
japanese: プログラム
portuguese: Programa
spanish: Programa

# tiPaletteLabelProgram
source: Program
italian: Programma
japanese: プログラム
portuguese: Programa
spanish: Programa

# tiToolTipProgram
source: Choose typesetting program
italian: Scegli il programma di compilazione
japanese: タイプセットプログラムを選択します
portuguese: Escolher o programa de composição
spanish: Elegir el programa que compone

# tiToolTipTeX
source: Process the source using plain TeX tool
italian: Processa il sorgente usando lo strumento TeX semplice
japanese: ソースを plain TeX で処理します
portuguese: Compor usando Plain TeX
spanish: Compilar el código usando plain TeX

# tiToolTipLaTeX
source: Process the source using LaTeX
italian: Processa il sorgente usando LaTeX
japanese: ソースを LaTeX で処理します
portuguese: Compor usando LaTeX
spanish: Compilar el código usando LaTeX

# tiToolTipBibTeX
source: Run BibTeX
italian: Esegui BibTeX
japanese: BibTeX を起動します
portuguese: Correr BibTeX
spanish: Ejecutar BibTeX

# tiToolTipMakeIndex
source: Make Index
japanese: MakeIndex を起動します
portuguese: Fazer o índice remissivo
spanish: Ejecutar Make Index

# tiToolTipMetaPost
source: Run MetaPost
italian: Esegui MetaPost
japanese: MetaPost を起動します
portuguese: Correr MetaPost
spanish: Ejecutar MetaPost

# tiToolTipConTeX
source: Run ConTeXt
italian: Esegui ConTeXt
japanese: ConTeXt を起動します
portuguese: Compor usando ConTeXt
spanish: Ejecutar ConTeXt

# tiToolTipMetaFont
source: Run MetaFont
italian: Esegui MetaFont
japanese: MetaFont を起動します
portuguese: Correr MetaFont
spanish: Ejecutar MetaFont

# tiLabelPreviousPage
source: Previous
italian: Precedente
japanese: 前のページ
portuguese: Anterior
spanish: Anterior

# tiPaletteLabelPreviousPage
source: Alternate Previous Page
italian: Pagina precedente
japanese: 前のページ
portuguese: Página anterior
spanish: Página anterior alternativa

# tiToolTipPreviousPage
source: Show previous page
italian: Mostra pagina precedente
japanese: 前のページへ移動します
portuguese: Mostrar a página anterior
spanish: Mostrar página anterior

# tiLabelNextPage
source: Next
italian: Successiva
japanese: 次のページ
portuguese: Seguinte
spanish: Siguiente

# tiPaletteLabelNextPage
source: Alternate Next Page
italian: Pagina successiva
japanese: 次のページ
portuguese: Página seguinte
spanish: Página siguiente alternativa

# tiToolTipNextPage
source: Show next page
italian: Mostra pagina successiva
japanese: 次のページへ移動します
portuguese: Mostrar a página seguinte
spanish: Mostrar página siguiente

# tiLabelGotoPage
source: Go to page
italian: Vai alla pagina
japanese: ページへ移動
portuguese: Ir para pág.
spanish: Ir a la página

# tiPaletteLabelGotoPage
source: Go to page
italian: Vai alla pagina
japanese: ページへ移動
portuguese: Ir para pág.
spanish: Ir a la página

# tiToolTipGotoPage
source: Go to page
italian: Vai alla pagina
japanese: ページへ移動
portuguese: Saltar para a página...
spanish: Ir a la página

# tiLabelMagnification
source: Magnification
italian: Ingrandimento
japanese: ズーム倍率
portuguese: Ampliação
spanish: Escala

# tiPaletteLabelMagnification
source: Magnification
italian: Ingrandimento
japanese: ズーム倍率
portuguese: Ampliação
spanish: Escala

# tiToolTipMagnification
source: Set page magnification
italian: Imposta ingrandimento della pagina
japanese: プレビュー画面のズーム倍率を設定します
portuguese: Escolher ampliação da página
spanish: Establecer escala de página

# tiLabelTemplates
source: Templates
italian: Modelli
japanese: テンプレート
portuguese: Minutas
spanish: Plantillas

# tiPaletteLabelTemplates
source: Templates
italian: Modelli
japanese: テンプレート
portuguese: Minutas
spanish: Plantillas

# tiToolTipTemplates
source: Select a template to insert at cursor
italian: Seleziona un modello da inserire al cursore
japanese: カーソルの位置にテンプレートを挿入します
portuguese: Escolher uma minuta para inserir
spanish: Seleccionar una plantilla e insertarla en el lugar del cursor

# tiLabelTags
source: Tags
italian: Etichette
japanese: タグ
portuguese: Marcas
spanish: Marcas

# tiPaletteLabelTags
source: Tags
italian: Etichette
japanese: タグ
portuguese: Marcas
spanish: Marcas

# tiToolTipTags
source: Select a tag to scroll to
italian: Seleziona un'etichetta sui cui spostarsi
japanese: タグの位置に移動します
portuguese: Escolher uma marca para saltar
spanish: Seleccionar una marca y desplazarse hasta ella

# tiLabelPreviousPageButton
source: Previous
italian: Precedente
japanese: 前のページ
portuguese: Anterior
spanish: Anterior

# tiPaletteLabelPreviousPageButton
source: Previous Page
italian: Pagina precedente
japanese: 前のページ
portuguese: Página anterior
spanish: Página anterior

# tiToolTipPreviousPageButton
source: Show previous page
italian: Mostra pagina precedente
japanese: 前のページへ移動します
portuguese: Mostrar a página anterior
spanish: Mostrar página anterior

# tiLabelNextPageButton
source: Next
italian: Successiva
japanese: 次のページ
portuguese: Seguinte
spanish: Siguiente

# tiPaletteLabelNextPageButton
source: Next Page
italian: Pagina Successiva
japanese: 次のページ
portuguese: Página seguinte
spanish: Página siguiente

# tiToolTipNextPageButton
source: Show next page
italian: Mostra pagina successiva
japanese: 次のページに移動します
portuguese: Mostrar a página seguinte
spanish: Mostrar página siguiente

# tiLabelTypesetEE
source: Typeset
italian: Compila
japanese: タイプセット
portuguese: Compor
spanish: Componer

# tiPaletteLabelTypesetEE
source: Typeset
italian: Compila
japanese: タイプセット
portuguese: Compor
spanish: Componer

# tiToolTipTypesetEE
source: Run typesetting program
italian: Esegui il programma di compilazione
japanese: タイプセットプログラムを起動します
portuguese: Correr o programa de composição
spanish: Ejecutar el programa que compone

# tiLabelProgramEE
source: Program
italian: Programma
japanese: プログラム
portuguese: Programa
spanish: Programa

# tiPaletteLabelProgramEE
source: Program
italian: Programma
japanese: プログラム
portuguese: Programa
spanish: Programa

# tiToolTipProgramEE
source: Choose typesetting program
italian: Scegli il programma di compilazione
japanese: タイプセットプログラムを選択します
portuguese: Escolher o programa de composição
spanish: Elegir el programa que compone

# tiLabelMacros
source: Macros
japanese: マクロ

# tiPaletteLabelMacros
source: Macros
japanese: マクロ

# tiToolTipMacros
source: Insert macros
japanese: マクロを挿入します
