<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Pdfsync</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Maritn Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="pdfsync, synchronisieren, Synchronisierung">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>
	<div id="content_border">
			<P>Synchronisierung ist eine wichtige Funktion von Textures. Textures ist eine kommerzielle TeX-Implemetierung f&uuml;r den Mac von Blue Sky TeX Systems. Hierbe ist es m&ouml;glich, dass ein Autor in das Vorschau-Fenster klickt und automatisch zur korrespondierenden Stelle im Quelltext gelangt. Textures ist jedoch noch nicht in einer nativen Mac OS X-Version erh&auml;tlich. Diese Implementierung der Synchronisierung von Textures wird &uuml;berall f&uuml;r seine Pr&auml;zision im Auffinden des korrespondierenden Quelltextes gelobt. </P>
			<P>TeX-Systeme anderer Plattformen haben versucht diese Funktion zu immitieren, indem sie eine zus&auml;tzliche Style-Datei benutzt haben, durch die TeX veranlasst wurde die n&ouml;tigen Informationen in die dvi-Datei zu schreiben. Im Sommer 2003 schrieb Piero D'Ancona ein &auml;hnliches Hilfmittel f&uuml;r pdflatex. Dieses Paket, &bdquo;pdfsync.sty&rdquo;, bringt pdftex dazu eine zus&auml;tzliche Datei mit Informationen zu Synchronisieren von Eingabe- und Ausgabefenster zu erzeugen. D'Anconas Arbeit basiert auf pdftex-internen Befehlen, die x- und y-Koordinaten von verschiedenen Satzoperationen ausgeben. </P>
			<P>TeXShop 1.35 benutzt die aktuellste Version von pdfsync.sty. Lesen Sie die Artikel &bdquo;Alles richtig installiert?&ldquo; aus dem Abschnitt &bdquo;Wie konfiguriere ich TeXShop&ldquo; um sicher zu stellen, dass Sie diese richtge Version installiert haben. Die pdfsync-Funktion ist nur in pdftex, pdflatex und context m&ouml;glich. Bei der tex + ghostscript-Option kann man die Funktion somit nicht benutzen.</P>
			<P>Um pdfsync zu benutzen, f&uuml;gen Sie folgende Befehlsfolge in die Preambel ihrer Quelldatei (vor \begin{document})ein:<dl>
<dd>\usepackage{pdfsync}
</dl>
			Dieses Paket wird ignoriert, wenn Sie mit tex + ghostscript arbeiten. Verwenden Sie jedoch pdflatex, so wird eine zus&auml;tzliche Datei mit dem Suffix &bdquo;.pdfsync&ldquo; erstellt. Ist der Titel Ihrer Quelldatei &bdquo;Haupt.tex&ldquo; so lautet diese &bdquo;Haupt.pdfsync&ldquo;. In dieser Datei werden die notwendigen Informationen zum Synchronisieren gesichert. Die meisten Dateien sollten ohne Fehler mit pdfsync gesetzt werden. In einigen F&auml;llen kann dieses Paket jedoch zu Fehlern f&uuml;hren. Code der zu Fehlern f&uuml;hrt, sollte dann zwischen das Befehlspaar &bdquo;\pdfsyncstop&ldquo; und &bdquo;\pdfsyncstart&ldquo; gesetzt werden. Wenn Sie eine h&ouml;here Genauigkeit erzielen wollen, k&ouml;nnen Sie mit dem Befehl &bdquo;\pdfsync&ldquo; weitere Synchronisationspunkte setzen.
			<P>Wurde eine Datei mit pdfsync gesetzt, k&ouml;nnen Sie zwischen Quelltext- und Vorschau-Fenster wechseln, indem Sie an eine bestimmt Position in einem der Fenster klicken w&auml;hrend Sie die Befehlstaste dr&uuml;cken. Sofort sollten Sie zur entsprechenden Stelle im jeweils anderen korrespondierenden Fenster gelangen. Geh&ouml;rt der Punkt im Vorschau-Fenster zu einer Quelldatei die nicht ge&ouml;ffnet ist, so wird diese ge&ouml;ffnet und zum entsprechenden Punkt gescrollt. Andersherum wird direkt zum entsprechenden Punkt im Vorschau-Fenster gesprungen, wenn Sie die Befehlstaste gedr&uuml;ckt halten und in den Quelltext klicken.</P>
			<P>Dieser Prozess funktioniert, wenn die Quelldatei eine %SourceDoc-Angabe hat oder eine Hauptdatei festgelegt wurde. Achtung: Wenn ein Hauptdokument noch andere Dateien mit dem \inlcude-Befehl einbindet, die jedoch keine %SourceDoc-Angabe oder eine Hauptdatei festgelegt haben, so wird zwar von Vorschau-fenster zum entsprechenden Quelltext, jedoch nicht wieder zur&uuml;ck gesprungen. Um dies zu vermeiden sollten Sie die %SourceDoc-Angabe bei allen Dateien Ihres Projekts hinzuf&uuml;gen. </P>
			<P>In dieser anf&auml;nglichen Implemetierung l&auml;sst die Genauigkeit zu w&uuml;nschen &uuml;brig. Die entsprechende Stelle im Quelltext kann um ein paar Zeilen variieren. Die Synchronisationtechnik wird jedoch weiter &uuml;berarbeitet und wird sich weiter verbessern.</P>
			<p>Wie oben schon beschrieben arbeitet pdfsync mit Dateien zusammen, die mt dem Befehl &bdquo;\include{meinedatei} eingebettet wurden. Der Befehl &bdquo;\input&ldquo; wird auch unterst&uuml;tzt. Allerdings nur in folgender Syntax: &bdquo;\input{meinedatei}&ldquo;. Die Alternative Synatx &bdquo;\input meinedatei&ldquo; funktioniert nicht.</p>
			<p>Die Datei &bdquo;pdfsync.sty&ldquo; wird von LaTeX verwendet. &Auml;hnliche Dateien, &bdquo;pdfsync.tex&ldquo; und &bdquo;pdfsync4context.tex&ldquo; sind f&uuml;r Synchronisation mit TeX und ConTeXt gedacht.</p>
			<p>Die Synchronisation wird dadurch bewerkstelligt, dass Daten &uuml;ber korrespondierende Synchronisationspunkte in die &bdquo;meinedatei.pdfsync&ldquo; geschrieben werden. Jeder Eintrag enth&auml;lt etwa folgende Information:</p>
			<dl>
				<dd>Die Seitenzahl im Vorschau-Dokument, auf der der Punkt auftaucht
				<dd>Der genaue Ort des Punktes auf dieser Seite
				<dd>Der Name der Quelldatei, die diese spezielle Seite ausgibt
				<dd>Die Zeilennummer der Quelldatei f&uuml;r diese speielle Ausgabe
			</dl>
			<p>Man kann sich die Synchronisationspunkte in TeXShop anzeigen lassen. Im Vorschaufenster kann man sich eine Option mit dem Titel &bdquo;SyncMarks&ldquo; einblenden lassen. Normalerweise ist diese ausgeblendet. Sie k&ouml;nnen diese aber einblenden, indem Sie sie mit dem Men&uuml;punkt &bdquo;Werkzeugleiste anpassen&ldquo; zu ihrer Werkzeugleiste hinzuf&uuml;gen.  Ist die Option gew&auml;hlt, werden die Synchronisationspunkte angezeigt.</p>
			<p>Erscheint das Vorschau-Fenster zum ersten Mal ist die Option nicht ausgew&auml;hlt. Sie k&ouml;nnen dieses Verhalten jedoch mit Hilfe einer versteckten Einstellung anpassen:</p>
			<dl>
				<dd>defaults write TeXShop ShowSyncMarks YES
			</dl>
		</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Erweitert</div>
<div id="header_title">Pdfsync</div>


	<div id="menu_border">
		<UL>
			<li><a href="advanced_personaltetex.htm">Pers&ouml;nliche sty- und Makrodateien zu teTeX hinzuf&uuml;gen</a></li>
			<LI><a href="advanced_addengine.htm">Zusätzliche Schriftsatz-Programme</a>
			<LI><a href="advanced_removeaux.htm">AUX-Dateien entfernen</a>
			<li><a href="advanced_externaleditor.htm">Einen externen Editor verwenden</a></li>
			<li><a href="advanced_pdfcopypaste.htm">Kopieren-Einf&uuml;gen und Drag-Drop aus dem Vorschau-Fenster</a></li>
			<li><a href="advanced_root.htm">Die Hauptdatei des Projekts festlegen</a></li>
			<li><a href="advanced_pdfsync.htm">Pdfsync</a></li>
			<li><a href="advanced_unicode.htm">Unicode</a></li>
			<li><a href="advanced_bibtex.htm">BibTeX</a></li>
			<li><a href="advanced_makeindex.htm">MakeIndex</a></li>
			<li><a href="advanced_otherfiles.htm">Andere Dateien mit TeXShop &ouml;ffnen</a></li>
			<li><a href="advanced_mathematica.htm">Mathematica</a></li>
			<li><a href="advanced_localization.htm">Lokalisierungen</a></li>
			<li><a href="advanced_syntaxcolor.htm">Syntax Farben </a></li>
			<li><a href="advanced_shellescape.htm">Shell Escape Schutz</a></li>
			<li><a href="advanced_coloredtext.htm">Farbiger Text in TeX</a></li>
			<li><a href="advanced_moretetex.htm">Mehr &uuml;ber teTeX</a></li>
			<li><a href="advanced_fink.htm">Zusammenarbeit mit Fink</a></li>
			<li><a href="advanced_otherdistributions.htm">Zusammenarbeit mit anderen TeX Distributionen</a></li>
			<li><a href="advanced_context.htm">ConTeXt und MetaPost</a></li>
			<li><a href="advanced_plist.htm">Plist Dateien</a></li>
			<li><a href="advanced_menushortcuts.htm">Tastaturk&uuml;rzel neubelegen</a></li>
		</UL>
	</div>
	
	</BODY>
</HTML>