<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Einstellungen &auml;ndern</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="&Auml;ndern Sie verschiedene Einstellungen um TeXShop an Ihre Bed&uuml;rfnisse anzupassen.">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>
	<div id="content_border">	
		<P>Einige Dinge k&ouml;nnen &uuml;ber den Men&uuml;punkt &bdquo;Einstellungen&ldquo; festgelegt werden: Die Standardschrift f&uuml;r das Eingabefenster, die Standardvergr&ouml;&szlig;erung des Anzeigefensters sowie die Position der Fenster wenn sie zum ersten Mal erscheinen. Dar&uuml;ber hinaus k&ouml;nnen Sie festlegen, ob die Konsole immer oder nur bei Fehlern erscheinen soll. </P>
		<p>Der Dialog Einstellungen kann auch dazu verwendet werden festzulegen welche Befehle ausgef&uuml;hrt werden wenn die &bdquo;TeX&ldquo;- und &bdquo;Latex&ldquo;-Kn&ouml;pfe gedr&uuml;ckt werden. Diese M&ouml;glichkeit ist f&uuml;r manche, die die Programme etex oder elatex und pdfetex oder pdfelatex anstelle von tex und latex, respektive pdftex oder pdflatex verwenden m&ouml;chten sinnvoll. Selbst verst&auml;ndlich m&uuml;ssen alternative Programme pdf-Dateien erzeugen. Befinden sich die Programme im teTeX Binary-Verzeichnis gen&uuml;gt es den Namen einzugeben. Liegen Sie woanders sollte der absolute Pfad angegeben werden.</p>
		<p>TeXShop Bearbeitungen wie TeXShop wurden mit Apple's Cocoa editing class erstellt, welche Unicode f&uuml;r die interne Arbeit benutzt. Wenn TeXShop Dateien auf die festplatte geschrieben werden, werden sie in 8bit ASCII konvertiert, da TeX eine solche Datei voraussetzt. Es gibt verschiedene Arten diese Konvertierung durchzuf&uuml;hren: Mac OS Roman, Iso Latin 1, Iso Latin 2 und andere. Ein Punkt in den Einstellungen legt die benutzte Konvertierung fest. f&uuml;r viele Benutzer wird die Auswahl keinen Unterschied machen. Einige TeX-Pakete erlauben es europ&auml;ische Sonderzeichen direkt auf der Tastatur zu belegen. Daf&uuml;r wird das Iso Latin Paket ben&ouml;tigt. Dank an Martin Heusse f&uuml;r diese Funktion. Fr&uuml;here Versionen von TeXShop benutzen nur Mac OS Roman Konvertierung.</p>
		<p>F&uuml;r Japan und Korea werden besondere Einstellungen unterst&uuml;tzt.</p>
		<p>Die Hintergrundfarbe des Quelltext-Fensters kann zur&uuml;ckgesetzt werden. Es gibt keine Option in den Einstellungen um dies zu tun. Um den Hintergrund auf die Farbwerte (r, g, b) = (.42, .39, .77) zu setzen, f&uuml;hren Sie folgenden Befehl im Terminal-Fenster aus:</p>
			<dl>
			<dd>defaults write TeXShop background_R 0.42
			<dd>defaults write TeXShop background_G 0.39
			<dd>defaults write TeXShop background_B 0.77
		</dl>
			<p>Sie k&ouml;nnen auch die Textfarbe des Quelltext-Fensters &auml;ndern. Diese Einstellung wird jedoch nur beachtet, wenn Sie die Syntaxf&auml;rbung eingeschaltet haben. Um die Textfarbe auf (r, g, b) = (.42, .39, .77) zu setzen, geben Sie folgende Befehle im Terminal ein:</p>
			<dl>
				<dd>defaults write TeXShop foreground_R 0.42
				<dd>defaults write TeXShop foreground_G 0.39
				<dd>defaults write TeXShop foreground_B 0.77
			</dl>
			<p>Wenn Sie die letzten Einstellungen kombinieren, k&ouml;nnen Sie wei&szlig;en Text auf schwarzem Hintergrund, oder andere Farbschemata festlegen.</p>
			<p>Mit Hilfe einer versteckten Einstellung k&ouml;nnen Sie auch die Tranzparenz von Quelltext-, Vorschau- und Konsolen-Fenster &auml;ndern:</p>
			<dl>
				<dd>defaults write TeXShop ConsoleWindowAlpha 0.75
				<dd>defaults write TeXShop SourceWindowAlpha 0.75
				<dd>defaults write TeXShop PreviewWindowAlpha 0.75
			</dl>
			<p>Ein Alphawert von 0.00 bedeutet hier vollst&auml;ndige Transparenz und 1.00 vollst&auml;ndig deckend. Sie sollten diese Einstellung nur mit Bedacht ver&auml;ndern!</p>
			<p>Mit Hilfe eines Auswahlmen&uuml;s k&ouml;nnen die Einstellungen auf Ihre Standardwerte zur&uuml;ck gesetzt werden. Dies ist vor allem in Japan sinnvoll, da hier verschiedene Versionen von pTeX benutzt werden.</p>
		</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Grundlagen</div>
<div id="header_title">Einstellungen &auml;ndern</div>


	<div id="menu_border">
		<UL>
			<LI><a href="basic_preliminaries.htm">Einf&uuml;hrung</a></li>
			<LI><a href="basic_installtetex.htm">teTeX beschaffen und installieren</a></li>
			<LI><a href="basic_installtexshop.htm">TeXShop beschaffen und installieren</a></li>
			<LI><a href="basic_typesetting.htm">Dokumente setzen</a></li>
			<li><a href="basic_alternatetypeset.htm">Alternativer Schriftsatzmodus</a></li>
			<li><a href="basic_spelling.htm">Rechtschreibpr&uuml;fung</a></li>
			<li><a href="basic_latexpanel.htm">LaTeX Palette</a></li>
			<li><a href="basic_matrixpanel.htm">Matrix-Palette</a></li>
			<li><a href="basic_macros.htm">Makros</a></li>
			<li><a href="basic_toolbar.htm">Werkzeugleiste und AppleScript</a></li>
			<li><a href="basic_graphics.htm">Grafik einf&uuml;gen</a></li>
			<li><a href="basic_printing.htm">Drucken</a></li>
			<li><a href="basic_preferences.htm">Einstellungen &auml;ndern</a></li>
			<li><a href="basic_templates.htm">&Auml;ndern des Vorlagenmen&uuml;s</a></li>
			<li><a href="basic_edittricks.htm">Bearbeitungstipps</a></li>
			<li><a href="basic_autocompletion.htm">Autovervollst&auml;ndigen</a></li>
			<li><a href="basic_commandcompletion.htm">Vervollst&auml;ndigung von Befehlen</a></li>
			<li><a href="basic_bugs.htm">Fehlerbericht &uuml;bermitteln</a></li>
			<li><a href="basic_websites.htm">N&uuml;tzliche Webseiten</a></li>
			<li><a href="basic_license.htm">Lizenz</a></li>
		</UL>
	</div>
	
	</BODY>
</HTML>