<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Einleitung</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Allgemeine Informationen zur Konfiguration von TeXShop.">
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Einleitung</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Haben Sie TeXShop zum ersten Mal installiert, so lesen Sie bitte nur den ersten Abschnitt dieses Dokuments. Wenn Sie TeXShop von einer &auml;lteren auf diese Version aktualisiert haben, dann lesen Sie diesen und die n&auml;chsten drei Abschnitte. Wenn Sie sich mit TeXShop gut auskennen und es anpassen wollen, dann lesen Sie auch die &uuml;brigen Abschnitte.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Wenn TeXShop zum ersten Mal gestartet wird, so legt es Standardeinstellungen und Standardvorlagen im &#132;Library&#147;-Ordner des Benutzers an. Wird das Programm sp&auml;ter aktualisiert, so werden diese Dateien nicht &uuml;berschrieben, weil der Benutzer sie eventuell an seine Bed&uuml;rfnisse angepasst hat. In seltenen F&auml;llen werden an diesen Standard-Dateien Ver&auml;nderungen vorgenommen. Diese Ver&auml;nderungen werden hier aufgef&uuml;hrt, sodass Benutzer der voherigen Version ihre angepassten Standard-Dateien entsprechend ver&auml;ndern k&ouml;nnen k&ouml;nnen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop verf&uuml;gt &uuml;ber versteckte Einstellungen f&uuml;r erfahrene Benutzer. Hierdurch kann das Programmverhalten durch die Installation verschiedener .plist-Dateien beeinflusst werden. Details hier&uuml;ber erfahren Sie in den entsprechenden Abschnitten.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Neue Versionen von TeXShop beinhalten hin und wieder neue Men&uuml;eintr&auml;ge oder andere neue Komponenten der Benutzeroberfl&auml;che. Diese neuen Komponenten sind manchmal noch nicht lokalisiert auch wenn der Rest des Programms in Ihrer Sprache vorliegt. Schicken Sie mir die passende &Uuml;bersetzung, so wird diese sofort in die TeXShop Version auf meiner Webseite eingepflegt. Schreiben Sie einfach an <a href="mailto:koch@math.uoregon.edu">koch@math.uoregon.edu</a>. </font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>