<HTML>

<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
<TITLE>Shell Escape Schutz</TITLE>
</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Shell Escape Schutz</B></FONT></TD>
</TR>
</TABLE>

<P><font size="2" face="Lucida Grande,Geneva,Arial">Die Standardbefehle f&uuml;r pdftex und pdflatex sind nun &quot;pdftex --shell-escape&quot; und &quot;pdflatex --shell-escape.&quot; Durch die Erweiterung &#132;shell-escape&#147; wird es m&ouml;glich, dass w&auml;hrend des Setzens andere Programme aufgerufen werden. Dies ist n&uuml;tzlihc, wenn zum Beispeil automatisch Grafiken in ein anderes Format konvertiert werden sollen. So konvertiert die LaTeX-Vorlage eps-Dateien automatisch in das pdf-Format.</font></P>

<P><font size="2" face="Lucida Grande,Geneva,Arial">Hierdurch kan jedoch eine Sicherheitsl&uuml;cke entstehen. Die &#132;shell-escpae&#147; Funktion erlaubt es jedes beliebeige Programm auszuf&uuml;hren. Daher k&ouml;nnte ihr System durch eine b&ouml;sartige E-Mail besch&auml;digt werden.</font></P>

<P><font size="2" face="Lucida Grande,Geneva,Arial">Ich denke, dass die Gefahr gering ist. Nichts desto trotz gibt es zwei M&ouml;glichkeiten, wie Sie sich sch&uuml;tzen k&ouml;nnen. Die erste und einfachste M&ouml;glichkeit ist, die Buchstaben &#132;--shell-escape&#147; an den zwei Stellen in den Einstellungen von Hand zu l&ouml;schen. Hiernach m&uuml;ssen SIe jedoch all Ihre Grafikdateien von Hand konvertieren.</font></P>

<P><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop gibt Ihnen eine zweite Schutzm&ouml;glichkeite. Eine Einstellug unter dem Titel &#132;Programme&#147; tr&auml;gt die Bezeichnung &#132;Shell Escape Warnung&#147;. Diese ist normalerweise nicht eingeschaltet. Ist diese Option aktiviert und die &#132;shell-escape&#147; Funktion ebenfalls, so erscheint beim ersten Setzen einer TeX-Datei ein Dialog, in dem Sie die &#132;shell-escape&#147;-Funktion f&uuml;r diese einzelne Datei ausschalten k&ouml;nnen. Nach dem ersten Setzen wird der Dialog nicht mehr angezeigt und Ihre Auswahl respektiert. Jetzt k&ouml;nnen Sie Ihre eigenen Dateien mit, fremde Dateien jedoch ohne &#132;shell-escape&#147; Funktion setzen.</font></P>



		<ul>
			
		</ul>
	</BODY>

</HTML>