<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Dokumente setzen</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Dokumente setzen</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Um TeXShop zu benutzen m&uuml;ssen Sie einfach Ihren LaTeX-Text im Eingabefenster von TeXShop eingeben. Dr&uuml;cken Sie danach den &#132;LaTeX&#147;-Knopf im oberen Teil des Fensters. Ihr Text wird gespeichert und pdflatex ausgef&uuml;hrt. Ein zweites Fenster wird erscheinen, das Ihnen die Informationen von tex anzeigt. Falls ein Fehler auftritt, wird pdflatex anhalten. Dr&uuml;cken Sie die Eingabetaste um die Fehler einzeln zu &uuml;berspringen. Nat&uuml;rlich k&ouml;nnen Sie auch die Standard-TeX Befehle zum Verlassen oder &auml;hnlichem eingeben. Wenn das Dokument fertig gesetz ist, erscheint ein drittes Fenster, das Ihnen die erzeugte pdf-Datei anzeigt. Sie k&ouml;nnen mit &#132;ctrl+1&#147; zwischen den einzelnen Fenstern wechseln.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Klicken Sie die Maus auf einen Bereich im Fenster der pdf-Datei und die Umgebung des Mauszeigers wird vergr&ouml;&szlig;ert. Wenn Sie doppelt klicken, wird der vergr&ouml;&szlig;erte Bereich wird noch weiter. Bei einem dreifachen Klick wird der Bereich ein weiteres Mal erweitert. Sie k&ouml;nnen die Standardverg&ouml;&szlig;erung allerdings auch &uuml;ber die Werkzeugleiste im Vorschau-Fenster einstellen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Um ein TeX-Dokument zu setzen, w&auml;hlen Sie den &#132;Programm&#147;-Auswahlknopf und w&auml;hlen Sie TeX anstelle von LaTeX aus. Wollen Sie TeX als Standard verwenden, w&auml;hlen Sie es bitte als Standardprogramm in den Einstellungen aus.Wenn Ihnen ein Fehler auff&auml;llt, k&ouml;nnen Sie Ihn direkt im Eingabefenster korrigieren. Dr&uuml;cken Sie jetzt den &#132;TeX&#147; oder &#132;LaTeX&#147;-Knopf erneut, m&uuml;ssen Sie den alten Satzvorgang nicht abbrechen. TeXShop beendet automatisch den alten Vorgang und startet einen neuen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop speichert die Textzeilen der ersten zwanzig Fehler. Um zu den einzelnen Fehlern zu springen, benutzen Sie den Men&uuml;eintrag &#132;Gehe zu Fehler&#147; im &#132;Bearbeiten&#147;-Men&uuml; oder dr&uuml;cken Sie das Tastaturk&uuml;rzel f&uuml;r diesen Befehl.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Wenn Sie Fehler korrigieren und das Dokument erneut setzen, wird das Ausgabefenster zu der Position zurr&uuml;ckkehren, an der Sie vorher waren.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Wenn eine Zeile Ihres Quelltextes mit &#132;%:&#147; beginnt, wird TeXShop die Zeilen als &#132;Markierung&#147; interpretieren und diese Markierung wird im &#132;Markierungen&#147;-Auswahlmen&uuml; erscheinen. Wird diese Markierung im Men&uuml; ausgew&auml;hlt, springt TeXShop automatische zur zugewiesenen Stelle im Quelltext. Zeilen die mit den Worten \section, \subsection, \subsubsection oder \chapter werden automatisch dem &quot;Markierungen&quot;-Auswahlmenu hinzugef&uuml;gt. Diese Einstellung kann jedoch ge&auml;ndert werden, indem Sie folgenden Befehl in Apples Terminal tippen:</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>defaults write edu.uoregon.math.koch.TeXShop TagSections NO</tt></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop kann mit mehreren Dokumenten gleichzeitig umgehen. W&auml;hlen Sie &#132;Neu&#147; oder &#132;&Ouml;ffnen&#147;, wird Ihr Dokument erhalten bleiben und ein zus&auml;tzliches Fenster mit dem neuen Dokument erscheinen. &Ouml;ffnen Sie eine tex-Datei und in dem selben Ordner befindet sich eine pdf-Datei des selben Namens, wird im Ausgabefenster auch die pdf-Datei ge&ouml;ffnet</font>.<br>
		</p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Manche Benutzer m&ouml;chten ihr Dokument in mehrere Unterdokumente teilen, die von einem Hauptdokument mit dem \input Befehl gesteuert werden. TeXShop speichert immer das Dokument vor dem setzen. Wenn in den Einstellungen die Eigentschaft &quot;W&auml;hrend des Datei speichern, speichere verkn&uuml;pfte Dateien&quot; angehakt ist, dann wird das Hauptdokument vor dem Setzen durchsucht und alle in TeXShop ge&ouml;ffneten Unterdokumente werden ebenfalls gespeichert. Dieses  Funktion wurde von John Nairn erstellt.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop wird auch gestartet, wenn Sie doppel auf ein Dokument mit der Dateiendung &#132;.tex&#147; klicken. Es wird dann das Textdokument und falls vorhanden die dazugeh&ouml;rige pdf-Datei ge&ouml;ffnet.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Sie k&ouml;nnen das pdf-Ausgabefenster jederzeit schlie&szlig;en. Es wird, wenn Sie ein Dokument nochmals setzen wieder ge&ouml;ffnet. Schlie&szlig;en Sie das Eingabefenster, werden sich Eingabe- und Ausgabefenster schlie&szlig;en. (Fenster anderer tex-Dokumente bleiben jedoch ge&ouml;ffnet) Sie sollten deshalb ein Eingabefenster eher ins Dock verkleinern als es zu schlie&szlig;en, falls Sie Platz auf dem Bildschirm ben&ouml;tigen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Pdftex und pdflatex sind UNIX-Programme, die auf Knuths TeX-Programm basieren. Die TeX-Syntax erlaubt keine Leerzeichen in Dateinamen. Daher sollten Sie hierauf verzichten. TeXShop selbst hat keine Probleme mit Leerzeichen in Dateinamen. </font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Das Verhalten des Vorschau-Fensters kann &uuml;ber die Men&uuml;punkte &#132;Vergr&ouml;&szlig;erung&#147; und &#132;Anzeigeformat&#147; unter dem Man&uuml;punkt &#132;Vorschau&#147; eingestellt werden. So k&ouml;nnen Sie hier ein scrollen durch alle Seiten eines Dokuments erlauben. Auch kann das Vorschau-Fenster hier so eingestellt werden, dass es zwei Seiten gleichzeitig anzeigt. Schlie&szlig;lich kann man auch die Einstellung treffen, dass eine &Auml;nderung der Fenstergr&ouml;&szlig;e auch die Verg&ouml;&szlig;erung der Anzeige beeinflusst. Experimentieren Sie ein wenig, bis Sie alles nach Ihren W&uuml;nschen angepasst haben. W&auml;hlen Sie den Modus in den Einstellungen, um ihn dauerhaft zu &auml;ndern. </font></p>
	</BODY>

</HTML>