<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Bearbeitungstipps</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Bearbeitungstipps</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Ganze Zeilengruppen k&ouml;nnen heraus kommentiert werden mit einem einfachen Men&uuml;-Befehl und sp&auml;ter wieder aktiviert werden. Zeilengruppen k&ouml;nnen mit einem Men&uuml;-Befehl einger&uuml;ckt werden und sp&auml;ter wieder zur&uuml;ck. Wenn eine zeile mit einer Reihe von Tabs oder Leerzeichen beginnt, so werden nachfolgende Zeilen an der selben Stelle beginnen bis dies durch Bet&auml;tigen der r&uuml;ckstelltaste r&uuml;ckg&auml;gnig gemacht wird. Diese funktion wurde von  Nicol&aacute;s Ojeda B&auml;r aus Argentinien hinzugef&uuml;gt. er ist unter <a href="mailto:lojedaortiz@interlink.com.ar">lojedaortiz@interlink.com.ar</a> zu erreichen. Danke!</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Das Quelltext-Fenster kann mit Hilfe des Aufteilungswerkzeugs in der Werkzeugleiste in zwei Teile aufgeteilt werden. Nach der Auffteilung wird zwei Mal der selbe Quelltext angezeigt. Wenn Sie auf einer Seite etwas &auml;ndern, wird diese &Auml;nderung auf der anderen Seite sogleich &uuml;bernommen. So k&ouml;nnen Sie eine Stelle bearbeiten und gleichzeitig eine andere betrachten.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Dateien k&ouml;nnen nun direkt in den Quelltext gezogen werden. Handelt es sich um eine TeX-Datei, wird diese Datei mit einem \input Befehl eingef&uuml;gt. Bei einer Grafik erscheint jedoch \includegraphics.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop kann bei jedem Satzvorgang Sicherungskopien anlegen. Dies kann durch eine versteckte Einstellung erreicht werden. Um diese Funktion zu aktivieren, geben Sie folgenden Befehl im Terminal-Fenster ein:</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>defaults write edu.uoregon.math.koch.TeXShop SaveBackup YES</tt></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">&Auml;ndern Sie &#132;YES&#147; in &#132;NO&#147; um das Erstellen von Backups zu verhindern.</font></p>
	</BODY>

</HTML>