<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Einen externen Editor verwenden</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Sie k&ouml;nnen auch einen externen Editor mit TeXShop benutzen.">
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Einen externen Editor verwenden</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop kann &uuml;ber einen externen Editor konfiguriert werden. Dies geschieht &uuml;ber den Men&uuml;punkt &#132;Zur Voransicht &ouml;ffnen...&#147;. Sie werden, nachdem Sie diesen Men&uuml;punkt ausgew&auml;hlt haben darum gebeten eine Quelltextdatei auszuw&auml;hlen. es wird nur das Voransichts-Fenster mit der pdf-Datei ge&ouml;ffnet (Allerdings muss der Quelltext vorher gesetzt worden sein, sonst erscheint eine leere Seite). Dank Leuski's Werkzeugleiste kann das Vorschaufenster so konfiguriert werden, dass es eine Satzschaltfl&auml;che enth&auml;lt. Sie k&ouml;nnen Ihren Quelltext mit jedem Editor bearbeiten. Wenn es an der Zeit ist diesen zu setzen, sichern Sie die &Auml;nderungen in Ihrem Editor, wechseln zum Vorschaufenster und setzen den Quelltext. Auf diese Art wird TeXShop ihre Quelldatei weder &ouml;ffnen noch &auml;ndern. Es wird die Datei nur an TeX oder LaTeX weiterleiten.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">F&uuml;r Benutzer, die einen externen Editor meistens vorziehen, gibt es in den Einstellungen einen Punkt &#132;Bei Programmstart externen Editor&#147;. Wenn diese Einstellung ausgew&auml;hlt ist, wird die Quelltextdatei auf die oben beschriebene Art und Weise ge&ouml;ffnet, wenn Sie im Men&uuml; &#132;&Ouml;ffnen&#147; oder &quot;Zuletzt benutzte Dokumente&quot; ausw&auml;hlen. Au&szlig;erdem wird aus &#132;Zur Voransicht &ouml;ffnen...&#147; &#132;Zum Editieren &ouml;ffnen...&#147; und &ouml;ffnet die Quelltextdatei mit dem integrierten Editor von TeXShop f&uuml;r die wenigen Ausnahmen in denen der integrierte Editor erw&uuml;nscht ist. Die Befehle &quot;&Ouml;ffnen&quot; und &#132;Zuletzt ge&ouml;ffnete Dokumete...&#147; &ouml;ffnen au&szlig;erdem jpg, tiff, ps, pdf, dvi, log und andere Dateien unabh&auml;ngig der eben bechriebenen Einstellungen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">AppleScript Unterst&uuml;tztung f&uuml;r die &#132;externer Editor Einstellung&#147; ist noch im beta-Stadium und wird f&uuml;r k&uuml;nftige Versionen weiterentwickelt. Dies wird es erm&ouml;glichen aus einem voll AppleScript tauglichen Editor zu setzen.</font></p>
	</BODY>

</HTML>