<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>&Auml;ndern des Vorlagenmen&uuml;s</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="F&uuml;gen Sie weitere Vorlagen zum Vorlagenmen&uuml; in der Werkzeugleiste hinzu.">
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>&Auml;ndern des Vorlagenmen&uuml;s</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Wird TeXShop zum ersten Mal ausgef&uuml;hrt, legt das Programm folgenden Ordner an:</font></P>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial">~/Library/TeXShop/Templates</font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Die Dateien Graphics.tex, TexTemplate.tex und LatexTemplate.tex werden in diesen Ordner kopiert. Die Namen dieser Dateien werden unter dem Vorlagenauswahlmen&uuml; im oberen Fensterbereich angezeigt. W&auml;hlen Sie eines dieser Vorlagen aus, wird der Inhalt der Vorlage an der Stelle an dem sich der Cursor befindet eingef&uuml;gt.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Die drei Vorlagen sind Standard-tex-Dateien, die in TeXShop ge&ouml;ffnet und bearbeitet werden k&ouml;nnen. Zus&auml;tzliche Vorlagen k&ouml;nnen zum Vorlagenordner hinzugef&uuml;gt werden. Sie werden dann ebenfalls im Vorlagenauswahlmen&uuml; im oberen Teil des Eingabefensters angezeigt, inklusive der Endung &#132;.tex&#147;. Die Standardvorlagen k&ouml;nnen nach Belieben gel&ouml;scht werden.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Um eine hierarchische Struktur im Vorlagen-Men&uuml; einzuf&uuml;gen, legen Sie f&uuml;r einige Vorlagen Unterordner in &#132;~/Library/TeXShop/Templates&#147; an.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Um die Standardvorlagen wieder herzustellen, l&ouml;schen Sie den Ordner &#132;Templates&#147;. Beim n&auml;chsten Start von TeXShop wird er in seinem urspr&uuml;nglichen Zustand wieder hergestellt</font>.</p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Die obengenannten Befehle \usepackage{amssymb} und \usepackage{graphicx} sind in der Standardvorlage integriert. Jedoch wird diese Vorlage bei einem Update von TeXShop nicht mit aktualisiert. Dies m&uuml;ssen Sie manuell &auml;ndern.</font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>