<HTML>

<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
<TITLE>LaTeX Palette</TITLE>
<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Mit Hilfe der LaTeX-Palette k&ouml;nnen Sie h&auml;ufig benutzte Befehle einfach in Ihren LaTeX-Quelltext einf&uuml;gen.">
</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>LaTeX Palette</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Im Men&uuml; &#132;Fenster&#147; befindet sich der Punkt &#132;Latex Palette...&#147;. Beim Ausw&auml;hlen dieses Befehls &ouml;ffnet sich eine Palette mit einer gro&szlig;en Anzahl von mathematischen Symbolen, griechischen Zeichen, Internationalen Symbolen und Umgebungen. Klicken Sie auf ein Symbol und der jeweilige Befehl wird in Ihren Quelltext eingef&uuml;gt. Diese sch&ouml;ne Palette ist die Arbeit von Geoffroy Lenglin, der unter <a href="mailto:geoffroy.lenglin@m4x.org">geoffroy.lenglin@m4x.org</a> zu erreichen ist.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Einige Symbole in der Palette ben&ouml;tigen die Zeile</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>\usepackage{amssymb}</tt></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">am Anfang des Quelltexts.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Es ist m&ouml;glich das verhalten der Palette anzupassen. Beim ersten Start von TeXShop wird die Datei &#132;~/Library/TeXShop/LatexPanel/completion.plist&#147; in ihrem Library-Ordner erstellt. Diese Datei ist eine gew&ouml;hnliche Textdatei welche mit TeXShop ge&ouml;ffnet und bearbeitet werden kann. Die Datei enth&auml;lt alle Befehle die in Ihren Quelltext eingef&uuml;gt werden, wenn Sie ein Symbol ausw&auml;hlen. Wenn ein Befehl #SEL# beinhaltet, dann wird die aktuelle Auswahl durch den Ausdruck des eingef&uuml;gten Befehls ersetzt. Wenn ein Befehl #INS# beinhaltet, dann wird der Cursor beim Einf&uuml;gen an diese Stelle bewegt. Um das Verhalten der Palette zu &auml;ndern, bearbeiten Sie die Datei &#132;completion.plist&#147;.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Das Editieren von plist-Dateien ist etwas schwierig. Lesen Sie auch die Hinweise hier&uuml;ber in dem entsprechenden Abschnitt. Sichern Sie die Dateien mit UTF-8 Kodierung, wenn Sie Unicode Zeichen verwenden.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Benutzer k&ouml;nnen bis zu 16 zus&auml;tzliche Kn&ouml;pfe zur LaTeX Palette hinzuf&uuml;gen, indem die Datei &#132;completion.plist&#147; bearbeitet wird. Diese werden dann unter der Registerkarte &#132;Angepasst&#147; in der LaTeX Palette angezeigt. Schauen Sie sich die Kommentare am Anfang der Datei &#132;completion.plist&#147; an.</font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>