<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Die Hauptdatei des Projekts festlegen</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Die Hauptdatei des Projekts festlegen</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Es werden oft gro&szlig;e Dateien in mehrere kleine zerlegt, und diese kleineren Dateien werden von einer gro&szlig;en Hauptdatei kontrolliert. Als Beispiel k&ouml;nnte die Hauptdatei eines Buches folgende Form haben:</font></P>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\documentclass[11pt]{book}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\includeonly{Kapitel2/zwei.tex}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\textwidth = 6.5 in</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\textheight = 9 in</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\begin{document}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\include{Kapitel1/eins.tex}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\include{Kapitel2/zwei.tex}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\include{Kapitel3/drei.tex}</code></font>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><code>\end{document}</code></font>
		</dl>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Diese Hauptdatei beinhaltet Formatierungsbefehle f&uuml;r das ganze Projekt. Der Inhalt jedoch steht in den Dateien eins.tex, zwei.tex und drei.tex. Die zweite Zeile weist TeX an nur das zweite Kapitel zu setzen. So kann man das Setzen beschleunigen, wenn man gerade am zweiten Kapitel arbeitet. Soll das ganze Buch gesetzt werden, k&ouml;nnen Sie diese Zeile auskommentieren.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">W&auml;hrend Sie an Kapitel 2 schreiben, habe Sie nat&uuml;rlich auch die Datei zwei.tex in TeXShop ge&ouml;ffnet. Nachdem &Auml;nderungen hieran jedoch gespeichert wurden, sollten Sie die Hauptdatei setzen und nicht die Datei zwei.tex. Um die Hauptdatei festzulegen, benutzen Sie den Befehl &#132;Hauptdatei festlegen...&#147;. Dieser Men&uuml;befehl &ouml;ffnet einen Dialog mit einem Textfeld, in der Sie den Namen der Hauptdatei angeben k&ouml;nnen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Ist die Hauptdatei in dem selben Ordner wie die die Eingabedatei, gen&uuml;gt es den Namen der Hauptdatei, einschlie&szlig;lich der Dateiendung &#132;.tex&#147; anzugben. Hei&szlig;t die Hauptdatei zum Beispiel Haupt, geben Sie im Textfeld Haupt.tex ein.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Befindet sich die Hauptdatei in einem anderen Ordner, k&ouml;nnen Sie den Namen relativ zur Position der Eingabedateien angeben. Im obigen Beispiel sind die einzelnen Kapitel in Unterverzeichnissen zum Ordner mit der Hauptdatei abgelegt. Sie k&ouml;nnten nun den Pfad zur Hauptdatei mit ../Haupt.tex im Dialogfenster realtiv zur Position der Eingabedateien festlegen.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Schlie&szlig;lich kann der Dateiname der Hauptdatei auch absolut in der Form /Users/ich/Haupt.tex eingegeben werden.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Ist das ganze Projekt in einer Datei abgelegt, muss keine Hauptdatei festgelegt werden.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">TeXShop speichert die Information &uuml;ber die Hauptdatei in einer Datei, die den selben Namen tr&auml;gt wie die Eingabedatei und die Endung .texshop hat. So hie&szlig;e die Datei f&uuml;r den Fall von zwei.tex, zwei.texshop. Diese Datei w&uuml;rde im gleichen Ordner wie zwei.tex erzeugt. Sollte die Datei zwei.texshop sp&auml;ter einmal gel&ouml;scht werden, wird TeXShop wieder zwei.tex alleine setzen anstelle von Haupt.tex.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Wird eine Datei mit Hilfe der Hauptdatei gesetzt, wird diese auch automatisch gespeichert. Die Hauptdatei jedoch muss separat von Hand gespeichert werden. Genauso muss der %!latex-Befehl in jeder Eingabedatei einzeln gesetzt werden, nicht nur in der Hauptdatei. </font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Es gibt noch eine andere Methode um das Hauptdokument zu erstellen. Statt ein Hauptdokument wie oben beschrieben zu erstellen, k&ouml;nnen Sie folgende Zeile in Ihr Unterdokument einf&uuml;gen:</font></p>
		<dl>
			<dd><font size="2" face="Lucida Grande,Geneva,Arial"><tt>%SourceDoc ../Main.tex</tt></font>
		</dl>
		<ul>
			
		</ul>
	</BODY>

</HTML>