<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Uso de un editor externo</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="editor externo">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Podemos configurar TeXShop para ser usado con un editor externo. Algunas de las posibilidades que explicamos serán útiles o no dependiendo de cómo trabaje el editor que elijas. El el futuro, puede que tu editor venga con instrucciones de configuración.  
</p>

		<P>
Hay un &iacute;tem de men&uacute; llamado &laquo;Abrir para previsualizar...&raquo;. Al usarlo, el programa nos indicar&aacute; que elijamos un archivo con c&oacute;digo fuente tex. Pero s&oacute;lo se abrir&aacute; el archivo pdf asociado, en su correspondiente ventana. Si el código no ha sido compilado aún, o si el archivo pdf no está actualizado, TeXShop compone las páginas antes de abrir el pdf. Puedes abrir el c&oacute;digo fuente con cualquier editor. Cuando quieras componer lo escrito, guarda los cambios en tu editor, vuelve a la ventana del pdf previsto y compila. De este modo, TeXShop nunca abrir&aacute; ni modificar&aacute; el archivo con el c&oacute;digo. Simplemente har&aacute; de intermediario para enviarlo al correspondiente proceso TeX o LaTeX en Unix.</P>

<P>Se puede configurar la ventana del pdf para que contenga un bot&oacute;n &laquo;Componer&raquo;. Si tal bot&oacute;n no aparece,
usa &laquo;Personalizar barra de herramientas...&raquo; del men&uacute; Ventana, y a&ntilde;&aacute;delo.</P>

		<p>Para los usuarios que prefieran emplear, generalmente, un editor externo, existe en las preferencias un &iacute;tem llamado &laquo;Configurar para editor externo&raquo;. Si hemos elegido esta opci&oacute;n, los men&uacute;s &laquo;Abrir...&raquo; y &laquo;Documentos recientes&raquo; abren los archivos de la manera anteriormente descrita, para editarlos con un editor externo. Adem&aacute;s, &laquo;Abrir para previsualizar...&raquo; se sustituye por &laquo;Abrir para editar...&raquo;, y sirve para abrir el c&oacute;digo con el editor interno de TeXShop, para las raras ocasiones en que queramos usar el editor interno. Los men&uacute;s &laquo;Abrir...&raquo; y &laquo;Documentos  recientes&raquo; tambi&eacute;n pueden abrir archivos jpg, tiff, ps, pdf, dvi y log, entre otros; tener seleccionada la preferencia &laquo;Abrir para previsualizar...&raquo; no cambia el comportamiento de TeXShop con estos archivos.</p>
		<p>
Algunos editores pueden llamar directamente a los comandos para componer de Unix. En las preferencias, el &iacute;tem &laquo;Actualizar PDF autom&aacute;ticamente&raquo; permite mejorar la comunicaci&oacute;n con estos editores. Cuando este &iacute;tem est&aacute; activo y abrimos un archivo .tex con &laquo;Abrir para previsualizar...&raquo;, el pdf previsto que muestra TeXShop se actualiza autom&aacute;ticamente cada vez que cambia el archivo pdf. As&iacute;, puedes trabajar con un editor externo, y la ventana con el pdf previsto permanece actualizada. Esta preferencia tambi&eacute;n se aplica a los archivo .pdf abiertos con TeXShop, y si TeXShop est&aacute; configurado para usar un editor externo, tambi&eacute;n a los archivos .tex abiertos con &laquo;Abrir...&raquo;.
 </p>
<p>TeXShop dispone de los siguientes comandos applescript, para que los editores puedan llamar a TeXShop directamente:
<dl>
<dd> typesetinteractive
<dd> texinteractive
<dd> latexinteractive
<dd> contextinteractive
<dd> bibtexinteractive
<dd> makeindexinteractive
<dd> metapostinteractive
<dd> taskdone
<dd> refreshpdf
<dd> open_for_externaleditor
</dl>
Los siete primeros comandos allaman a los comandos de componer de TeXShop.
Applescript devuelve el control inmediatamente sin esperar a que el proceso de composic&oacute;n de p&aacute;ginas haya concluido. La llamada &laquo;taskdone&raquo; se puede usar para chequear si ha acabado; devuelve NO mientras est&aacute; componiendo y YES cuando ha finalizado.
Cada una de estas llamadas refresca la ventana con el pdf previsto cuando termina la composici&oacute;n. Si tu editor llama a TeXShop para que componga, puedes desactivar la preferencia &laquo;Actualizar PDF autom&aacute;ticamente&raquo;.
</p>
<p>Si el editor externo modifica la salida pdf autom&aacute;ticamente, puede llamar a &laquo;refreshpdf&raquo; para refrescar el pdf prvisto que se muestra. Esto s&oacute;lo es necesario si &laquo;Actualizar PDF autom&aacute;ticamente&raquo; est&aacute; desactivado. Finalmente, &laquo;open_for_externaleditor&raquo; abre un archivo tex mediante una llamada a &laquo;Abrir para previsualizar...&raquo;.
 </p>

<p>El c&oacute;digo Tcl que hace estas llamadas desde AlphaX est&aacute; incluido en la carpeta AlphaTcl, dentro de la carpeta TeXShop_Folder de la distribuci&oacute;n de TeXShop. Lee las primeras l&iacute;neas de este archivo para ver c&oacute;mo configurar AlphaX con este prop&oacute;sito.
 </p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">Uso de un editor externo</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
