<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Protecci&oacute;n ante shell-escape</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="shell-escape; convertir gr&aacute;ficos; seguridad">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
Los comandos pdftex y pdflates, tal como aparecen por defecto, son ahora &laquo;pdftex --shell-escape&raquo; y &laquo;pdflatex --shell-escape&raquo;. La parte &laquo;shell-escape&raquo; de este texto indica a pdftex que puede llamar a otros programas cuando est&aacute; componiendo p&aacute;ginas. Esto es &uacute;til porque, as&iacute;, cuando pdftex encuentra una ilustraci&oacute;n en un formato que no entiende, puede llamar autom&aacute;ticamente a un programa de conversiones gr&aacute;ficas, para que convierta el gr&aacute;fico a otro formato. Por ejemplo, la plantilla LaTeX que aparece por defecto hace que los archivos eps se conviertan en pdf, y los archivos tif en png.
</P>

<P>
Esto crea una dificultad que puede preocupar a algunos usuarios. El &laquo;pdflatex --shell-escape&raquo; pemite a pdf ejecutar CUALQUIER programa. As&iacute;, un estudiante disgustado te puede enviar por email un fichero tex, y, al compilarlo, puedes descubrir que ha borrado algunos archivos de tu derectorio.
</P>

<P>
Creo que el peligro es muy peque&ntilde;o. Un fichero tex que haga da&ntilde;o ha tenido que ser creado deliberadamente, y que alguien env&iacute;e un &laquo;virus&raquo; por medio de c&oacute;digo tex parece algo esot&eacute;rico. No obstante, hay dos maneras con las que te puedes proteger. La primera y m&aacute;s f&aacute;cil es quitar los &laquo;--shell-escape&raquo; que aparecen en los comandos pdftex y pdflatex (solapa &laquo;Motor&raquo; de las Preferencias), y convertir todos los archivos gr&aacute;ficos a mano.</P>

<P>
TeXShop proporciona otra prtecci&oacute;n diferente. En la solapa &laquo;Motor&raquo; de las Preferencias, hay un &iacute;tem llamado &laquo;Avisos shell-escape&raquo;. Salvo que lo modifiques, est&aacute; sin marcar. Si estamos usando &laquo;--shell-escape&raquo; y tenemos los avisos marcados, la primera vez que TeXShop compila una archivo tex en una sesi&oacute;n, aparece un di&aacute;logo que te permite desactivar la comunicaci&oacute;n entre pdftex y otros programas durante toda la compilaci&oacute;n del archivo.
As&iacute;, puedes seguir compilado tus propios archivos permitiendo &laquo;--shell-escape&raquo;, pero no permitirlo en los que hayas recibido por email.
</P>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">Protecci&oacute;n ante shell-escape</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
