<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Archivos .plist</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="archivo plist; xml; panel latex; autocompleci&oacute;n; atajos de teclado; men&uacute; macros">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Mac OS X hace uso intensivo de archivos xml; xml es un lenguaje estructurado muy relacionado con html.</P>
		<p>TeXShop utiliza cuatro tipos de archivos xml para su configuraci&oacute;n: completion.plist, autocompletion.plist, KeyEquivalents.plist, y Macros.plist. Estos archivos est&aacute;n en tu Library de usuario, en una carpeta llamada ~/Library/TeXShop que se crea la primera vez que se ejecuta TeXShop. Si has modificado la configuraci&oacute;n de TeXShop predeterminada, y deseas llevar TeXShop a otra m&aacute;quina manteniendo tus modificaciones, copia ~/Library/TeXShop a la nueva maquina.</p>
		<p>Estos archivos se usan para configurar el Panel LaTeX, la Autocompleci&oacute;n, los atajos de teclado para los men&uacute;s, y el men&uacute; Macros. Se dan m&aacute;s detalles en otras partes de la ayuda.</p>
		<p>Los archivos de tipo plist son archivos de texto ordinarios, as&iacute; que se pueden abrir y editar con TeXShop, TextEdit, u otros editores de texto. Editarlos as&iacute; es sencillo, aunque bastante tedioso.</p>
		<p>Si un archivo plist contiene caracteres Unicode, hay que editarlo y guardarlo con formato UTF-8. Antes de abrir tal archivo con TeXShop, cambia las preferencias de codificaci&oacute;n de TeXShop a UTF-8. Entonces, edita y guarda el archivo. Ahora, puedes volver a poner las preferencias de codificaci&oacute;n que desees. Si no las has modificado previamente, su valor por defecto es MacOSRoman.</p>
		<p>Si has instalado las herramientas de desarrollo de Mac OS X y haces doble click en un archivo .plist, &eacute;ste se abrir&aacute; con un programa llamado Property List Editor. Este programa es &uacute;ltil para editar archivos plist, pero tiene fallos y no muestra toda la informaci&oacute;n del archivo. En particular, no aparecen los comentarios. Es mejor usar TeXShop.</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda avanzada</div><div id="header_title">Archivos .plist</div>
	<div id="menu_border">
		<ul>
			<LI><a href="advanced_personaltetex.htm">Adici&oacute;n de estilos personales y men&uacute;s de macros a teTeX</a>
			<LI><a href="advanced_addengine.htm">Motores de composici&oacute;n adicionales</a>
			<LI><a href="advanced_removeaux.htm">Borrado de archivos AUX</a>
			<li><a href="advanced_externaleditor.htm">Uso de un editor externo</a>
			<li><a href="advanced_pdfcopypaste.htm">Copiar-pegar y arrastrar-soltar desde la ventana del PDF</a>
			<li><a href="advanced_root.htm">Establecer un documento ra&iacute;z</a>
			<li><a href="advanced_pdfsync.htm">Sincronizaci&oacute;n c&oacute;digo-pdf (pdfsync)</a>
			<li><a href="advanced_unicode.htm">Unicode</a>
			<li><a href="advanced_bibtex.htm">BibTeX</a>
			<li><a href="advanced_makeindex.htm">MakeIndex</a>
			<li><a href="advanced_formats.htm">Creaci&oacute;n y uso de formatos de TeX</a>
			<li><a href="advanced_otherfiles.htm">Abrir otros archivos con TeXShop</a>
			<li><a href="advanced_mathematica.htm">Mathematica</a>
			<li><a href="advanced_localization.htm">Localizaciones</a>
			<li><a href="advanced_syntaxcolor.htm">Colores para sintaxis</a>
			<li><a href="advanced_shellescape.htm">Protecci&oacute;n ante shell-escape</a>
			<li><a href="advanced_coloredtext.htm">Texto coloreado en TeX</a>
			<li><a href="advanced_moretetex.htm">M&aacute;s sobre teTeX</a>
			<li><a href="advanced_fink.htm">Coexistencia con Fink</a>
			<li><a href="advanced_otherdistributions.htm">Coexistencia con otras distribuciones de TeX</a>
			<li><a href="advanced_context.htm">ConTeXt y MetaPost</a>
			<li><a href="advanced_plist.htm">Archivos .plist</a>
			<li><a href="advanced_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
		</UL>
	</div>
	</BODY>

</HTML>
