<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>M&eacute;todos alternativos de composici&oacute;n</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="tex; latex; dvi; ghostscript; eps">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>Hay otra manera de componer (&lsquo;typeset&rsquo;) con TeXShop; con este m&eacute;todo alternativo, las ilustraciones eps se pueden incluir directamente sin convertirlas previamente a pdf. Para ello, elegir &laquo;TeX y DVI&raquo; en el menu Componer. Entonces, TeXShop llamar&aacute; a tex o latex (en lugar de a pdftex o pdflatex) y generar&aacute; un archivo &laquo;.dvi&raquo; (en lugar de un &laquo;.pdf&raquo;), luego llamar&aacute; a dvips para convertirlo en un archivo postscript, y finalmente llamar&aacute; a ps2pdf para convertir el archivo postscript a pdf. El m&eacute;todo elegido en el men&uacute; Componer s&oacute;lo afectar&aacute; al archivo tex que se encuentre en ese momento al frente; para otros documentos, TeXShop continuar&aacute; usando pdftex o pdflatex. Si deseamos cambiar el m&eacute;todo predeterminado para componer, podemos hacerlo mediante del di&aacute;logo de preferencias.</P>
		<p>El m&eacute;todo &laquo;TeX y DVI&raquo; puede ser preferible para proyectos antiguos con muchas ilustraciones en formato eps, para archivos tex con comandos postscript especiales, y para archivos tex que incluyan letras bitmap que no se ver&aacute;n correctamente cuando se compongan mediante pdflatex. La experimentaci&oacute;n determinar&aacute; qu&eacute; &laquo;motor de composici&oacute;n&raquo; nos conviene usar.</p>
		<p>Hay una manera para establecer de forma permanente en un archivo el m&eacute;todo de composici&oacute;n, independientemene de las preferencias establecidas. Si una de las primeras veinte l&iacute;neas del documento es %!TEX TS-program = tex, entonces se usar&aacute; el m&eacute;todo tex + dvi. Si una de las primeras veinte l&iacute;neas es %!TEX TS-program = latex, entonces se usar&aacute; latex + dvi. Si una de las l&iacute;neas es %!TEX TS-program = pdftex, o %!TEX TS-program = pdflatex, entonces se usar&aacute; pdftex o pdflatex. Finalmente, si una de las l&iacute;neas es %!TEX TS-program = personaltex o %!TEX TS-program = personallatex, entonces se usar&aacute; el correspondiente script personal se&ntilde;alado en el di&aacute;logo de preferencias.</p>
</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda b&aacute;sica</div><div id="header_title">M&eacute;todos alternativos de composici&oacute;n</div>
		<div id="menu_border">
		<ul>
			<LI><a href="basic_preliminaries.htm">Preliminares</a>
			<LI><a href="basic_installtetex.htm">C&oacute;mo obtener e instalar teTeX</a>
			<LI><a href="basic_installtexshop.htm">C&oacute;mo obtener e instalar TeXShop</a>
			<li><a href="basic_typesetting.htm">Componer (&lsquo;typeset&rsquo;) documentos</a>
			<li><a href="basic_alternatetypeset.htm">M&eacute;todos alternativos de composici&oacute;n</a>
			<li><a href="basic_spelling.htm">Correcci&oacute;n ortogr&aacute;fica</a>
			<li><a href="basic_latexpanel.htm">Panel LaTeX</a>
			<li><a href="basic_matrixpanel.htm">Panel matrices</a>
			<li><a href="basic_macros.htm">Macros</a>
			<li><a href="basic_toolbar.htm">Barra de herramientas y AppleScript</a>
			<li><a href="basic_graphics.htm">Inclusi&oacute;n de gr&aacute;ficos</a>
			<li><a href="basic_printing.htm">Imprimir</a>
			<li><a href="basic_preferences.htm">Establecer preferencias</a>
			<li><a href="basic_templates.htm">Personalizaci&oacute;n del men&uacute; Plantillas</a>
			<li><a href="basic_edittricks.htm">Trucos de edici&oacute;n</a>
			<li><a href="basic_autocompletion.htm">Autocompleci&oacute;n</a>
			<li><a href="basic_commandcompletion.htm">Compleci&oacute;n de comandos</a>
			<li><a href="basic_bugs.htm">Notificaci&oacute;n de errores (&lsquo;bugs&rsquo;)</a>
			<li><a href="basic_websites.htm">Sitios web &uacute;tiles</a>
			<li><a href="basic_license.htm">Licencia</a>
			<li><a href="basic_thistranslation.htm">Sobre la traducci&oacute;n a espa&ntilde;ol</a>
		</UL>
	</div>
	</BODY>

</HTML>
