<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>C&oacute;mo obtener e instalar TeXShop</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="installar texshop; p&aacute;gina web; web site; www.uoregon.edu">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
			<P>Desde tu cuenta de usuario del Mac, ve al sitio web
		<dl>
			<dd><a href="http://www.uoregon.edu/%7ekoch/texshop/texshop.html">www.uoregon.edu/~koch/texshop/texshop.html</a>
		</dl>
			<p>y haz click en el enlace TeXShop para descargar el archivo &laquo;TeXShop.dmg&raquo;. Al hacer doble click en &eacute;l; aparece una carpeta conteniendo &laquo;TeXShop&raquo; y otros archivos que puedes leer o ignorar. Arrasta TeXShop a la carpeta Applications (si eres Administrador) o al lugar que consideres conveniente en tu carpeta de usuario. Si tienes intenci&oacute;n de usarlo muy a menudo, arrastra su icono al Dock.</p>

		<P>TeXShop dispone de una utilidad denominada pdfsync: al hacer clic en alg&uacute;n punto de la ventana con el pdf previsto, se abre la ventana correspondiente al c&oacute;digo TeX y, en ella, aparece seleccionada la l&iacute;nea de c&oacute;digo apropiada.
Para que esto funcione, es necesario que los paquetes llamado s&laquo;pdfsync.sty&raquo;, &laquo;pdfsync.tex&raquo; y &laquo;pdfsync4context.tex&raquo;
est&eacute;n instalados en teTeX.
Busca estos archivos en la distribuci&oacute;n de TeXShop y arr&aacute;stralos a ~/Library/texmf/tex/latex, ~/Library/texmf/tex/plain y ~/Library/texmf/tex/context, respectivamente.
Aqu&iacute;, ~/Library se refiere a la carpeta Library de tu directorio de usuario (&lsquo;home&rsquo;). Si no lo has hecho antes, puede que necesites crear alguna de las carpetas texmf, tex, latex o plain.</P>

		<P>Desde la versi&oacute;n 1.33, TeXShop viene con applescripts adicionales realizados por Claus Gerhardt; y la versi&oacute;n 1.35 incorpora otras de Will Robertson. Si est&aacute;s actualizando desde una versi&oacute;n anterior, no los ver&aacute;s autom&aacute;ticamente.</p>

		<p>Si no has editado nunca el conjunto de macros predeterminados, puedes activar las nuevos macros yendo a la carpeta ~/Library/TeXShop y borrando toda la carpeta Macros que hay all&iacute;. La siguiente vez que lo arranques, TeXShop volver&aacute; a crear esta carpeta con las &uacute;ltimos macros. No es suficiente borrar el contenido de la carpeta Macros; hay que borrar tambi&eacute;n la carpeta misma.</p>

		<p>Si has editado las macros que ven&iacute;an por defecto, y a&ntilde;adido algunas nuevas, borra temporalmente la carpeta Macros y deja que TeXShop cree una nueva. Entonces, a&ntilde;ade tus macros nuevas con el Editor de Macros.</p>

		<p>TeXShop 1.35 viene con nuevas plantillas debidas por Will Robertson. Estas plantillas no se instalan autom&aacute;ticamente. Para instalarlas, vete a ~/Library/TeXShop y mueve la carpeta Templates entera al escritorio.
La siguiente vez que arranque TeXShop, crear&aacute; de nuevo esta carpeta, y
contendr&aacute; las plantillas actualizadas. Tras esto, puedes mover las antiguas plantillas que hubieras editado desde la carpeta del escritorio a la carpeta ~/Library/TeXShop/Templates recientemente creada.</p> 

		</DIV>
		

</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Ayuda b&aacute;sica</div><div id="header_title">C&oacute;mo obtener e instalar TeXShop</div>
		<div id="menu_border">
		<ul>
			<LI><a href="basic_preliminaries.htm">Preliminares</a>
			<LI><a href="basic_installtetex.htm">C&oacute;mo obtener e instalar teTeX</a>
			<LI><a href="basic_installtexshop.htm">C&oacute;mo obtener e instalar TeXShop</a>
			<li><a href="basic_typesetting.htm">Componer (&lsquo;typeset&rsquo;) documentos</a>
			<li><a href="basic_alternatetypeset.htm">M&eacute;todos alternativos de composici&oacute;n</a>
			<li><a href="basic_spelling.htm">Correcci&oacute;n ortogr&aacute;fica</a>
			<li><a href="basic_latexpanel.htm">Panel LaTeX</a>
			<li><a href="basic_matrixpanel.htm">Panel matrices</a>
			<li><a href="basic_macros.htm">Macros</a>
			<li><a href="basic_toolbar.htm">Barra de herramientas y AppleScript</a>
			<li><a href="basic_graphics.htm">Inclusi&oacute;n de gr&aacute;ficos</a>
			<li><a href="basic_printing.htm">Imprimir</a>
			<li><a href="basic_preferences.htm">Establecer preferencias</a>
			<li><a href="basic_templates.htm">Personalizaci&oacute;n del men&uacute; Plantillas</a>
			<li><a href="basic_edittricks.htm">Trucos de edici&oacute;n</a>
			<li><a href="basic_autocompletion.htm">Autocompleci&oacute;n</a>
			<li><a href="basic_commandcompletion.htm">Compleci&oacute;n de comandos</a>
			<li><a href="basic_bugs.htm">Notificaci&oacute;n de errores (&lsquo;bugs&rsquo;)</a>
			<li><a href="basic_websites.htm">Sitios web &uacute;tiles</a>
			<li><a href="basic_license.htm">Licencia</a>
			<li><a href="basic_thistranslation.htm">Sobre la traducci&oacute;n a espa&ntilde;ol</a>
		</UL>
	</div>
	</BODY>

</HTML>

		
</BODY>

</HTML>
