<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Preferencias ocultas</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch bajo licencia FDL de GNU">
		<META NAME="description" CONTENT="preferencias ocultas; colores para sintaxis; color de fondo; copia de respaldo; backup file; x11; matrices; .aux; sincronizaci&oacute;n; marcas; transparencia">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
		<P>TeXShop a&ntilde;ade tal men&uacute; Marcas las l&iacute;neas que comienzan con las palabras \section, \subsection, \subsubsection o \chapter. Para desactivar esto, abre el Terminal y teclea el siguiente comando. Cambia la palabra NO por YES para activarlo de nuevo.</P>
		<dl>
			<dd>defaults write TeXShop TagSections NO
		</dl>
<p>Los usuarios de ConTeXt pueden querer que algunas palabras adicionales sean autom&aacute;ticamente reconocidas y a&ntilde;adidas al men&uacute; Marcas. Con la siguiente preferencia se logra a&ntilde;adir las palabras \subsubsubsection, \subsubsubsubsection, \part, \title,
\subject, \subsubject, \subsubsubject, \subsubsubsubject y \subsubsubsubsubject:
</p>
		<dl>
			<dd>defaults write TeXShop ConTeXtTags YES
		</dl>
		<p>Cuando los colores para sintaxis est&aacute;n activados, en la ventana de c&oacute;digo fuente, los comentarios se colorean en rojo, los comandos en azul, y los s&iacute;mbolos $, {, y } en verde oscuro. Se pueden cambiar estos colores. Cada color se determina por sus componentes rojo, verde y azul (esto es, en RGB); estas componentes son n&uacute;meros reales entre 0.00 y 1.00. Para cambiar el color de $, {, y } a un verde muy intenso, ejecuta los siguientes comandos en el Terminal:</p>
		<dl>
			<dd>defaults write TeXShop markerred 0.0
			<dd>defaults write TeXShop markergreen 1.0
			<dd>defaults write TeXShop markerblue 0.0
		</dl>
		<p>Para cambiar el color de los comentarios, reemplaza &laquo;marker&raquo; con &laquo;comment&raquo;; para cambiar el color de los comandos, reemplaza &laquo;marker&raquo; con &laquo;command&raquo;. </p>
                <p>Se puede cambiar el color de fondo de la ventana en la que se escribe el c&oacute;digo TeX. Por ejemplo, para asignar (r, g, b) = (.42, .39, .77) como color de fondo, ejecuta en el Terminal los siguientes comandos:</p>
		<dl>
			<dd>defaults write TeXShop background_R 0.42
			<dd>defaults write TeXShop background_G 0.39
			<dd>defaults write TeXShop background_B 0.77
		</dl>
<p>As&iacute; mismo, se puede configurar el color del texto en la ventana con el c&oacute;digo fuente. Aunque esto s&oacute;lo tiene efecto si los colores para sintaxis est&aacute;n activados. Para asignar al texto el color (r, g, b) = (.42, .39, .77), ejecuta en el Terminal los siguientes comandos:</p>
		<dl>
			<dd>defaults write TeXShop foreground_R 0.42
			<dd>defaults write TeXShop foreground_G 0.39
			<dd>defaults write TeXShop foreground_B 0.77
		</dl>
<p>Y tambi&eacute;n se puede modificar el color del punto de inserci&oacute;n de la ventana de c&oacute;digo. Por ejemplo, para asignar al punto de inserci&oacute;n el color (r, g, b) = (.42, .39, .77), ejecuta en el Terminal los siguientes comandos:</p>
		<dl>
			<dd>defaults write TeXShop insertionpoint_R 0.42
			<dd>defaults write TeXShop insertionpoint_G 0.39
			<dd>defaults write TeXShop insertionpoint_B 0.77
		</dl>
<p>Usando los tres conjuntos de preferencias anteriores de manera simult&aacute;nea, se puede escribir texto blanco sobre fondo negro, o usar en el editor cualquier otra combinaci&oacute;n de colores.</p> 
	<p>Podemos cambiar el color de fondo de la ventana con el pdf previsto. Por ejmplo, para ponerle el fondo con color (r, g, b) = (.42, .39, .77), ejecuta lo que sigue en el Terminal. Es posible que los documentos de TeX coloreados se vean mejor sobre fondo gris. Este color de fondo no afecta a lo que se obtiene al imprimir.</p>
		<dl>
			<dd>defaults write TeXShop Pdfbackground_R 0.42
			<dd>defaults write TeXShop Pdfbackground_G 0.39
			<dd>defaults write TeXShop Pdfbackground_B 0.77
		</dl>
<p>Hay unas preferencias ocultas para asignar transparencia a las ventanas con el c&oacute;digo, el pdf previsto, y la consola. Por ejmplo:</p>
		<dl>
			<dd>defaults write TeXShop ConsoleWindowAlpha 0.75
			<dd>defaults write TeXShop SourceWindowAlpha 0.75
			<dd>defaults write TeXShop PreviewWindowAlpha 0.75
		</dl>
<p>Aqu&iacute;, un valor alpha 0.00 significa completamente transparente, y un valor alpha 1.00 es completamente opcaco. &iexcl;Usa estos comandos con precauci&oacute;n!</p>

<p>Podemos configurar TeXShop para que guarde una copia de respaldo (&lsquo;backup file&rsquo;) cada vez que componemos o guardamos un archivo con c&oacute;digo fuente. Para activar esto, abre el Terminal y ejecuta el siguiente comando. Cambia YES por NO para desactivarlo.
</p>
		<dl>
			<dd>defaults write TeXShop KeepBackup YES
		</dl>

<p>Ocasionalmente, al componer p&aacute;ginas, los archivos .aux, .log, y otros que TeX crea autom&aacute;ticamente, se corrompen y hay que borrarlos. TeXShop tiene un men&uacute;
&laquo;Borrar archivos aux&raquo;, y un bot&oacute;n en la Consola con la misma funci&oacute;n. Al usar cualquiera de los dos, TeXShop pone en la papelera todos los ficheros con el mismo nombre (descartada la extensi&oacute;n), y situados en la misma carpeta, que el archivo con el c&oacute;digo fuente, siempre que su extensi&oacute;n sea .aux, .bbl, .blg, .brf, .glo, .idx, .ilg, .ind, .ioa, .log, .log, .lot, .mtc, .mlf, .out, .pdfsync, .toc, .ttt, .wrm, .xref, .4ct o .4tc.
Se pueden a&ntilde;adir m&aacute;s extensiones a esta lista, una por una. Por ejemplo, para a&ntilde;adir los archivos .dvi a la lista, haz
</p>
		<dl>
			<dd>defaults write TeXShop OtherTrashExtensions -array-add "dvi"
		</dl>
<p>Tambi&eacute;n se puede suprimir de la lista todas las extensiones a&ntilde;adidas, y volver a la original:
	<dl>
		<dd> defaults write TeXShop OtherTrashExtensions -array
	</dl>
<p>A veces es necesaria una limpieza m&aacute;s profunda. Si pulsamos la tecla opci&oacute;n al usar &laquo;Borrar archivos aux&raquo;, TeXShop usa los mecanismos de &laquo;%!TEX root =&raquo; y &laquo;Documento ra&iacute;z...&raquo; para encontrar el documento ra&iacute;z. Entonces lleva a la papelera todos los archivos en la carpeta de ese archivo ra&iacute;z y sus subcarpetas, siempre que tengan las extensiones adecuadas, y sin tener en cuenta su nombre.
Se puede hacer que &eacute;ste sea el comportamiento predeterminado de &laquo;Borrar archivos aux&raquo;, para que no haya que usar la tecla opci&oacute;n. Esto se logra con
</p>
<dl>
<dd> defaults write TeXShop AggressiveTrashAUX YES
</dl>

<p>Se puede configurar TeXShop para que refresque autom&aacute;ticamente el pdf que muestra cuando el archivo pdf cambia. Para hacer esto, TeXShop examina, una vez por segundo, la fecha y hora en que se ha escrito el pdf, para ver si esta informaci&oacute;n ha cambiado. Podemos modificar el intervalo de tiempo entre estas comprobaciones. Para hacerlo, abre el Terminal y teclea el siguiente comando. Cambia 1.00 por el tiempo que desees, en segundos.
</p>
		<dl>
			<dd>defaults write TeXShop RefreshTime 1.00
		</dl>

<p>El refresco autom&aacute;tico del pdf previsto es &uacute;til si hemos configurado TeXShop para usarlo con un editor externo, o si hemos abierto un fichero tex con &laquo;Abrir para previsualizar...&raquo;.
En estos casos, se abre un archivo .tex, pero TeXShop s&oacute;lo muestra el archivo pdf asociado. TeXShop tambi&eacute;n permite abrir archivos pdf directamente; esto es &uacute;til para echar un vistazo a las ilustraciones antes de incluirlas en un documento TeX. Si quieres que los archivos pdf abiertos con un editor externo se refresquen autom&aacute;ticamente, pero que TeXShop deje tranquilos los archivos pdf abiertos para echar un vistazo, ejecuta el Terminal y teclea el siguiente comando.
El valor por defecto de esta preferencia es YES.
</p>
		<dl>
			<dd>defaults write TeXShop PdfFileRefresh NO
		</dl>

<p>Cuando TeXShop abre un archivo .tex para usarlo con un editor externo, comprueba las fechas de los archivo tex y pdf para estar seguro que que la salida pdf est&aacute; actualizada. Si no lo est&aacute;, o si el archivo pdf no existe, TeXShop compila el documento .tex de nuevo. Para desactivar este comportamiento, ejecuta el Terminal y teclea el siguiente comando:
</p>
		<dl>
			<dd>defaults write TeXShop ExternalEditorTypesetAtStart NO
		</dl>

<p>Hay una preferencia oculta para asignar un tama&ntilde;o predeterminado a las matrices que crea el Panel matrices. Para cambiar el valor que viene por defecto, usa, por ejemplo,</p>
		<dl>
			<dd> defaults write TeXShop matrixsize 12
		</dl> 

<p>Aunque no est&aacute; instalado por defecto, la barra de herramientas de la ventana del pdf contiene un &lsquo;checkbox&rsquo; llamado SyncMarks.
Cuando est&aacute; marcado, TeXShop muestra los puntos de sincronizaci&oacute;n
en la ventana con el pdf previsto.
Cuando la ventana con el pdf aparece por primera vez, este &lsquo;checkbox&rsquo; no est&aacute; marcado. Esto se puede cambiar v&iacute;a</p>
		<dl>
			<dd>defaults write TeXShop ShowSyncMarks YES
		</dl>

<p>Cuando la ventana con el pdf se actualiza tras componer, esta ventana se coloca en el frente. Este comportamiento causa problemas si se usa con un editor X11 que se est&eacute; ejecutando en el X11 Window Manager de Apple. Para evitarlo, este comportamiento se puede desactivar con</p>
		<dl>
			<dd>defaults write TeXShop BringPdfFrontOnAutomaticUpdate NO
		</dl>

<p>En versiones anteriores, TeXShop usaba una juego diferente de comandos para especificar el motor de composici&oacute;n, el c&oacute;digo de caracteres y el archivo ra&iacute;z;
por ejemplo, %&amp;latex, %&amp;encoding= UTF-8 Unicode o %SourceDoc ../Main.tex.
Esta sintaxis no era adecuada, y se ha cambiado (la nueva se explica en otra parte de la ayuda). Si tienes muchos documentos antiguos, puedes volver a activar temporalmente este tipo de comandos, y lograr que tanto la sintaxis antigua como la nueva funcionen. Este cambio, que deber&iacute;as efectuar s&oacute;lo en caso de emergencia, se logra con</p>
		<dl>
			<dd>defaults write TeXShop UseOldHeadingCommands YES
		</dl>
<p>Las teclas de cursor izquierda y derecha hacen que el contenido de la ventana con el pdf previsto se desplace hacia los lados si la ventana es m&aacute;s estrecha que el tama&ntilde;o de la p&aacute;gina; en otro caso, el desplazamiento es vertical. Hay una preferencia oculta para cambiar esto, y conseguir que las teclas de cursor izquierda y derecha sirvan siempre para cambiar de p&aacute;gina:</p>
		<dl>
			<dd>defaults write TeXShop LeftRightArrowsAlwaysPage YES
		</dl>
<p>La consola de texto en la que aparecen tanto los mensajes que nos env&iacute;a TeX al componer p&aacute;ginas como los errores muestra el texto en negro. Se puede conseguir que el texto sea rojo a partir del primer error con una preferencia oculta:</p>
		<dl>
			<dd> defaults write TeXShop RedConsoleAfterError YES
		</dl>
<p>En la ventana de edici&oacute;n, los ajustes de l&iacute;nea din&aacute;micos (es decir, la introducci&oacute;n de cambios de l&iacute;nea que s&oacute;lo aparecen en la ventana, pero no son reales) se produce siempre al final de las palabras. Este comportamiento puede cambiarse a &laquo;ninguno&raquo; = 0, &laquo;por palabras&raquo; = 1 o &laquo;por caracteres&raquo; = 2:
</p>
		<dl>
			<dd>defaults write TeXShop LineBreakMode 1
		</dl>
<p>Cuando la ventana con el pdf previsto aparece por primera vez, su caj&oacute;n est&aacute; oculto. Hay una preferencia oculta para lograr que el caj&oacute;n sea visible la primera vez que aparece la ventana con el pdf:
</p>
		<dl>
			<dd>defaults write TeXShop PreviewDrawerOpen YES
		</dl>

<p>Cuando se lanz&oacute; TeXShop para Tiger (Mac OS X 10.4), los usuarios notaron un molesto bug que hac&iacute;a que el funcionamiento del programa fuera cada vez m&aacute;s lento, hasta llegar a ser pr&aacute;cticamente inusable tras varios a procesos de componer p&aacute;ginas. Este bug fue solucionado un par de d&iacute;as despu&eacute;s del lanzamiento. El problema ocurr&iacute;a cuando un nuevo pdf era cargado en el PdfKitView de la ventana con el pdf.
Seg&uacute;n la documentaci&oacute;n de Apple, esto deber&iacute;a haber liberado de la memoria las estructuras de datos previas. La liberaci&oacute;n ocurr&iacute;a, pero ocasionaba que el programa se hiciera m&aacute;s lento. As&iacute; que el m&eacute;todo de fijar el bug consiti&oacute; en puentear al sistema haci&eacute;ndole creer que esas estructuras de datos todav&iacute;a esaban siendo usadas, as&iacute; que el sistema no las liberaba.</p>
<p>Recientes investigaciones parecen mostrar que este bug no es tan severo en Tiger 10.4.4. Como consecuencia, se ha a&ntilde;adido una preferencia oculta para liberar los datos si as&iacute; lo desamos. Los valores de esta preferencia son</p>
		<dl>
			<dd> 0 para liberar los datos en el sistema 10.4.3 o superior
			<dd> 1 para no liberar nunca los datos
			<dd> 2 para liberar siempre los datos
		</dl>
<p>El valor por defecto es 1, lo que causa que el programa se comporte tal como lo hac&iacute;an las versiones anteriores:</p>
		<dl>
			<dd>defaults write TeXShop ReleaseDocumentClasses 1
		</dl>

</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">&iquest;C&oacute;mo configuro TeXShop?</div><div id="header_title">Preferencias ocultas</div>
		<div id="menu_border">
		<UL>
			<LI><a href="configure_preliminaries.htm">Preliminares</a>
			<LI><a href="configure_correctinstall.htm">&iquest;Has instalado TeXShop correctamente?</a>
			<LI><a href="configure_prefchanges.htm">Recomendaciones de cambios en las preferencias</a>
			<LI><a href="configure_convertgraphics.htm">Conversi&oacute;n autom&aacute;tica de formatos gr&aacute;ficos</a>
			<LI><a href="configure_defaults.htm">Preferencias predeterminadas</a>
			<LI><a href="configure_latextemplate.htm">Plantilla LaTeX predeterminada</a>
			<li><a href="configure_hidden.htm">Preferencias ocultas</a>
			<li><a href="configure_plist.htm">Archivos .plist</a>
			<li><a href="configure_panel.htm">Modificaci&oacute;n del panel LaTeX</a>
			<li><a href="configure_autocompletion.htm">Modificaci&oacute;n de la autocompleci&oacute;n</a>
			<li><a href="configure_menushortcuts.htm">Redefinici&oacute;n de atajos de teclado de men&uacute;s</a>
			<li><a href="configure_macros.htm">Modificaci&oacute;n del men&uacute; Macros</a>
		</UL>
	</div>
	</BODY>

</HTML>
