<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Uso de un editor externo</TITLE>
	</HEAD>

<BODY BGCOLOR="#ffffff">
		<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
<TR HEIGHT="40">
<TD WIDTH="40" HEIGHT="40"><a href="../TeXShop%20Help.htm"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></TD>
<TD WIDTH="6" HEIGHT="40"></TD>
<TD HEIGHT="40" VALIGN="middle"><FONT FACE="Lucida Grande,Helvetica,Arial" SIZE="4"><B>Uso de un editor externo</B></FONT></TD>
</TR>
</TABLE>
		<P><font size="2" face="Lucida Grande,Geneva,Arial">Podemos configurar TeXShop para ser usado con un editor externo. Cuando &eacute;ste es  el caso, aparece un nuevo men&uacute; llamado &laquo;Abrir para previsualizar...&raquo;. Al usarlo, el programa nos indicar&aacute; que elijamos un archivo con c&oacute;digo fuente tex. Pero s&oacute;lo se abrir&aacute; el archivo pdf asociado, en su correpondiente ventana (si no hemos compilado a&uacute;n el c&oacute;digo, la ventana con el pdf estar&aacute; en blanco). Gracias a la barra de herramientas de Leuski, la ventana con el pdf previsto se puede configurar de manera que contenga un bot&oacute;n para componer. Puedes abrir el c&oacute;digo fuente con cualquier editor. Cuando quieras componer lo escrito, guarda los cambios en tu editor, vuelve a la ventana del pdf previsto y compila. De este modo, TeXShop nunca abrir&aacute; ni modificar&aacute; el archivo con el c&oacute;digo. Simplemente har&aacute; de intermediario para enviarlo al correspondiente proceso TeX o LaTeX en Unix.</font></P>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">Para los usuarios que prefieran usar, generalmente, un editor externo, existe en las preferencias un &iacute;tem llamado &laquo;Configurar para editor externo&raquo;. Si hemos elegido esta opci&oacute;n, los men&uacute;s &laquo;Abrir...&raquo; y &laquo;Documentos recientes&raquo; abren los archivos de la manera anteriormente descrita, para editarlos con un editor externo. Adem&aacute;s, &laquo;Abrir para previsualizar...&raquo; se sustituye por &laquo;Abrir para editar...&raquo;, y sirve para abrir el c&oacute;digo con el editor interno de TeXShop, para las raras ocasiones en que queramos usar el editor interno. Los men&uacute;s &laquo;Abrir...&raquo; y &laquo;Documentos  recientes&raquo; tambi&eacute;n pueden abrir archivos jpg, tiff, ps, pdf, dvi y log, entre otros; tener seleccionada la preferencia &laquo;Abrir para previsualizar...&raquo; no cambia el comportamiento de TeXShop con estos archivos.</font></p>
		<p><font size="2" face="Lucida Grande,Geneva,Arial">El soporte AppleScript para la opci&oacute;n de editor externo es todav&iacute;a d&eacute;bil; ser&aacute; mejorado en alguna versi&oacute;n futura, haciendo posible componer completamente el documento desde un editor que maneje AppleScript.</font></p>
		<ul>
			
		</ul>
	</BODY>

</HTML>