<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Zus&auml;tzliche Schriftsatz-Programme</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Zus&auml;tzliche Schriftsatzprogramme in TeXShop integrieren. Voe allem Behandlng von XeTeX und XeLaTeX.">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>

<BODY>
	<div id="content_border">
<p>Vor kurzem wurden XeTeX und XeLaTeX von Jonathan Kew vorgestellt. Mit Hilfe dieser Programme kann man die Macintosh Systemschriften direkt in TeX-Dokumenten benutzen.  XeTeX und XeLaTeX verarbeiten Unicode-Quellcode und k&ouml;nnen daher mit allen Unicode-Zeichen umgehen. Daher ist es m&ouml;glich, dass Sie arabische oder hebr&auml;ische Zeichen direkt im Quelldokument eingeben und diese auch im fertigen Dokument erscheinen. Mit dem Editor von TeXShop k&ouml;nnen Sie diese Zeichen auch von rechts nach links eingeben. XeTeX ist incht teil der Standard-TeX-Distribution von Gerben Wierda. Jedoch kann das Paket optional mit Hilfe des i-Installers &uuml;ber ein von Jonathan Kew bereit gestelltes Paket installiert werden. Weitere Informationen finden Sie auf folgender Seite:</p>
<dl>
			<dd><a href="http://scripts.sil.org/xetex">http://scripts.sil.org/xetex</a>
		</dl>

<p>Um zu verstehen wie XeLaTeX funktioniert, wird im Folgenden ein Beispieldokument vorgestellt. Die arabischen und hebr&auml;ischen Zeichen wurden mit Hilfe der Internationalen Zeicheneingabe eingef&uuml;gt. W&auml;hlen Sie hierzu einfach in den Einstellungen des Tastaturmen&uuml;s &bdquo;Arabisch&ldquo; oder &bdquo;Hebr&auml;isch&ldquo; aus. Eine kleine Fahne in der Men&uuml;leiste erscheint daraufhin und Sie k&ouml;nnen zwischen den verschiedenen Eingabeformaten wechseln, indem Sie die entsprechende Flagge ausw&auml;hlen.</p>
<IMG HEIGHT="355" WIDTH="330" border="0" SRC="../gfx/source.jpg">

<IMG HEIGHT="155" WIDTH="349" border="0" SRC="../gfx/output.jpg">

<p>TeXShop unterst&uuml;tzt XeTeX und XeLaTeX folgenderma&szlig;en:</p>
<dl>
<li>XeTeX und XeLaTeX sind im Auswahlmen&uuml; des Satzsystems im Quell-Fenster enthalten.<li>XeTeX oder XeLaTeX k&ouml;nnen als Standard-Schriftsatz-Programm in den Einstellungen ausgew&auml;hlt werden.<li>Enth&auml;lt eine der ersten zehn Zeilen des Quelltextes foIgenden Text:<dl>
<dd>%&amp;encoding=UTF-8 Unicode</dl>wird der Quelltext mit UTF-8 Unicode gesichert. Dies geschieht unabh&auml;ngig von den allgemeinen Einstellungen<li>Hat die erste Zeile des Quelltextes folgenden Inhalt:<dl>
<dd>%&amp;program=xetex oder %&amp;program=xelatex</dl>wird das entsprechende Programm zum Setzen des Dokuments, unabh&auml;ngig von den allgemeinen Einstellungen benutzt.</dl>

<p>Diese Funktionen von XeTeX stellen eine besondere Art da, wie man Schriftsatz-Programme zu TeXShop hinzuf&uuml;gt. Im Ordner &bdquo;~/Library/TeXShop&ldquo; existiert nun ein Ordner &bdquo;Engines&ldquo;. Die Dateien in diesem Ordner sind Shell-Skripte, die Schriftsatz-Programme aufrufen. Beim ersten Start von TeXShop durchsucht das Programm diesen Ordner und f&uuml;gt die gefundenen Schriftsatz-Programme zum Auswahlmen&uuml; im Quelltext-Fenster hinzu. Wird nun eines dieser Programme im Auswahlmen&uuml; aktiviert, so wird beim Satzvorgang das entsprechende Shell-Skript aufgerufen. Alle Skripten im Ordner &bdquo;Engines&ldquo; m&uuml;ssen das Suffix &bdquo;.engine&ldquo; haben und m&uuml;ssen ausf&uuml;hrbar sein (executable-bit gesetzt).</p>

<p>Skripte in &bdquo;~/Library/TeXShop/Engines&ldquo; k&ouml;nnen zudem als Standard-Satzmethode in den Einstellungen von TeXshop ausgew&auml;hlt werden. Beachten Sie, dass wenn eine neue Satzmethode in den Einstellungen erscheint, diese ohne das Suffix &bdquo;.engine&ldquo; aufgelistet wird.</p>

<p>Das Standard-Programm kann auch im Quelltext eingestellt werden, indem man folgendes in die erste Zeile des Quelltextes hinzuf&uuml;gt:</p>
<dl>
<dd>%&amp;program=xelatex</dl>

<p>Die Kodierung, die zum &Ouml;ffnen und Sichern einer Datei verwendet wird, kann durch einen Eintrag der folgenden Form innerhalb der ersten zehn Zeilen des Quelltextes festgelegt werden. Beachten Sie das jede unterst&uuml;tzte Kodierung erlaubt ist. Um diese lokale Festlegung zu umgehen, m&uuml;ssen Sie die Wahltaste beim &Ouml;ffnen des Dokuments gedr&uuml;ckt halten:</p>
<dl>
<dd>%&amp;encoding=UTF-8 Unicode</dl>
 <p>Nach oder vor dem Gleichzeichen d&uuml;rfen keine Leerzeichen stehen. Die Leerzeichen in der Angabe der Kodierung m&uuml;ssen edn Leerzeichen in der folgenden Liste entsprechen. Die Bezeichnung der Kodierung ist die interne Bezeichnung, die von Mac OS X verwendet wird. Hier nun die Liste der m&ouml;glichen Bezeichnungen:</p>
<dl>
<li> MacOSRoman
<li> IsoLatin
<li> IsoLatin2
<li> IsoLatin5
<li> MacJapanese
<li> DOSJapanese
<li> SJIS_X0213
<li> EUC_JP
<li> JISJapanese
<li> MacKorean
<li> UTF-8 Unicode
<li> Standard Unicode
<li> Mac Cyrillic
<li> DOS Cyrillic
<li> DOS Russian
<li> Windows Cyrillic
<li> KOI8_R
<li> Mac Chinese Traditional
<li> Mac Chinese Simplified
<li> DOS Chinese Traditional
<li> DOS Chinese Simplified
<li> GBK
<li> GB 2312
<li> GB 18030
</dl>

</div>
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Erweitert</div><div id="header_title">Zus&auml;tzliche Schriftsatz-Programme</div>
	<div id="menu_border">
		<ul>
			<li><a href="advanced_personaltetex.htm">Pers&ouml;nliche sty- und Makrodateien zu teTeX hinzuf&uuml;gen</a></li>
			<LI><a href="advanced_addengine.htm">Zusätzliche Schriftsatz-Programme</a>
			<LI><a href="advanced_removeaux.htm">AUX-Dateien entfernen</a>
			<li><a href="advanced_externaleditor.htm">Einen externen Editor verwenden</a></li>
			<li><a href="advanced_pdfcopypaste.htm">Kopieren-Einf&uuml;gen und Drag-Drop aus dem Vorschau-Fenster</a></li>
			<li><a href="advanced_root.htm">Die Hauptdatei des Projekts festlegen</a></li>
			<li><a href="advanced_pdfsync.htm">Pdfsync</a></li>
			<li><a href="advanced_unicode.htm">Unicode</a></li>
			<li><a href="advanced_bibtex.htm">BibTeX</a></li>
			<li><a href="advanced_makeindex.htm">MakeIndex</a></li>
			<li><a href="advanced_otherfiles.htm">Andere Dateien mit TeXShop &ouml;ffnen</a></li>
			<li><a href="advanced_mathematica.htm">Mathematica</a></li>
			<li><a href="advanced_localization.htm">Lokalisierungen</a></li>
			<li><a href="advanced_syntaxcolor.htm">Syntax Farben </a></li>
			<li><a href="advanced_shellescape.htm">Shell Escape Schutz</a></li>
			<li><a href="advanced_coloredtext.htm">Farbiger Text in TeX</a></li>
			<li><a href="advanced_moretetex.htm">Mehr &uuml;ber teTeX</a></li>
			<li><a href="advanced_fink.htm">Zusammenarbeit mit Fink</a></li>
			<li><a href="advanced_otherdistributions.htm">Zusammenarbeit mit anderen TeX Distributionen</a></li>
			<li><a href="advanced_context.htm">ConTeXt und MetaPost</a></li>
			<li><a href="advanced_plist.htm">Plist Dateien</a></li>
			<li><a href="advanced_menushortcuts.htm">Tastaturk&uuml;rzel neubelegen</a></li>
		</UL>
	</div>
	</BODY>

</HTML>