<HTML>

	<HEAD>
<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
<TITLE>Grafik einf&uuml;gen</TITLE>
<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="So f&uuml;gen Sie Grafiken in Ihr Dokument ein.">
		<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>
	<div id="content_border">	
		<p>Die Programme pdftex und pdflatex erlauben es Grafiken in den Formaten pdf, jpg oder tiff einzuf&uuml;gen. Zu beachten ist jedoch, dass tiff-Grafiken die Endung &bdquo;.tif&ldquo; anstelle von &bdquo;.tiff&ldquo; haben m&uuml;ssen. Das native Ausgabeformat von Mac OS X ist pdf. (portable document format) Diese Dateien k&ouml;nnen in jeder Gr&ouml;&szlig;e in guter Qualit&auml;t ausgedruckt werden. Sehr wahrscheinlich werden die meisten Programme f&uuml;r Mac OS X in Zukunft pdf-Dateien erstellen k&ouml;nnen.</p>
		<p>Sollten Sie schon fr&uuml;her TeX benutzt haben, liegen Ihre Grafiken vielleicht im eps-Format vor. Pdftex und pdflatex k&ouml;nnen diese Dateien nicht direkt verarbeiten. Sie m&uuml;ssen erst in das pdf-Format umgewandelt werden. Um eine eps-Datei zu konvertieren, &ouml;ffnen Sie sie in TeXShop. Sobald die Datei im Anzeigefenster erscheint wird eine eine pdf-Datei des selben Inhalts erstellt und gesichert. Es existiert auch ein Kommandzeilen-Programm, mit dem die Konvertierung vollzogen werden kann. (TeXShop selbst benutzt auch dieses Programm im Hintergrund). Um die Datei &bdquo;meinedatei.eps&ldquo; in &bdquo;meinedatei.pdf&ldquo; umzuwandeln, geben Sie im Terminal-Fenster</p>
		<dl>
			<dd><tt>epstopdf myfile.eps</tt> 
		</dl>
		<p>ein und d&uuml;cken die Eingabetaste. Die Autoren von pdflatex und die Autoren des Grafikpakets &bdquo;graphics&ldquo; haben es vereinfacht Grafiken in ein LaTeX Dokument einzuf&uuml;gen und mit pdflatex zu setzen. Selbst wenn das Dokument sp&auml;ter mit Standard LaTeX gesetzt wird und, f&uuml;r die Weitergabe an andere, in eine dvi-Datei konvertiert wird. F&uuml;gen Sie am Anfang der LaTeX-Quelldatei folgende Zeile ein:</p>
		<dl>
			<dd><tt>\usepackage{graphicx}</tt>
		</dl>
		<p>Wenn sie jetzt eine Grafik einf&uuml;gen wollen, beispielsweise &quot;f1.pdf&quot;, dann benutzten sie den Befehl</p>
		<dl>
			<dd><tt>\includegraphics[width=2in]{f1}</tt>
		</dl>
		<p>Dieser Befehl l&auml;sst TeX die Grafik &quot;f1.pdf&quot; beim n&auml;chsten Setzen mit pdflatex einf&uuml;gen, jedoch  erst wenn der Text mit latex gesetzt wird.</p>
		<p>Wenn Sie von einer &auml;lteren Version aktualisiert haben und die automatische Umwandlung von eps und tif Dateien w&auml;hrend des Setzen m&ouml;chten, dann stellen Sie sicher, dass</p>
		<ol>
			<li type="a">sie folgende Programme installiert haben: Ghostscript 8, Freetype 2, wmf und iconv conversion Unterst&uuml;tzung, au&szlig;erdem<br>
					
					
					ImageMagick mit Gerben Wierda's Installationsprogramm
			<li type="a">die Einstellung von pdflatex &quot;pdflatex --shell-escape&quot; ist
			<li type="a">die Kopfzeile Ihres Quelltextes folgende Zeilen enth&auml;lt:
		</ol>
		<dl>
			<dd><tt>\usepackage{graphicx}</tt>
			<dd><tt>\usepackage{epstopdf}</tt>
			<dd><tt>\DeclareGraphicsRule{.tif}{png}{.png}{`convert #1 `basename #1 .tif`.png}</tt>
		</dl>
	</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Grundlagen</div>
<div id="header_title">Grafik einf&uuml;gen</div>


	<div id="menu_border">
		<UL>
			<LI><a href="basic_preliminaries.htm">Einf&uuml;hrung</a></li>
			<LI><a href="basic_installtetex.htm">teTeX beschaffen und installieren</a></li>
			<LI><a href="basic_installtexshop.htm">TeXShop beschaffen und installieren</a></li>
			<LI><a href="basic_typesetting.htm">Dokumente setzen</a></li>
			<li><a href="basic_alternatetypeset.htm">Alternativer Schriftsatzmodus</a></li>
			<li><a href="basic_spelling.htm">Rechtschreibpr&uuml;fung</a></li>
			<li><a href="basic_latexpanel.htm">LaTeX Palette</a></li>
			<li><a href="basic_matrixpanel.htm">Matrix-Palette</a></li>
			<li><a href="basic_macros.htm">Makros</a></li>
			<li><a href="basic_toolbar.htm">Werkzeugleiste und AppleScript</a></li>
			<li><a href="basic_graphics.htm">Grafik einf&uuml;gen</a></li>
			<li><a href="basic_printing.htm">Drucken</a></li>
			<li><a href="basic_preferences.htm">Einstellungen &auml;ndern</a></li>
			<li><a href="basic_templates.htm">&Auml;ndern des Vorlagenmen&uuml;s</a></li>
			<li><a href="basic_edittricks.htm">Bearbeitungstipps</a></li>
			<li><a href="basic_autocompletion.htm">Autovervollst&auml;ndigen</a></li>
			<li><a href="basic_commandcompletion.htm">Vervollst&auml;ndigung von Befehlen</a></li>
			<li><a href="basic_bugs.htm">Fehlerbericht &uuml;bermitteln</a></li>
			<li><a href="basic_websites.htm">N&uuml;tzliche Webseiten</a></li>
			<li><a href="basic_license.htm">Lizenz</a></li>
		</UL>
	</div>
	
	</BODY>
</HTML>