<HTML>

<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Empfohlene &Auml;nderung von Einstellungen</TITLE>
		<META NAME="copyright" CONTENT="Copyright (c) 2003 Richard Koch und Martin Kerz unter der GNU FDL">
		<META NAME="description" CONTENT="Einige &Auml;nderungen der Standardeinstellungen, die Sie wahrscheinlich vornehmen wollen.">
				<link href="../sty/screen.css" rel="stylesheet" media="all">
	</HEAD>
<BODY>

<div id="content_border">
		<P>Benutzer sollten einige &Auml;nderungen der Standard-Einstellungen von TeXShop in Betracht ziehen. Die meisten dieser &Auml;nderungen basieren auf Besonderheiten einiger Bildschirme und k&ouml;nnen daher erst sp&auml;ter festgelegt werden. </P>
		<p>Normalerweise &ouml;ffnet TeXShop das Vorschau-Fenster an der Stelle, an der es zuletzt ge&ouml;ffnet war. Das macht dann Sinn, wenn Sie meist mit h&ouml;chstens einem Dokument arbeiten. Es kann besser sein das Quelltext- und Vorschau-Fenster in einer optimalen Position zu &ouml;ffnen. Um diese Einstellung zu treffen, setzen Sie ein beliebiges Dokument. Platzieren Sie nun die Fenster an die gew&uuml;nschte Position auf dem Bildschirm. Wenn Sie gen&uuml;gend Platz auf dem Bildschirm haben, wird es das Beste sein, beide Fenster neben einander anzuordnen. &Ouml;ffnen Sie nun den Titel &bdquo;Dokument&ldquo; in den Einstellungen. Markieren Sie &bdquo;Fenster immer an fester Position&ldquo; und klicken Sie dann auf &bdquo;Aktuelle Position merken&ldquo;. Treffen Sie die selben Einstellungen unter dem Titel &bdquo;Voransicht&ldquo;.</p>
		<p>Wollen Sie die Vergr&ouml;&szlig;erung im Vorschau-Fenster einstellen, m&uuml;ssen Sie wie folgt vorgehen. Benutzen Sie den Vergr&ouml;&szlig;erungsknopf im Vorschau-Fenster um die optimale Vergr&ouml;&szlig;erung festzustellen. Tragen Sie diesen Wert unter dem Titel &bdquo;Voransicht&ldquo; in den Einstellungen ein und klicken Sie auf &bdquo;Anwenden&ldquo;. Schlie&szlig;en Sie den Dialog nun mit &bdquo;OK&ldquo; ab.</p>
		<p>Schlie&szlig;lich k&ouml;nnen Sie sich &uuml;ber Sicherheitsfragen Gedanken machen. Normalerweise ist TeXShop so eingestellt, dass es pdftex und pdflatex erlaubt andere Programme w&auml;hrend des Setzens aufzurufen. Wenn pdftex zum Beispiel eine Grafik in einem Format findet, das es nicht erkennt, ruft es ein Konvertierungsprogramm auf, das diese Grafik in ein f&uuml;r pdftex erkennbares Format umwandelt. So werden eps-Dateien in pdf und gif-Dateien in das png-Format konvertiert.</p>
<p>Diese Einstellung macht es jedoch m&ouml;glich jedes beliebige Programm aufzurufen. Dies kann dazu f&uuml;hren, dass eine b&ouml;sartige TeX-Quelldatei, die Sie per E-Mail erhalten, ihr System besch&auml;digen k&ouml;nnte. Daher k&ouml;nne Sie unter dem Titel &bdquo;Programme&ldquo; die Einstellung &bdquo;Shell Escape Warnung&ldquo; ein- oder ausschalten. Hierdurch werden Sie, wenn Sie eine Datei zu ersten Mal setzen, gefragt, ob pdftex ein anderes Programm aufrufen darf. Hierdurch k&ouml;nnen sie die automatische Konvertierung f&uuml;r ihre eigenen Programme benutzen, f&uuml;r fremde Programme jedoch jeweils die sichere L&ouml;sung w&auml;hlen und einen Aufruf anderer Programme unterbinden.</p>
</div>		
<div id="header_background"></div>
<div id="header_logo"><a href="../TeXShop%20Help.html"><IMG HEIGHT="40" WIDTH="40" border="0" SRC="../gfx/xicnsc.gif"></a></div>
<div id="header_chapter">Wie konfiguriere ich TeXShop?</div>
<div id="header_title">Empfohlene &Auml;nderung von Einstellungen</div>


	<div id="menu_border">
		<ul>
			<LI><a href="configure_preliminaries.htm">Einleitung</a>
			<li><a href="configure_correctinstall.htm">Alles richtig installiert?</a>
			<li><a href="configure_prefchanges.htm">Empfohlene &Auml;nderung von Einstellungen</a>
			<LI><a href="configure_convertgraphics.htm">Grafikformate automatisch konvertieren</a>
			<LI><a href="configure_defaults.htm">Standardeinstellungen</a>
			<LI><a href="configure_latextemplate.htm">Die Standard-LaTeX-Vorlage</a>
			<li><a href="configure_hidden.htm">Versteckte Einstellungen</a>
			<li><a href="configure_plist.htm">.plist-Dateien</a>
			<li><a href="configure_panel.htm">Die LaTeX Palette anpassen</a>
			<li><a href="configure_autocompletion.htm">Die automatische Vervollst&auml;ndigung anpassen</a>
			<li><a href="configure_menushortcuts.htm">Tastaturk&uuml;rzel neu festlegen</a>
			<li><a href="configure_macros.htm">Das Makro-Men&uuml; ver&auml;ndern</a>
		</ul>
	</div>
	
	</BODY>
</HTML>